// Процедура-обработчик для подписки на событие AVS_РегистрацияИзмененийМедиа
Процедура AVS_ЗарегистрироватьИзменениеМедиаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// { ПРАВКА: Проверка флага изменений }
	МедиаИзменено = Ложь;
	
	// Передаем Номенклатуру-владельца и строковый код события
	Источник.ДополнительныеСвойства.Свойство("AVS_МедиаИзменено", МедиаИзменено);
	
	Если Не МедиаИзменено Тогда 
		Возврат; // Ничего не поменялось, выходим
	КонецЕсли;

	AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(Источник.AVS_Номенклатура, "MEDIA_CHANGE");
	
КонецПроцедуры