Функция ЗначениеДляJSON(Значение) Экспорт
    Соответствие = Новый Соответствие;
    Соответствие.Вставить(Перечисления.AVS_ТипЗначенияХарактеристики.Строка, "string");
    Соответствие.Вставить(Перечисления.AVS_ТипЗначенияХарактеристики.Число, "number");
    Соответствие.Вставить(Перечисления.AVS_ТипЗначенияХарактеристики.ОдиночныйВыбор, "optionSingle");
    Соответствие.Вставить(Перечисления.AVS_ТипЗначенияХарактеристики.МножественныйВыбор, "optionList");
    Соответствие.Вставить(Перечисления.AVS_ТипЗначенияХарактеристики.ГрупповаяСвязь, "groupLink");
    
    Возврат Соответствие.Получить(Значение);
КонецФункции