&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Данные") Тогда
		
		// 1. Заполняем таблицу на форме из массива структур
		СписокОбъектов.Очистить();
		Для Каждого СтрДанных Из Параметры.Данные.Список Цикл
			НоваяСтр = СписокОбъектов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, СтрДанных);
		КонецЦикла;
		
		// 2. Формируем строку статистики и записываем в реквизит ТекстИтогов
		// (Так как это поле ввода, значение отобразится в нем само)
		ТекстИтогов = СтрШаблон("Характеристик: %1 | Категорий: %2 | Товаров: %3 | Связок: %4 | Удалённые: %5", 
			Параметры.Данные.КолХарактеристик, 
			Параметры.Данные.КолКатегорий,
			Параметры.Данные.КолТоваров,
			Параметры.Данные.КолСвязок,
			Параметры.Данные.КолУдаленных);
			
	КонецЕсли;
	
КонецПроцедуры