#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем МетаданныеОписание Экспорт;
Перем СсылочныеТипы Экспорт;
Перем СоответствиеОбъектовМетаданныхИСсылочныхТипов;
Перем ОбработанныхКонстант Экспорт;
Перем ОбработанныхНаборовЗаписей Экспорт;
Перем мСоответствиеКолонокДвижений;

// массив строк дерева метаданных, имеющих признак Выгружать
Перем СоставПолнойВыгрузки Экспорт;
// массив строк дерева метаданных, имеющих признак выгрузки по ссылке
Перем СоставВспомогательнойВыгрузки;

// массив регистров, использующих итоги
Перем ИспользующиеИтоги;

Перем мТипРезультатЗапроса; 
Перем мТипДанныхУдаления;

Перем мВыгруженныеОбъекты;
Перем мКоличествоСохраненныхПоследнихВыгрузок;

Перем мНаличиеВыгрузкиПодчиненныхОбъектов;
Перем ТаблицаПредопределенных;
Перем СоответствиеЗаменыСсылок;
Перем Сериализатор;


//+ Адаптивная часть
Перем мВсеОбъектыКонфигурации;

Перем мКэшСвойствXDTO;
Перем мОписанияТиповКонфигурации;
Перем мДокументDOM;

Перем мСоответствиеВидовбъектов;
Перем мСловарьАнглРус;
Перем мОшибкиБезПовторов;
Перем мВсегоОбъектов;

Перем мСоотвОбъектовМетаданныхДерева;
Перем мВыгружаемыхВсего;
Перем мПодсчитанныеОбъекты;
Перем мЭтоФоновыйРежим;
Перем мМодульДлительныеОперации;
Перем мДлительныеОперации;

	

// Для внутреннего использования.
Функция СведенияОВнешнейОбработке() Экспорт
	Перем ПараметрыРегистрации;
	
	Если ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
		МодульДополнительныеОтчетыИОбработки = ОбщийМодуль("ДополнительныеОтчетыИОбработки");
		МодульДополнительныеОтчетыИОбработкиКлиентСервер = ОбщийМодуль("ДополнительныеОтчетыИОбработкиКлиентСервер");
		
		ПараметрыРегистрации = МодульДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1");
		
		ПараметрыРегистрации.Вид = МодульДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
		ПараметрыРегистрации.Версия = "0.0.1";
		ПараметрыРегистрации.БезопасныйРежим = Ложь;
		
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление = НСтр("ru = 'Выгрузка и загрузка данных XML АДАПТИВНАЯ'");
		НоваяКоманда.Идентификатор = "ВыгрузкаЗагрузкаДанныхXMLАдаптивная";
		НоваяКоманда.Использование = МодульДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
		НоваяКоманда.ПоказыватьОповещение = Ложь;
	КонецЕсли;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Процедура создает файл выгрузки
//
// Параметры
//   ИмяФайла - имя файла выгрузки
//
Процедура ВыполнитьВыгрузку(СтруктураПараметров, ТолькоПроверкаНедопустимыхСимволов = Ложь) Экспорт
	
	мЭтоФоновыйРежим = Адапт_ЭтоФоновыйРежим();
	
	ИмяФайла = СтруктураПараметров.ИмяФайла;
		
	ШаблонНачалоВыгрузки = Нстр("ru = 'Начало выгрузки: %Дата'");
	СообщениеНачалоВыгрузки = СтрЗаменить(ШаблонНачалоВыгрузки, "%Дата", ТекущаяДатаСеанса());
	СообщитьПользователю(СообщениеНачалоВыгрузки);
	Адапт_СообщитьПрогрессВыгрузки(,,"Инициализация выгрузки...");
	
	ОбъектыВыгруженныеСОшибками = Новый Соответствие;
	
	СоставВыгрузки();
	 
	
	Если Ложь Тогда ДополнительныеОбъектыДляВыгрузки = Новый ТаблицаЗначений КонецЕсли;
	
	Если СоставПолнойВыгрузки.Количество() = 0
		И ДополнительныеОбъектыДляВыгрузки.Количество() = 0 Тогда
		
		СообщитьПользователю(Нстр("ru = 'Не задан состав выгрузки'"));
		Возврат;
		
	КонецЕсли;
	
	
	
	Если ТолькоПроверкаНедопустимыхСимволов Тогда
		
		ЗаписьXML = СоздатьОбъектЗаписиXMLДляПроверки();
		
		ВыгрузкаДанных(ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов, ОбъектыВыгруженныеСОшибками);
		
	Иначе
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
			
		
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("_1CV8DtUD_Adapt", "http://www.1c.ru/V8/1CV8DtUD/");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("V8Exch", "http://www.1c.ru/V8/1CV8DtUD/");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("core", "http://v8.1c.ru/data");
		
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/8.1/data/enterprise/current-config");
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("V8Exch:Data");
		
		
		ИнициализироватьСериализаторXDTOСАннотациейТипов();
		
		ВыгрузкаДанных(ЗаписьXML);
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //V8Exc:Data
		ВыгрузитьТаблицуПредопределенных(ЗаписьXML);
		ЗаписьXML.ЗаписатьКонецЭлемента(); //V8Exc:_1CV8DtUD_Adapt
		
	КонецЕсли;
	
	//+ Muraviev Sergey 2024.01.05
	ЗаписьXML.Закрыть();
	
	Если ТолькоПроверкаНедопустимыхСимволов Тогда
		
		ШаблонПроверено = Нстр("ru = 'Проверено объектов: %Проверено'");
		СообщениеПроверено = СтрЗаменить(ШаблонПроверено, "%Проверено", ВсегоОбработанныхЗаписей());
		СообщитьПользователю(СообщениеПроверено);
		
		ШаблонОкончание = Нстр("ru = 'Окончание проверки: %Дата'");
		СообщениеОкончание = СтрЗаменить(ШаблонОкончание, "%Дата", ТекущаяДатаСеанса());
		СообщитьПользователю(СообщениеОкончание);
		
	Иначе
		
		ШаблонВыгружено = Нстр("ru = 'Выгружено объектов: %Выгружено'");
		СообщениеВыгружено = СтрЗаменить(ШаблонВыгружено, "%Выгружено", ВсегоОбработанныхЗаписей());
		СообщитьПользователю(СообщениеВыгружено);
		
		ШаблонОкончание = Нстр("ru = 'Окончание выгрузки: %Дата'");
		СообщениеОкончание = СтрЗаменить(ШаблонОкончание, "%Дата", ТекущаяДатаСеанса());
		СообщитьПользователю(СообщениеОкончание);
		
		СообщитьПользователю(Нстр("ru = 'Выгрузка данных успешно завершена'"));
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура разбирает файл выгрузки и осуществляет запись в ИБ сохраненных
// там объектов
//
// Параметры
//   ИмяФайла - имя файла выгрузки
//
Процедура ВыполнитьЗагрузку(СтруктураПараметров, АдресРезультата) Экспорт
	
	мЭтоФоновыйРежим = Адапт_ЭтоФоновыйРежим();
	мДлительныеОперации = Адапт_ОбщийМодуль("ДлительныеОперации");
	
	ИмяФайла = СтруктураПараметров.ИмяФайла;
	Файл = Новый Файл(ИмяФайла);
	
	ПриЗагрузкеИспользоватьРежимОбменаДанными = СтруктураПараметров.ПриЗагрузкеИспользоватьРежимОбменаДанными;
	ПродолжитьЗагрузкуВСлучаеВозникновенияОшибки = СтруктураПараметров.ПродолжитьЗагрузкуВСлучаеВозникновенияОшибки;
	
	ЗагружатьТолькоНовыеИИзмененные = СтруктураПараметров.ЗагружатьТолькоНовыеИИзмененные;
	
	ЗагрузкаВФоновомРежиме = Адапт_ЭтоФоновыйРежим();
	
	
	ШаблонСообщения = Нстр("ru = 'Начало загрузки: %Дата'");
	ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Дата", ТекущаяДатаСеанса());
	
	СообщитьПользователю(ТекстСообщения);
	
	////////////////
	ЗамерВремениНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	////
	
	Адапт_СообщитьПрогрессЗагрузки(,,"Инициализация загрузки...");
	
	ЧтениеXML = Адапт_ПолучитьЧтениеXMLИзФайла(ИмяФайла);
	Если ЧтениеXML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьТаблицуПредопределенных(ЧтениеXML);
	ЗаменитьСсылкиНаПредопределенные(ИмяФайла);
	
	ЧтениеXML = Адапт_ПолучитьЧтениеXMLИзФайла(ИмяФайла);
	Если ЧтениеXML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	// чтение и запись в ИБ записанных в выгрузке объектов
	Если Адапт_ПрочитатьУзел(ЧтениеXML) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Загружено = 0;
	Записанных = 0;
	УбратьИспользованиеИтогов();
	
	ИнициализироватьСериализаторXDTOСАннотациейТипов();
		
	ПостроительDOM = Новый ПостроительDOM;
	мДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	Корень = мДокументDOM.ПервыйДочерний;
	Данные = Корень.ПервыйДочерний;
	Объекты = Данные.ДочерниеУзлы;
	
	мКэшСвойствXDTO = Новый Соответствие;
	
	
	
	
	Адапт_ИнициализироватьОписаниеТиповКонфигурации();
	Адапт_ИнициализироватьСвойстваXDTOЭтойКонфигурации();
	Адапт_ИнициализироватьСоответствиеВидовОбъектов();
	
	КоличествоОбъектов = Объекты.Количество();
	
	
	Для Сч = 0 По КоличествоОбъектов - 1 Цикл
		
		Если ЗагрузкаВФоновомРежиме = Истина Тогда
			Адапт_СообщитьПрогрессЗагрузки(КоличествоОбъектов, Сч);	
		КонецЕсли;
		
		
		выбОбъект = Объекты[Сч];
		ОбъектМодифицирован = Ложь;
		
		ПространствоИмен = выбОбъект.URIПространстваИмен;
		Если Не ЗначениеЗаполнено(ПространствоИмен) Тогда
			ПространствоИмен = "http://v8.1c.ru/8.1/data/enterprise/current-config";
		КонецЕсли;
		ИмяОбъекта = Адапт_ПолучитьИмяОбъекта(выбОбъект);

		
		ТипОбъектаXDTOСоздаваемогоОбъекта = ФабрикаXDTO.Тип(ПространствоИмен, ИмяОбъекта);
		
		Если ТипОбъектаXDTOСоздаваемогоОбъекта = Неопределено Тогда
			СообщитьПользователю("В метаданных не найден вид объекта: " + ИмяОбъекта);
			Продолжить;
		КонецЕсли;
		
		НовыйОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTOСоздаваемогоОбъекта);
		
		СвойстваОбъектаТекущейКонфигурации = Адапт_ПолучитьСвойстваОбъектаXDTOТекущейКонфигурации(ИмяОбъекта);
		СтруктураРезультата = Адапт_ЗаполнитьСвойстваОбъектаXDTO(НовыйОбъектXDTO, выбОбъект.ДочерниеУзлы, ИмяОбъекта, СвойстваОбъектаТекущейКонфигурации);
		ГУИД = СтруктураРезультата.ГУИД;
		Если СтруктураРезультата.Ошибка Тогда
			Продолжить;
		КонецЕсли;
		
		
		Если Адапт_ЭтоКонстанта(ИмяОбъекта) Тогда
			ЗагруженноеЗначение = Адапт_ОбновитьКонстанту(ИмяОбъекта, НовыйОбъектXDTO, ОбъектМодифицирован);
		ИначеЕсли Адапт_ЭтоНаборЗаписейРегистра(ИмяОбъекта) Тогда
			ЗагруженноеЗначение = Адапт_СоздатьНаборЗаписейРегистра(ИмяОбъекта, НовыйОбъектXDTO);
		Иначе
			ЗагруженноеЗначение = Адапт_СоздатьОбновитьОбъект(ТипОбъектаXDTOСоздаваемогоОбъекта.Имя, НовыйОбъектXDTO, ГУИД);
		КонецЕсли;
		
		ОбъектМодифицирован = Адапт_ПолучитьМодифицированностьОбъекта(ЗагруженноеЗначение, ОбъектМодифицирован);


		Если ПриЗагрузкеИспользоватьРежимОбменаДанными И Адапт_ЕстьСвойство(ЗагруженноеЗначение, "ОбменДанными") Тогда
			ЗагруженноеЗначение.ОбменДанными.Загрузка = Истина;
		КонецЕсли;
		
		Адапт_ЗаполнитьДополнительныеСвойства(ЗагруженноеЗначение, СтруктураПараметров);
		

		Попытка
			Если ЗагружатьТолькоНовыеИИзмененные = Ложь Или ОбъектМодифицирован Тогда
				
				ЗагруженноеЗначение.Записать();

				Записанных = Записанных + 1;
			Иначе
				ЗагруженноеЗначение = Неопределено;
			КонецЕсли;
			Загружено = Загружено + 1;

		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			Если НЕ ПродолжитьЗагрузкуВСлучаеВозникновенияОшибки Тогда
				
				ВосстановитьИспользованиеИтогов();
				ВызватьИсключение;
				
			Иначе
				
				Попытка
					ТекстСообщения = Нстр("ru = 'При загрузке объекта %1(%2) возникла ошибка:
					|%3'");
					ТекстСообщения = ПодставитьПараметрыВСтроку(ТекстСообщения, ЗагруженноеЗначение, ТипЗнч(ЗагруженноеЗначение), ТекстОшибки);
				Исключение
					ТекстСообщения = Нстр("ru = 'При загрузке данных возникла ошибка:
					|%1'");
					ТекстСообщения = ПодставитьПараметрыВСтроку(ТекстСообщения, ТекстОшибки);
				КонецПопытки;
				
				СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	

	
	ВосстановитьИспользованиеИтогов();
	
	
	ШаблонЗагружено = "Загружено объектов: %1 из %2";
	СообщениеЗагружено = СтрШаблон(ШаблонЗагружено, Загружено, Объекты.Количество()); 
	
	Если ЗагружатьТолькоНовыеИИзмененные Тогда
		ШаблонЗаписано = "Записано новых или измененных объектов: %1";
	Иначе
		ШаблонЗаписано = "Записано объектов: %1";
	КонецЕсли;
	
	СообщениеЗаписано = СтрШаблон(ШаблонЗаписано, Записанных);
	
	СообщениеОкончание = "Окончание загрузки: " + ТекущаяДатаСеанса();
	
	СообщитьПользователю(СообщениеЗагружено);
	СообщитьПользователю(СообщениеЗаписано);
	СообщитьПользователю(СообщениеОкончание);
	
	
	
	
	///////////////
	ЗамерВремениОкончание = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Разница	= ЗамерВремениОкончание - ЗамерВремениНачало;
	
	ТекстСообщения = Адапт_ТекстЗамераВремени(Разница);
	СообщитьПользователю(ТекстСообщения);
	////
	
	СообщитьПользователю(Нстр("ru = 'Загрузка данных успешно завершена'"));
	
	
КонецПроцедуры

// Процедура производит начальную инициализацию - заполнение дерева описания
// классов объектов метаданных, дерево метаданных, список ссылочных типов
//
// Параметры
//
Процедура Инициализация() Экспорт
	
	ВключитьВозможностьРедактированияИспользованияИтогов = Ложь;
	
	мДлительныеОперации = Адапт_ОбщийМодуль("ДлительныеОперации");
	
	// Создаем объект, описывающий процессы построения дерева и выгрузку
	ЗаполнитьОписаниеМетаданных();
	
	МетаданныеОписание = МетаданныеОписание.Строки[0];
	
	СсылочныеТипы = Новый Соответствие;
	СоответствиеОбъектовМетаданныхИСсылочныхТипов = Новый Соответствие;
	
	ДеревоМетаданных.Колонки.Очистить();
	// создание необходимых колонок
	ДеревоМетаданных.Колонки.Добавить("Выгружать", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ДеревоМетаданных.Колонки.Добавить("ВыгружатьПриНеобходимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ДеревоМетаданных.Колонки.Добавить("Метаданные");
	ДеревоМетаданных.Колонки.Добавить("ЭлементОписания");
	ДеревоМетаданных.Колонки.Добавить("ОбъектМД");
	ДеревоМетаданных.Колонки.Добавить("ПолноеИмяМетаданных");
	ДеревоМетаданных.Колонки.Добавить("НастройкиПостроителя");
	ДеревоМетаданных.Колонки.Добавить("ИспользоватьОтбор");
	ДеревоМетаданных.Колонки.Добавить("ИндексКартинки");
	ДеревоМетаданных.Колонки.Добавить("Развернут");
	
	ДеревоМетаданных.Колонки.Добавить("ДоступенОтбор");
	ДеревоМетаданных.Колонки.Добавить("Отбор");
	
	ИспользующиеИтоги = Новый Массив;
	Корень = ДеревоМетаданных.Строки.Добавить();
	
	ВсеМетаданные = Метаданные;
	ПостроениеПоддереваОбъекта(Метаданные, Корень, МетаданныеОписание, ВсеМетаданные);
	
	
	
	СверткаПоддереваОбъекта(Корень);
	
	Для Каждого Эл Из СсылочныеТипы Цикл
		СоответствиеОбъектовМетаданныхИСсылочныхТипов.Вставить(Эл.Значение, Эл.Ключ);
	КонецЦикла;
	
КонецПроцедуры	

Функция СоздатьОбъектЗаписиXMLДляПроверки()
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-16");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проверка");
	
	Возврат ЗаписьXML;
	
КонецФункции

// Для внутреннего использования
//
Процедура ВыполнитьПроверкуДляВыгрузкиОбъектовИзПланаОбмена(СсылкаНаУзел) Экспорт
	
	ОбъектыВыгруженныеСОшибками = Новый Соответствие;
	ВсегоОбработаноОбъектов = 0;
	КоличествоОшибок = 0;
	
	ЗаписьXML = СоздатьОбъектЗаписиXMLДляПроверки();
	
	СоставВыгрузки();
	МассивМетаданныхДляВыгрузки = Новый Массив();
	
	Для Каждого СтрокаТаблицыВыгрузки Из СоставПолнойВыгрузки Цикл
		
		СтрокаДереваМетаданных = СтрокаТаблицыВыгрузки.СтрокаДерева;
			
		МассивМетаданныхДляВыгрузки.Добавить(СтрокаДереваМетаданных.ОбъектМД);
				
	КонецЦикла;
	
	Если МассивМетаданныхДляВыгрузки.Количество() = 0 Тогда
		МассивМетаданныхДляВыгрузки = Неопределено;
	КонецЕсли;
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(СсылкаНаУзел, СсылкаНаУзел.НомерОтправленного + 1, МассивМетаданныхДляВыгрузки);
	Пока ВыборкаИзменений.Следующий() Цикл
		
		// измененный элемент
		Данные = ВыборкаИзменений.Получить();
		
		// данные должны быть
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоУдаление = (мТипДанныхУдаления = ТипЗнч(Данные));
		
		Если ЭтоУдаление Тогда
			Продолжить;
		КонецЕсли;
		
		ВсегоОбработаноОбъектов = ВсегоОбработаноОбъектов + 1;
		
		МетаданныеОбъекта = Данные.Метаданные();
		
		Попытка
		
			ВыполнитьВспомогательныеДействияДляЗаписиXML(ВсегоОбработаноОбъектов, ЗаписьXML, Истина);
			
			Сериализатор.ЗаписатьXML(ЗаписьXML, Данные);
			
		Исключение
			
			КоличествоОшибок = КоличествоОшибок + 1;
			
			СтрокаОписанияОшибки = ОписаниеОшибки();
			
			// для ссылочных добавляем ссылку, а для не ссылочных сам объект
			ЭтоНеСсылка = Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта)
				ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаданныеОбъекта)
				ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеОбъекта)
				ИЛИ Метаданные.Константы.Содержит(МетаданныеОбъекта);
			
			Если ЭтоНеСсылка Тогда
				
				ОбъектыВыгруженныеСОшибками.Вставить(Данные, СтрокаОписанияОшибки);
				
			Иначе	
			
				Если ОбъектыВыгруженныеСОшибками.Получить(Данные.Ссылка) = Неопределено Тогда
					ОбъектыВыгруженныеСОшибками.Вставить(Данные.Ссылка, СтрокаОписанияОшибки);
				КонецЕсли;
				
			КонецЕсли;
						
		КонецПопытки;
		
	КонецЦикла;
	
	СформироватьТаблицуОшибок(ОбъектыВыгруженныеСОшибками);
	
КонецПроцедуры

Функция СформироватьТаблицуОшибок(ОбъектыВыгруженныеСОшибками)
	
	Если ОбъектыВыгруженныеСОшибками.Количество() = 0 Тогда
		СообщитьПользователю(Нстр("ru = 'Проверка объектов на наличие недопустимых символов завершена. Ошибок не обнаружено.'"));
	Иначе
		
		СтрокаПоискаОшибки = "ЗаписатьXML):";
		ДлинаСтрокиПоиска = СтрДлина(СтрокаПоискаОшибки);
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("Объект");
		ТаблицаДанных.Колонки.Добавить("ТекстОшибки");
		
		Для Каждого СтрокаСоответствия Из ОбъектыВыгруженныеСОшибками Цикл
			
			СтрокаТаблицы = ТаблицаДанных.Добавить();
			СтрокаТаблицы.Объект = Строка(СтрокаСоответствия.Ключ);
			
			// служебные символы удалим из ошибки
			ТекстСообщения = СформироватьТекстСообщенияБезСлужебныхСимволов(СтрокаСоответствия.Значение);
			
			ПозицияНачалаОшибки = Найти(ТекстСообщения, "ЗаписатьXML):");
			Если ПозицияНачалаОшибки > 0 Тогда
				
				ТекстСообщения = Сред(ТекстСообщения, ПозицияНачалаОшибки + ДлинаСтрокиПоиска);
				
			КонецЕсли;
			
			СтрокаТаблицы.ТекстОшибки = СокрЛП(ТекстСообщения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьТекстСообщенияБезСлужебныхСимволов(Знач ТекстСообщения)

	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	
	Если ОкончаниеСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения < ОкончаниеСлужебногоСообщения Тогда
		
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
		                 Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
						 
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);

КонецФункции // ()

// Процедура рекурсивно обрабатывает дерево метаданных, образуя списки полной и вспомогательной выгрузки
//
// Параметры
//
Процедура СоставВыгрузки(ПересчитатьВыгружаемыеПоСсылке = Ложь) Экспорт
	
	СоставПолнойВыгрузки = Новый ТаблицаЗначений;
	СоставПолнойВыгрузки.Колонки.Добавить("ОбъектМД");
	СоставПолнойВыгрузки.Колонки.Добавить("СтрокаДерева");	
	СоставПолнойВыгрузки.Индексы.Добавить("ОбъектМД");
	
	СоставВспомогательнойВыгрузки = Новый ТаблицаЗначений;
	СоставВспомогательнойВыгрузки.Колонки.Добавить("ОбъектМД");
	СоставВспомогательнойВыгрузки.Колонки.Добавить("СтрокаДерева");	
	СоставВспомогательнойВыгрузки.Индексы.Добавить("ОбъектМД");
			
	Для Каждого СтрокаДЗ Из ДеревоМетаданных.Строки Цикл
		ДобавитьВыгружаемыеОбъекты(СоставПолнойВыгрузки, СоставВспомогательнойВыгрузки, СтрокаДЗ);
	КонецЦикла;
	
	мНаличиеВыгрузкиПодчиненныхОбъектов = СоставВспомогательнойВыгрузки.Количество() > 0;
	
	Если ПересчитатьВыгружаемыеПоСсылке Тогда
		
		ПересчитатьВыгружаемыеПоСсылке(СоставПолнойВыгрузки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеМассиваСсылок(МассивСсылок, СтрокаИмяДляЗапроса, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов = Ложь, ОбъектыВыгруженныеСОшибками = Неопределено)
	
	Если МассивСсылок.Количество() = 0
		ИЛИ НЕ ЗначениеЗаполнено(СтрокаИмяДляЗапроса) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ разрешенные _.*
	               |	
	               |ИЗ
	               |	" + СтрокаИмяДляЗапроса + " КАК _
	               |ГДЕ
	               |	_.Ссылка В(&МассивСсылок)";
				   
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗапросИЗапись(РезультатЗапроса, ЗаписьXML, Истина, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
	
КонецПроцедуры

// Процедура записывает наборы записей регистра (накопления, бухгалтерии...)
//
// Параметры
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//
Процедура ВыгрузкаДанных(ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов = Ложь, ОбъектыВыгруженныеСОшибками = Неопределено)
	
	мВыгруженныеОбъекты = Новый ТаблицаЗначений;
	мВыгруженныеОбъекты.Колонки.Добавить("Ссылка");
	мВыгруженныеОбъекты.Индексы.Добавить("Ссылка");
	
	ЭтоФоновыйРежим = Адапт_ЭтоФоновыйРежим();
	Адапт_СообщитьПрогрессВыгрузки(,, "Инициализация выгрузки....");
	
	ИнициализироватьТаблицуПредопределенных();
	
	Если ОбъектыВыгруженныеСОшибками = Неопределено Тогда
		ОбъектыВыгруженныеСОшибками = Новый Соответствие;
	КонецЕсли;
	
	Если Ложь Тогда ДополнительныеОбъектыДляВыгрузки = Новый ТаблицаЗначений КонецЕсли;
	
	мВыгружаемыхВсего = Адапт_ПодсчитатьКоличествоВыгружаемыхОбъектов();
	
	Попытка
		
		Для Каждого СтрокаТаблицыВыгрузки Из СоставПолнойВыгрузки Цикл
			
			СтрокаДереваМетаданных = СтрокаТаблицыВыгрузки.СтрокаДерева;
			
			Если СтрокаДереваМетаданных.ЭлементОписания.Менеджер = Неопределено Тогда
				ВызватьИсключение(Нстр("ru = 'Выгрузка данных. Внутренняя ошибка'"));
			КонецЕсли;
			
			Если Метаданные.Константы.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
				
				ЗаписьКонстанты(ЗаписьXML, СтрокаДереваМетаданных.ОбъектМД, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
				
			ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтрокаДереваМетаданных.ОбъектМД) Или
				Метаданные.РегистрыНакопления.Содержит(СтрокаДереваМетаданных.ОбъектМД) Или
				Метаданные.РегистрыРасчета.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
				
				ЗаписьРегистра(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
				
			ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
				
				ЗаписьРегистра(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов, Истина);
				
			ИначеЕсли ТипЗнч(СтрокаДереваМетаданных.ЭлементОписания.Менеджер) = Тип("Строка") Тогда
				// специальный случай для перерасчетов
				ЗаписьПерерасчета(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
				
			ИначеЕсли Метаданные.Последовательности.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
				
				ЗаписьПоследовательности(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
				
			Иначе
				
				ЗаписьДанныхОбъектногоТипа(СтрокаДереваМетаданных, ЗаписьXML, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
				
			КонецЕсли;
		
		КонецЦикла;
		
		ДополнительныеОбъектыДляВыгрузки.Сортировать("ИмяОбъектаДляЗапроса");
		ТекущийМассивСсылок = Новый Массив();
		ТекущееИмяЗапроса = "";
		
		Для Каждого СтрокаТаблицыВыгрузки Из ДополнительныеОбъектыДляВыгрузки Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицыВыгрузки.Объект)
				ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыВыгрузки.ИмяОбъектаДляЗапроса) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если ТекущееИмяЗапроса <> СтрокаТаблицыВыгрузки.ИмяОбъектаДляЗапроса Тогда
				
				ВыгрузитьДанныеМассиваСсылок(ТекущийМассивСсылок, ТекущееИмяЗапроса, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов, ОбъектыВыгруженныеСОшибками);
				
				ТекущийМассивСсылок = Новый массив();
				ТекущееИмяЗапроса = СтрокаТаблицыВыгрузки.ИмяОбъектаДляЗапроса;
				
			КонецЕсли;
			
			ТекущийМассивСсылок.Добавить(СтрокаТаблицыВыгрузки.Объект);
			
		КонецЦикла;
		
		ВыгрузитьДанныеМассиваСсылок(ТекущийМассивСсылок, ТекущееИмяЗапроса, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов, ОбъектыВыгруженныеСОшибками);
		
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Для внутреннего использования
//
Функция ПолучитьСтрокуОграниченияПоДатеДляЗапроса(Свойства, ИмяТипа) Экспорт
	
	ИтоговоеОграничениеПоДате = "";
	ИмяАлиасаТаблицы = "_";
	
	Если НЕ (ИмяТипа = "Документ" ИЛИ ИмяТипа = "РегистрСведений" ИЛИ ИмяТипа = "Регистр") Тогда
		Возврат ИтоговоеОграничениеПоДате;
	КонецЕсли;
		
	ИмяПоляОграничения = ИмяАлиасаТаблицы + "." + ?(ИмяТипа = "Документ", "Дата", "Период");	
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		
		ИтоговоеОграничениеПоДате = "
		|	ГДЕ
		|		" + ИмяПоляОграничения + " >= &ДатаНачала";
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Если ПустаяСтрока(ИтоговоеОграничениеПоДате) Тогда
			
			ИтоговоеОграничениеПоДате = "
			|	ГДЕ
			|		" + ИмяПоляОграничения + " <= &ДатаОкончания";
			
		Иначе
			
			ИтоговоеОграничениеПоДате = ИтоговоеОграничениеПоДате + "
			|	И
			|		" + ИмяПоляОграничения + " <= &ДатаОкончания";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИтоговоеОграничениеПоДате;
	
КонецФункции

// Для внутреннего использования
//
Функция ПолучитьТекстЗапросаДляРегистраСведений(ИмяМетаданных, ОбъектМетаданных, ЕстьДопОтборы, СтрокаПолейДляВыборки = "")
	
	ЕстьОграничениеПоДатам = ЗначениеЗаполнено(ДатаНачала) Или ЗначениеЗаполнено(ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(СтрокаПолейДляВыборки) Тогда
		СтрокаПолейДляВыборки = "_.*";
	Иначе
		СтрокаПолейДляВыборки = " Различные " +  СтрокаПолейДляВыборки;	
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ Разрешенные " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + " КАК _ ";
	
	Если ОбъектМетаданных.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	// 0 - отбор за период
	// 1 - срез последних на дату окончания
	// 2 - срез первых на дату начала
	// 3 - срез последних на дату начала + отбор за период
	
	Если ТипВыгрузкиПериодическихРегистров = 0 Тогда
		
		Если ЕстьДопОтборы И 
			НЕ ИспользоватьОтборПоДатеДляВсехОбъектов Тогда
			
			Возврат ТекстЗапроса;
			
		КонецЕсли;
		
		ДопОграничениеПоДате = ПолучитьСтрокуОграниченияПоДатеДляЗапроса(ОбъектМетаданных, "РегистрСведений");
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ДопОграничениеПоДате;
		
	ИначеЕсли ТипВыгрузкиПериодическихРегистров = 1 Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ Разрешенные " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + ".СрезПоследних(&ДатаОкончания) КАК _ ";	
		
	ИначеЕсли ТипВыгрузкиПериодическихРегистров = 2 Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ Разрешенные " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + ".СрезПервых(&ДатаНачала) КАК _ ";
		
	ИначеЕсли ТипВыгрузкиПериодическихРегистров = 3 Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ Разрешенные " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + ".СрезПоследних(&ДатаНачала) КАК _ 
		|
		|Объединить все
		|
		|ВЫБРАТЬ " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + " КАК _ ";
		
		ДопОграничениеПоДате = ПолучитьСтрокуОграниченияПоДатеДляЗапроса(ОбъектМетаданных, "РегистрСведений");
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ДопОграничениеПоДате;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляРегистра(ИмяМетаданных, ОбъектМетаданных, ЕстьДопОтборы, СтрокаПолейДляВыборки = "")
	
	ЕстьОграничениеПоДатам = ЗначениеЗаполнено(ДатаНачала) Или ЗначениеЗаполнено(ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(СтрокаПолейДляВыборки) Тогда
		СтрокаПолейДляВыборки = "_.*";
	Иначе
		СтрокаПолейДляВыборки = " РАЗЛИЧНЫЕ " +  СтрокаПолейДляВыборки;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ Разрешенные " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + " КАК _ ";
	
	// возможно нужно ограничение по датам установить
	Если ЕстьОграничениеПоДатам Тогда
		
		Если ЕстьДопОтборы И 
			НЕ ИспользоватьОтборПоДатеДляВсехОбъектов Тогда
			
			Возврат ТекстЗапроса;
			
		КонецЕсли;
		
		ДопОграничениеПоДате = ПолучитьСтрокуОграниченияПоДатеДляЗапроса(ОбъектМетаданных, "Регистр");
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ДопОграничениеПоДате;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Для внутреннего использования
//
Функция ПолучитьТекстЗапросаПоСтроке(СтрокаДереваМетаданных, ЕстьДопОтборы, СтрокаПолейДляВыборки = "") Экспорт
	
	Если ТипЗнч(СтрокаДереваМетаданных) = Тип("СтрокаДереваЗначений") Тогда
		ОбъектМетаданных  = СтрокаДереваМетаданных.Метаданные;
	Иначе	
		ОбъектМетаданных  = Метаданные[СтрокаДереваМетаданных.ПолучитьРодителя().ПолноеИмяМетаданных][СтрокаДереваМетаданных.ПолноеИмяМетаданных];
	КонецЕсли;
	
	ИмяМетаданных     = ОбъектМетаданных.ПолноеИмя();
	
	Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляРегистраСведений(ИмяМетаданных, ОбъектМетаданных, ЕстьДопОтборы, СтрокаПолейДляВыборки);
		Возврат ТекстЗапроса;
		
	ИначеЕсли   Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляРегистра(ИмяМетаданных, ОбъектМетаданных, ЕстьДопОтборы, СтрокаПолейДляВыборки);
		Возврат ТекстЗапроса;
		
	КонецЕсли;
	
	ЕстьОграничениеПоДатам = ЗначениеЗаполнено(ДатаНачала) Или ЗначениеЗаполнено(ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(СтрокаПолейДляВыборки) Тогда
		СтрокаПолейДляВыборки = "_.*";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ Разрешенные " + СтрокаПолейДляВыборки + " ИЗ " + ИмяМетаданных + " КАК _ ";
	
	// возможно нужно ограничение по датам установить
	Если ЕстьОграничениеПоДатам Тогда
		
		Если ЕстьДопОтборы И 
			НЕ ИспользоватьОтборПоДатеДляВсехОбъектов Тогда
			
			Возврат ТекстЗапроса;
			
		КонецЕсли;
		
		ДопОграничениеПоДате = "";
		
		// можно ли для данного объекта МД строить ограничения по датам
		Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			
			ДопОграничениеПоДате = ПолучитьСтрокуОграниченияПоДатеДляЗапроса(ОбъектМетаданных, "Документ");
			
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
			
			ДопОграничениеПоДате = ПолучитьСтрокуОграниченияПоДатеДляЗапроса(ОбъектМетаданных, "Регистр");
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ДопОграничениеПоДате;
		
	КонецЕсли;
					
	Возврат  ТекстЗапроса;
	
КонецФункции

Функция СхемаКомпоновкиДанных(ТекстЗапроса) Экспорт
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "НаборДанных1";
	
	//+ Muraviev Sergey 2024.01.28
	ПолеРегистратор = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеРегистратор.Поле = "Регистратор";
	ПолеРегистратор.ПутьКДанным = "Регистратор";
	ПолеРегистратор.ОграничениеИспользованияРеквизитов.Условие = Истина;
	//- Muraviev Sergey 2024.01.28	
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УстановитьЗначениеПараметраСКД(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра, ИспользоватьНеЗаполненный = Истина) Экспорт
	
	ПараметрУстановлен = Ложь;
	
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ЗначениеПараметраКомпоновкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		
		ЗначениеПараметраКомпоновкиДанных.Значение = ЗначениеПараметра;
		ЗначениеПараметраКомпоновкиДанных.Использование = ?(ИспользоватьНеЗаполненный, Истина, ЗначениеЗаполнено(ЗначениеПараметраКомпоновкиДанных.Значение));
		
		ПараметрУстановлен = Истина;
		
	КонецЕсли;
	
	Возврат ПараметрУстановлен;
	
КонецФункции
	
Процедура УстановитьНастройкуСтруктурыВыводаРезультата(Настройки, ВыводВТабличныйДокумент = Ложь) Экспорт
	
	ГруппировкаКомпоновкиДанных = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		
	ПолеГруппировки = ГруппировкаКомпоновкиДанных.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
			
	Если ВыводВТабличныйДокумент 
		И Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")) <> Неопределено Тогда
		ПолеВыбора = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		ПолеВыбора.Использование = Истина;
	Иначе
		Для Каждого ДоступноеПолеВыбора Из Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля")
				Или ДоступноеПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("ПараметрыДанных") Тогда
				Продолжить;
			КонецЕсли;
			ПолеВыбора = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеВыбора.Поле = ДоступноеПолеВыбора.Поле;
			ПолеВыбора.Использование = Истина;
		КонецЦикла;	
	КонецЕсли;
			
КонецПроцедуры

// Для внутреннего использования
//
Функция ПодготовитьПостроительДляВыгрузки(СтрокаДереваМетаданных, СтрокаПолейДляВыборки = "") Экспорт
	
	ЕстьДопОтборы = (СтрокаДереваМетаданных.НастройкиПостроителя <> Неопределено); 
		
	ТекстЗапроса = ПолучитьТекстЗапросаПоСтроке(СтрокаДереваМетаданных, ЕстьДопОтборы, СтрокаПолейДляВыборки);
	
	ЕстьОтборыКомпоновщика = СтрокаДереваМетаданных.Отбор.Элементы.Количество() <> 0;
	
	Если ЕстьОтборыКомпоновщика Тогда
		
		СхемаКомпоновкиДанных = СхемаКомпоновкиДанных(ТекстЗапроса);
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Отбор, СтрокаДереваМетаданных.Отбор);
		УстановитьНастройкуСтруктурыВыводаРезультата(КомпоновщикНастроек.Настройки);
		УстановитьЗначениеПараметраСКД(КомпоновщикНастроек, "ДатаНачала",        ДатаНачала);
		УстановитьЗначениеПараметраСКД(КомпоновщикНастроек, "ДатаОкончания",     ДатаОкончания);
		// Компоновка макета компоновки данных.
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(
			СхемаКомпоновкиДанных, 
			КомпоновщикНастроек.Настройки, 
			ДанныеРасшифровки, 
			,
			Тип("ГенераторМакетаКомпоновкиДанных")
			);
			
		Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос);
		ИтоговыйТекстЗапроса = Запрос.Текст;	

	Иначе
		
		ИтоговыйТекстЗапроса = ТекстЗапроса;
		
	КонецЕсли;	
		
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.Текст = ИтоговыйТекстЗапроса;
	ПостроительОтчета.ЗаполнитьНастройки();
	
	ПостроительОтчета.Отбор.Сбросить();
	Если ЕстьДопОтборы Тогда
		ПостроительОтчета.УстановитьНастройки(СтрокаДереваМетаданных.НастройкиПостроителя);
	КонецЕсли;
	
	ПостроительОтчета.Параметры.Вставить("ДатаНачала", ДатаНачала);
	ПостроительОтчета.Параметры.Вставить("ДатаОкончания", ДатаОкончания);
	
	Если ЕстьОтборыКомпоновщика Тогда
		Для Каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
			ПостроительОтчета.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПостроительОтчета;
	
КонецФункции

// Формируем текст для использования в запросе, заполняем параметры
//
Функция ТекстОтбораГруппыКомпоновщика(Знач ЭлементыГруппы, СтекГрупп, ПараметрыКомпоновщика)
	КоличествоЭлементов = ЭлементыГруппы.Количество();
	
	Если КоличествоЭлементов = 0 Тогда
		// Пустая группа условий
		Возврат "";
	КонецЕсли;
	
	ТипТекущейГруппы = СтекГрупп[0];
	
	Текст = "";
	ТокенСравнения = ТокенСравненияГруппыОтбораКомпоновки(ТипТекущейГруппы);
	
	Для Каждого Элемент Из ЭлементыГруппы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			// Одиночный элемент
			ИмяПараметра  = "ПараметрОтбора" + Формат(ПараметрыКомпоновщика.Количество(), "ЧН=; ЧГ=");
			
			ПоискПоПодобию = Ложь;
			ПоискПоПодобиюНачинается = Ложь;
			Текст = Текст + " " + ТокенСравнения + " " + ТекстСравненияГруппыОтбораКомпоновки(Элемент.ЛевоеЗначение, Элемент.ВидСравнения, "&" + ИмяПараметра, ПоискПоПодобию, ПоискПоПодобиюНачинается);
			
			Если ПоискПоПодобию Тогда
				ПараметрыКомпоновщика.Вставить(ИмяПараметра, "%" + Элемент.ПравоеЗначение + "%");
			ИначеЕсли ПоискПоПодобиюНачинается Тогда
				ПараметрыКомпоновщика.Вставить(ИмяПараметра, "" + Элемент.ПравоеЗначение + "%");
			Иначе
				ПараметрыКомпоновщика.Вставить(ИмяПараметра, 
					?(ТипЗнч(Элемент.ПравоеЗначение) = Тип("СтандартнаяДатаНачала"), 
						Элемент.ПравоеЗначение.Дата, 
						Элемент.ПравоеЗначение));
			КонецЕсли;
		Иначе
			// Вложенная группа
			СтекГрупп.Вставить(0, Элемент.ТипГруппы);
			Текст = Текст + " " + ТокенСравнения + " " + ТекстОтбораГруппыКомпоновщика(Элемент.Элементы, СтекГрупп, ПараметрыКомпоновщика);
			СтекГрупп.Удалить(0);
		КонецЕсли;
		
	КонецЦикла;
	
	Текст = Сред(Текст, 2 + СтрДлина(ТокенСравнения));
	Возврат ТокенОткрытияГруппыОтбораКомпоновки(ТипТекущейГруппы) 
		+ "(" + Текст + ")";
КонецФункции

// Токен сравнения элементов внутри группы
//
Функция ТокенСравненияГруппыОтбораКомпоновки(Знач ТипГруппы)
	
	Если ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда 
		Возврат "И";
		
	ИначеЕсли ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда 
		Возврат "ИЛИ";
		
	ИначеЕсли ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
		Возврат "И";
		
	КонецЕсли;
	
	Возврат "";
КонецФункции

// Токен операции перед группой
//
Функция ТокенОткрытияГруппыОтбораКомпоновки(Знач ТипГруппы)
	
	Если ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
		Возврат "НЕ"
	КонецЕсли;
	
	Возврат "";
КонецФункции

// Текст сравнения двух операндов по виду сравнения
//
Функция ТекстСравненияГруппыОтбораКомпоновки(Знач Поле, Знач ВидСравнения, Знач ИмяПараметра, ИспользованПоискПоПодобию = Ложь, ИспользованПоискПоПодобиюНачинается = Ложь)
	
	ИспользованПоискПоПодобию = Ложь;
	ПолеСравнения             = Строка(Поле);
	
	Если ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		Возврат ПолеСравнения + " > " + ИмяПараметра;
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		Возврат ПолеСравнения + " >= " + ИмяПараметра;
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
		Возврат ПолеСравнения + " В ИЕРАРХИИ (" + ИмяПараметра + ") ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		Возврат ПолеСравнения + " В (" + ИмяПараметра + ") ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии  Тогда
		Возврат ПолеСравнения + " В ИЕРАРХИИ (" + ИмяПараметра + ") ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
		ИспользованПоискПоПодобию = Истина;
		Возврат ПолеСравнения + " НЕ ПОДОБНО """" ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		Возврат ПолеСравнения + " < " + ИмяПараметра;
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		Возврат ПолеСравнения + " <= " + ИмяПараметра;
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		Возврат ПолеСравнения + " НЕ В ИЕРАРХИИ (" + ИмяПараметра + ") ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		Возврат ПолеСравнения + " НЕ В (" + ИмяПараметра + ")";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		Возврат ПолеСравнения + " НЕ В ИЕРАРХИИ (" + ИмяПараметра + ") ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		ИспользованПоискПоПодобию = Истина;
		Возврат ПолеСравнения + " ПОДОБНО """" ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		Возврат ПолеСравнения + " <> " + ИмяПараметра + " ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
		ИспользованПоискПоПодобию = Истина;
		Возврат ПолеСравнения + " НЕ ПОДОБНО " + ИмяПараметра + " ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		Возврат ПолеСравнения + " = " + ИмяПараметра;
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
		ИспользованПоискПоПодобию = Истина;
		Возврат ПолеСравнения + " ПОДОБНО " + ИмяПараметра + " ";;
		
	// Дополнительные виды сравнения	
	
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС Тогда
		ИспользованПоискПоПодобиюНачинается = Истина;
		Возврат ПолеСравнения + " ПОДОБНО " + ИмяПараметра + " ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеНачинаетсяС Тогда
		ИспользованПоискПоПодобиюНачинается = Истина;
		Возврат ПолеСравнения + " НЕ ПОДОБНО " + ИмяПараметра + " ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Подобно Тогда
		Возврат ПолеСравнения + " ПОДОБНО " + ИмяПараметра + " ";
		
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеПодобно Тогда
		Возврат ПолеСравнения + " НЕ ПОДОБНО " + ИмяПараметра + " ";
		
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ПолучитьРезультатЗапросаСОграничениями(СтрокаДереваМетаданных)
	
	ПостроительОтчета = ПодготовитьПостроительДляВыгрузки(СтрокаДереваМетаданных);

	ПостроительОтчета.Выполнить();
	РезультатЗапроса = ПостроительОтчета.Результат;
		
	Возврат РезультатЗапроса;
		
КонецФункции

Процедура ЗаписьДанныхОбъектногоТипа(СтрокаДереваМетаданных, ЗаписьXML, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов = Ложь)
	
	РезультатЗапроса = ПолучитьРезультатЗапросаСОграничениями(СтрокаДереваМетаданных);
	
	ЗапросИЗапись(РезультатЗапроса, ЗаписьXML, Истина, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
	
КонецПроцедуры

// Процедура исполняет переданный запрос и записывает полученные через запрос объекты
//
// Параметры
//   Запрос - запрос для исполнения, результат содержит выборку объектов для записи
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   ЗапросВерхнегоУровня - признак необходимости анимации процесса
//
Процедура ЗапросИЗапись(РезультатЗапроса, ЗаписьXML, ЗапросВерхнегоУровня = Ложь, 
	ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов)
	
	// универсальная процедура выгрузки ссылочных объектов процедура
	ОбработкаРезультатаЗапроса(РезультатЗапроса, ЗаписьXML, Истина, ЗапросВерхнегоУровня, 
		ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
	
КонецПроцедуры

Процедура ВыполнитьВспомогательныеДействияДляЗаписиXML(ВсегоОбработаноОбъектов, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов)
	
	Если Не ТолькоПроверкаНедопустимыхСимволов Тогда
		Возврат;
	КонецЕсли;
	
	Если ВсегоОбработаноОбъектов > 1000 Тогда
		
		СтрокаРезультата = ЗаписьXML.Закрыть();
		СтрокаРезультата = Неопределено;
		ЗаписьXML = Неопределено;
		
		ЗаписьXML = СоздатьОбъектЗаписиXMLДляПроверки();
		
	КонецЕсли;
	
КонецПроцедуры

Функция СсылкаВыгружена(Ссылка)
	
	Возврат мВыгруженныеОбъекты.Найти(Ссылка, "Ссылка") <> Неопределено;
	
КонецФункции

Процедура ДобавитьСсылкуКВыгруженным(Ссылка)
	
	СтрокаДобавления = мВыгруженныеОбъекты.Добавить();
	СтрокаДобавления.Ссылка = Ссылка;
	Адапт_СообщитьПрогрессВыгрузки(мВыгруженныеОбъекты.Количество(), мВыгружаемыхВсего);
	
КонецПроцедуры

// Процедура записывает содержащиеся в выборке результата запроса объекты и необходимые "по ссылке" объекты ИБ
//
// Параметры
//   РезультатЗапроса - результат запроса
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   ЭтоЗапросПоОбъекту - если Истина, выборка должна содержать объекты, на которые может быть ссылка,
//             если Ложь, выгружать, как объект не нужно, только обработать возможные ссылки на др. объекты ИБ
//
Процедура ОбработкаРезультатаЗапроса(РезультатЗапроса, ЗаписьXML, ЭтоЗапросПоОбъекту = Ложь, 
	ЗапросВерхнегоУровня = Ложь, ОбъектыВыгруженныеСОшибками = Неопределено, ТолькоПроверкаНедопустимыхСимволов = Ложь)
	
	ВыборкаИзРезультатовЗапроса = РезультатЗапроса.Выбрать();
	
	ВсегоОбработаноОбъектов = 0;
	ОбработаноОбъектов = 0;
	
	Пока ВыборкаИзРезультатовЗапроса.Следующий() Цикл
		
		Если ЭтоЗапросПоОбъекту Тогда
			
			// выгрузка ссылочных объектов
			Ссылка = ВыборкаИзРезультатовЗапроса.Ссылка;
			Если СсылкаВыгружена(Ссылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДобавитьСсылкуКВыгруженным(Ссылка);
			
			ВсегоОбработаноОбъектов = ВсегоОбработанныхЗаписей();
			
		КонецЕсли;
		
		Если мНаличиеВыгрузкиПодчиненныхОбъектов Тогда
		
			// перебираем колонки запроса в поисках ссылочных значений, которые, возможно, нужно выгрузить
			Для Каждого КолонкаЗапроса Из РезультатЗапроса.Колонки Цикл
				
				ЗначениеКолонки = ВыборкаИзРезультатовЗапроса[КолонкаЗапроса.Имя];
				
				Если ТипЗнч(ЗначениеКолонки) = мТипРезультатЗапроса Тогда
					
					ОбработкаРезультатаЗапроса(ЗначениеКолонки, ЗаписьXML, , , ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
					
				Иначе
				
					ЗаписатьЗначениеПриНеобходимости(ЗначениеКолонки, ЗаписьXML, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЭтоЗапросПоОбъекту Тогда
			
			Объект = Ссылка.ПолучитьОбъект();
			
			Попытка
				
				ВыполнитьВспомогательныеДействияДляЗаписиXML(ВсегоОбработаноОбъектов, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов);
				
				Сериализатор.ЗаписатьXML(ЗаписьXML, Объект);
				
				МетаданныеОбъекта = Объект.Метаданные();
				
				Если ЭтоМетаданныеСПредопределеннымиЭлементами(МетаданныеОбъекта) И Объект.Предопределенный Тогда
					
					НоваяСтрока = ТаблицаПредопределенных.Добавить();
					НоваяСтрока.ИмяТаблицы = МетаданныеОбъекта.ПолноеИмя();
					НоваяСтрока.Ссылка = XMLСтрока(Ссылка);
					НоваяСтрока.ИмяПредопределенныхДанных = Объект.ИмяПредопределенныхДанных;
					
				КонецЕсли;
				
				Если ВыгружатьСДокументомЕгоДвижения И Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
					
					// выгрузка движений документа
					Для Каждого Движение Из Объект.Движения Цикл
						
						Движение.Прочитать();
						
						Если мНаличиеВыгрузкиПодчиненныхОбъектов
							И Движение.Количество() > 0 Тогда
							
							ТипРегистра = Тип(Движение);
							
							МассивКолонок = мСоответствиеКолонокДвижений.Получить(ТипРегистра);
							
							Если МассивКолонок = Неопределено Тогда
								
								ТаблицаДвижений = Движение.Выгрузить();
								РегистрБухгалтерии = Метаданные.РегистрыБухгалтерии.Содержит(Движение.Метаданные());
								МассивКолонок = ПолучитьМассивКолонокДвижения(ТаблицаДвижений, РегистрБухгалтерии);
								мСоответствиеКолонокДвижений.Вставить(ТипРегистра, МассивКолонок);	
								
							КонецЕсли;
							
							ВыгрузитьПодчиненныеЗначенияНабора(ЗаписьXML, Движение, МассивКолонок, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
							
						КонецЕсли;
						
						Сериализатор.ЗаписатьXML(ЗаписьXML, Движение);
						
					КонецЦикла;
					
				КонецЕсли;
				
			Исключение
				
				СтрокаОписанияОшибки = ОписаниеОшибки();
				//не смогли записать в XML
				// возможно проблема с недопустимыми символами в XML
				Если ТолькоПроверкаНедопустимыхСимволов Тогда
					
					Если ОбъектыВыгруженныеСОшибками.Получить(Ссылка) = Неопределено Тогда
						ОбъектыВыгруженныеСОшибками.Вставить(Ссылка, СтрокаОписанияОшибки);
					КонецЕсли;					
					
				Иначе
					
					ИтоговаяСтрокаСообщения = Нстр("ru = 'При выгрузке объекта %1(%2) возникла ошибка:
						|%3'");
					ИтоговаяСтрокаСообщения = ПодставитьПараметрыВСтроку(ИтоговаяСтрокаСообщения, Объект, ТипЗнч(Объект), СтрокаОписанияОшибки);
					СообщитьПользователю(ИтоговаяСтрокаСообщения);
					
					ВызватьИсключение ИтоговаяСтрокаСообщения;
					
				КонецЕсли;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьПодчиненныеЗначенияНабора(ЗаписьXML, Движение, МассивКолонок, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов)
		
	Для Каждого ЗаписьИзНабора Из Движение Цикл
								
		Для Каждого Колонка Из МассивКолонок Цикл
			
			Если Колонка = "СубконтоДт"
				ИЛИ Колонка = "СубконтоКт" Тогда
				
				Значение = ЗаписьИзНабора[Колонка];
				Для Каждого КлючИЗначение Из Значение Цикл
					
					Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
						ЗаписатьЗначениеПриНеобходимости(КлючИЗначение.Значение, ЗаписьXML, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);	
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
			
				СохраненноеЗначение = ЗаписьИзНабора[Колонка];
				ЗаписатьЗначениеПриНеобходимости(СохраненноеЗначение, ЗаписьXML, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивКолонокДвижения(ТаблицаДвижений, РегистрБухгалтерии = Ложь)
	
	МассивКолонок = Новый Массив();
	Для Каждого КолонкаТаблицы Из ТаблицаДвижений.Колонки Цикл
		
		Если КолонкаТаблицы.Имя = "МоментВремени"
			ИЛИ Найти(КолонкаТаблицы.Имя, "ВидСубконтоДт") = 1
			ИЛИ Найти(КолонкаТаблицы.Имя, "ВидСубконтоКт") = 1 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Найти(КолонкаТаблицы.Имя, "СубконтоДт") = 1 И РегистрБухгалтерии Тогда
			
			Если МассивКолонок.Найти("СубконтоДт") = Неопределено Тогда
				МассивКолонок.Добавить("СубконтоДт");	
			Конецесли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если Найти(КолонкаТаблицы.Имя, "СубконтоКт") = 1 И РегистрБухгалтерии Тогда
			
			Если МассивКолонок.Найти("СубконтоКт") = Неопределено Тогда
				МассивКолонок.Добавить("СубконтоКт");	
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		МассивКолонок.Добавить(КолонкаТаблицы.Имя);
		
	КонецЦикла;
	
	Возврат МассивКолонок;
	
КонецФункции

// Процедура анализирует необходимость записи объекта "по ссылке" и осуществляет запись
//
// Параметры
//   АнализируемоеЗначение - анализируемое значение
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//
Процедура ЗаписатьЗначениеПриНеобходимости(АнализируемоеЗначение, ЗаписьXML, 
	ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов )
	
	Если Не ЗначениеЗаполнено(АнализируемоеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМД = СсылочныеТипы.Получить(ТипЗнч(АнализируемоеЗначение));
	
	Если ОбъектМД = Неопределено Тогда
		Возврат; // это не ссылка
	КонецЕсли;
			
	Если СсылкаВыгружена(АнализируемоеЗначение) Тогда
		Возврат; // объект уже был выгружен
	КонецЕсли;
	
	// Проверка того, что данный тип входит в список выгружаемых дополнительно
	СтрокаТаблицы = СоставПолнойВыгрузки.Найти(ОбъектМД, "ОбъектМД");
	Если СтрокаТаблицы <> Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	СтрокаТаблицы = СоставВспомогательнойВыгрузки.Найти(ОбъектМД, "ОбъектМД");
	Если СтрокаТаблицы <> Неопределено Тогда
		
		ДопЗапрос = Новый Запрос("ВЫБРАТЬ * ИЗ " + СтрокаТаблицы.СтрокаДерева.ЭлементОписания.ДляЗапроса + ОбъектМД.Имя +
			" КАК ТаблицаОбъекта_" + " ГДЕ Ссылка = &Ссылка");				
		ДопЗапрос.УстановитьПараметр("Ссылка", АнализируемоеЗначение);
		РезультатЗапроса = ДопЗапрос.Выполнить();
		ЗапросИЗапись(РезультатЗапроса, ЗаписьXML, , ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура записывает значение константы
//
// Параметры
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   МД_Константа - описание метаданного - выгружаемой константы
//
Процедура ЗаписьКонстанты(ЗаписьXML, МД_Константа, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов)
	
	МенеджерЗначения = Константы[МД_Константа.Имя].СоздатьМенеджерЗначения();
	МенеджерЗначения.Прочитать();
	ЗаписатьЗначениеПриНеобходимости(МенеджерЗначения.Значение, ЗаписьXML, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
	// собственно выгрузка
	
	ВсегоОбработаноОбъектов = ВсегоОбработанныхЗаписей();
	Попытка
		
		ВыполнитьВспомогательныеДействияДляЗаписиXML(ВсегоОбработаноОбъектов, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов);
		
		Сериализатор.ЗаписатьXML(ЗаписьXML, МенеджерЗначения);
		
	Исключение
		
		СтрокаОписанияОшибки = ОписаниеОшибки();
		//не смогли записать в XML
		// возможно проблема с недопустимыми символами в XML
		Если ТолькоПроверкаНедопустимыхСимволов Тогда
			
			ОбъектыВыгруженныеСОшибками.Вставить(МенеджерЗначения, СтрокаОписанияОшибки);
			
		Иначе
			
			ИтоговаяСтрокаСообщения = Нстр("ru = 'При выгрузке константы %1 возникла ошибка:
			|%2'");
			ИтоговаяСтрокаСообщения = ПодставитьПараметрыВСтроку(ИтоговаяСтрокаСообщения, МД_Константа.Имя, СтрокаОписанияОшибки);
			
			СообщитьПользователю(ИтоговаяСтрокаСообщения);
			
			ВызватьИсключение ИтоговаяСтрокаСообщения;
			
		КонецЕсли;
		
	КонецПопытки;	
	
	ОбработанныхКонстант = ОбработанныхКонстант + 1;
	
КонецПроцедуры

// Процедура записывает наборы записей регистра (накопления, бухгалтерии...)
//
// Параметры
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   СтрокаДереваМетаданных - строка дерева метаданных, соответствующая регистру
//
Процедура ЗаписьРегистра(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов, РегистрБухгалтерии = Ложь)
	
	МенеджерНабораЗаписей = СтрокаДереваМетаданных.ЭлементОписания.Менеджер[СтрокаДереваМетаданных.ОбъектМД.Имя];
	
	ИмяТаблицыДляЗапроса = СтрокаДереваМетаданных.ЭлементОписания.ДляЗапроса;
		
	ЗаписьЧерезНаборЗаписей(ЗаписьXML, МенеджерНабораЗаписей, ИмяТаблицыДляЗапроса, 
		СтрокаДереваМетаданных.ОбъектМД.Имя, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов, РегистрБухгалтерии);
	
КонецПроцедуры

// Процедура записывает наборы записей регистра (накопления, бухгалтерии...)
//
// Параметры
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   СтрокаДереваМетаданных - строка дерева метаданных, соответствующая регистру
//
Процедура ЗаписьПерерасчета(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов)
	
	ИмяРегистраРасчета = СтрокаДереваМетаданных.Родитель.Родитель.ОбъектМД.Имя;
	МенеджерСтрокой = СтрЗаменить(СтрокаДереваМетаданных.ЭлементОписания.Менеджер, "%i", ИмяРегистраРасчета);
	МенеджерПерерасчета = Вычислить(МенеджерСтрокой);
	МенеджерПерерасчета = МенеджерПерерасчета[СтрокаДереваМетаданных.ОбъектМД.Имя];
	СтрокаДляЗапроса = СтрЗаменить(СтрокаДереваМетаданных.ЭлементОписания.ДляЗапроса, "%i", ИмяРегистраРасчета);
	
	ЗаписьЧерезНаборЗаписей(ЗаписьXML, МенеджерПерерасчета, СтрокаДляЗапроса, СтрокаДереваМетаданных.ОбъектМД.Имя, 
		СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
	
КонецПроцедуры

// Процедура записывает последовательности документов
//
// Параметры
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   СтрокаДереваМетаданных - строка дерева метаданных, соответствующая регистру
//
Процедура ЗаписьПоследовательности(ЗаписьXML, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов)
	
	МенеджерНабораЗаписей = СтрокаДереваМетаданных.ЭлементОписания.Менеджер[СтрокаДереваМетаданных.ОбъектМД.Имя];
	ЗаписьЧерезНаборЗаписей(ЗаписьXML, МенеджерНабораЗаписей, СтрокаДереваМетаданных.ЭлементОписания.ДляЗапроса, 
		СтрокаДереваМетаданных.ОбъектМД.Имя, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);		
			
КонецПроцедуры

// Процедура записывает данные, доступ к которым осуществляется через набор записей
//
// Параметры
//   ЗаписьXML - объект, через которых происходит запись объектов ИБ
//   СтрокаДереваМетаданных - строка дерева метаданных, соответствующая регистру
//
Процедура ЗаписьЧерезНаборЗаписей(ЗаписьXML, МенеджерНабораЗаписей, ДляЗапроса, ИмяОбъекта, 
	СтрокаДереваМетаданных = Неопределено, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов, РегистрБухгалтерии = Ложь)
	
	// получить состав колонок записи регистра и проверить наличие хотя бы одной записи
	Если ДляЗапроса = "РегистрБухгалтерии." Тогда
		ИмяТаблицыДляЗапроса = ДляЗапроса + ИмяОбъекта + ".ДвиженияССубконто";	
	Иначе
		ИмяТаблицыДляЗапроса = ДляЗапроса + ИмяОбъекта;	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ " + ИмяТаблицыДляЗапроса + " КАК ТаблицаОбъекта_" + ИмяОбъекта);
	
	РезультатЗапросаПоСоставу = Запрос.Выполнить();
	Если РезультатЗапросаПоСоставу.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДвижений = РезультатЗапросаПоСоставу.Выгрузить();
	МассивКолонок = ПолучитьМассивКолонокДвижения(ТаблицаДвижений, РегистрБухгалтерии);
	
	// выгрузка регистров осуществляется через его набор записей
	НаборЗаписей = МенеджерНабораЗаписей.СоздатьНаборЗаписей();
	
	Отбор = НаборЗаписей.Отбор;
	
	
	
	//+ Muraviev Sergey 2023.12.10
	//СтрокаПолейОтбора = "";
	//Для Каждого ЭлементОтбора Из Отбор Цикл 
	//	Если Не ПустаяСтрока(СтрокаПолейОтбора) Тогда 
	//		СтрокаПолейОтбора = СтрокаПолейОтбора + ",";
	//	КонецЕсли;
	//	СтрокаПолейОтбора = СтрокаПолейОтбора + ЭлементОтбора.Имя;
	//КонецЦикла;
	
	МассивИмен = Новый Массив;
	Для каждого выбКолонка Из МассивКолонок Цикл
		//для регистров, подчиненных регистратору, может быть отбор только по регистратору
		Если выбКолонка = "Регистратор" Тогда 
			МассивИмен.Очистить();
			МассивИмен.Добавить("Регистратор");
			Прервать;
		КонецЕсли;
		Если СтрНайти(выбКолонка, "Субконто") = 1 Тогда
			Продолжить;
		КонецЕсли;
		МассивИмен.Добавить(выбКолонка);
	КонецЦикла;
	СтрокаПолейОтбора = СтрСоединить(МассивИмен, ",");
	
	ЕстьРегистратор = Адапт_ЕстьСвойство(Отбор, "Регистратор");
	КолонкиОтбора = Адапт_ПолучитьКолонкиОтбора(Отбор);
	
	//- Muraviev Sergey 2023.12.10
	
	
	
	
	ПостроительОтчета = ПодготовитьПостроительДляВыгрузки(СтрокаДереваМетаданных, СтрокаПолейОтбора); 
	ПостроительОтчета.Выполнить();
	РезультатЗапросаПоЗначениямОтбора = ПостроительОтчета.Результат;	
	ВыборкаИзРезультата = РезультатЗапросаПоЗначениямОтбора.Выбрать();
	
	КоличествоПолейОтбора = Отбор.Количество();
	
	// читаем наборы записей с различным составом отбора и записываем их
	Пока ВыборкаИзРезультата.Следующий() Цикл
		
		// Отбор устанавливаем для регистров, у которых есть хотя бы один отбор (измерение)
		
		
		//+ Muraviev Sergey 2024.01.01
		// для регистров подчиненных регистратору, отбор только по регистратору
		
		Если ЕстьРегистратор Тогда
			Отбор.Регистратор.Установить(ВыборкаИзРезультата["Регистратор"]);
		ИначеЕсли КоличествоПолейОтбора <> 0 Тогда
		//- Muraviev Sergey 2024.01.01
		
		
			Для Каждого Колонка Из РезультатЗапросаПоЗначениямОтбора.Колонки Цикл
				Если Адапт_ЕстьСвойство(Отбор, Колонка.Имя) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				Отбор[Колонка.Имя].Значение = ВыборкаИзРезультата[Колонка.Имя];
				Отбор[Колонка.Имя].ВидСравнения = ВидСравнения.Равно;
				Отбор[Колонка.Имя].Использование = Истина;
			КонецЦикла;
			
			
		//+ Muraviev Sergey 2024.01.01
		КонецЕсли;
		//- Muraviev Sergey 2024.01.01
		
		НаборЗаписей.Прочитать();
		
		
		Если мНаличиеВыгрузкиПодчиненныхОбъектов Тогда
		
			// проверяем все записанные в наборе значения на необходимость записи "по ссылке"
			ВыгрузитьПодчиненныеЗначенияНабора(ЗаписьXML, НаборЗаписей, МассивКолонок, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
			
		КонецЕсли;
		
		ВсегоОбработаноОбъектов = ВсегоОбработанныхЗаписей();
		Попытка
			
			ВыполнитьВспомогательныеДействияДляЗаписиXML(ВсегоОбработаноОбъектов, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов);
			
			Сериализатор.ЗаписатьXML(ЗаписьXML, НаборЗаписей);
			
		Исключение
			
			СтрокаОписанияОшибки = ОписаниеОшибки();
			//не смогли записать в XML
			// возможно проблема с недопустимыми символами в XML
			Если ТолькоПроверкаНедопустимыхСимволов Тогда
				
				НовыйНабор = МенеджерНабораЗаписей.СоздатьНаборЗаписей();
				
				Для Каждого СтрокаОтбора Из НаборЗаписей.Отбор Цикл
					
					СтрокаОтбораФормы = НовыйНабор.Отбор.Найти(СтрокаОтбора.Имя);
					
					Если СтрокаОтбораФормы = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаОтбораФормы.Использование = СтрокаОтбора.Использование;
					СтрокаОтбораФормы.ВидСравнения = СтрокаОтбора.ВидСравнения;
					СтрокаОтбораФормы.Значение = СтрокаОтбора.Значение;
					
				КонецЦикла;
				
				ОбъектыВыгруженныеСОшибками.Вставить(НовыйНабор, СтрокаОписанияОшибки);
												
			Иначе
				
				ИтоговаяСтрокаСообщения = Нстр("ru = 'При выгрузке регистра %1%2 возникла ошибка:
					|%3'");
				ИтоговаяСтрокаСообщения = ПодставитьПараметрыВСтроку(ИтоговаяСтрокаСообщения, ДляЗапроса, ИмяОбъекта, СтрокаОписанияОшибки);
				
				СообщитьПользователю(ИтоговаяСтрокаСообщения);
				
				ВызватьИсключение ИтоговаяСтрокаСообщения;
				
			КонецЕсли;
			
		КонецПопытки;
		
		ОбработанныхНаборовЗаписей = ОбработанныхНаборовЗаписей + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура рекурсивно обрабатывает строку дерева метаданных, образуя списки полной и вспомогательной выгрузки
//
// Параметры
//   СоставПолнойВыгрузки - список полной выгрузки
//   СоставВспомогательнойВыгрузки - список вспомогательной выгрузки
//   СтрокаДЗ - обрабатываемая строка дерева метаданных
//
Процедура ДобавитьВыгружаемыеОбъекты(СоставПолнойВыгрузки, СоставВспомогательнойВыгрузки, СтрокаДЗ)
	
	Если (СтрокаДЗ.ЭлементОписания <> Неопределено) 
		И СтрокаДЗ.ЭлементОписания.Выгружаемый Тогда
		
		СтрокаДобавления = Неопределено;
		
		Если СтрокаДЗ.Выгружать Тогда
			
			СтрокаДобавления = СоставПолнойВыгрузки.Добавить();
						
		ИначеЕсли СтрокаДЗ.ВыгружатьПриНеобходимости Тогда
			
			СтрокаДобавления = СоставВспомогательнойВыгрузки.Добавить();
									
		КонецЕсли;
		
		Если СтрокаДобавления <> Неопределено Тогда
			
			СтрокаДобавления.ОбъектМД = СтрокаДЗ.ОбъектМД;	
			СтрокаДобавления.СтрокаДерева = СтрокаДЗ;			
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ПодчиненнаяСтрокаДЗ Из СтрокаДЗ.Строки Цикл
		ДобавитьВыгружаемыеОбъекты(СоставПолнойВыгрузки, СоставВспомогательнойВыгрузки, ПодчиненнаяСтрокаДЗ);
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет строку дерева метаданных, попутно заполняя соответствие ссылочных типов объектам метаданных
//
// Параметры
//   ОбъектМД - описание объекта метаданных
//   ЭлементДЗ - заполняемая строка дерева метаданных
//   ЭлементОписания - описание класса, к которому принадлежит объект метаданных (свойства, подчиненные классы)
//
Процедура ПостроениеПоддереваОбъекта(ОбъектМД, ЭлементДЗ, ЭлементОписания, ВсеМетаданные)
	
	ЭлементДЗ.Метаданные = ОбъектМД;
	ЭлементДЗ.ОбъектМД   = ОбъектМД;
	ЭлементДЗ.ПолноеИмяМетаданных = ОбъектМД.Имя;
	ЭлементДЗ.ЭлементОписания = ЭлементОписания;
	ЭлементДЗ.Выгружать = Ложь;
	ЭлементДЗ.ВыгружатьПриНеобходимости = Истина;
	ЭлементДЗ.ИндексКартинки = ЭлементОписания.ИндексКартинки;
	
	Попытка
		Менеджер = ПолучитьМенеджер(ЭлементОписания);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(НСтр("ru = '" + ОписаниеОшибки + "'"), СтатусСообщения.Внимание);
	
	КонецПопытки;
	
	Если Менеджер <> Неопределено Тогда
		
		ЭлементДЗ.ДоступенОтбор = Истина;
		
		// заполнение соответствия ссылочных типов объектам метаданных
		Если ОбъектОбразуетСсылочныйТип(ОбъектМД) Тогда
			Попытка
				Параметры = Новый Структура("Менеджер, ИмяСвойства", Менеджер, ОбъектМД.Имя);
				
				ОбъектМета = Менеджер[ОбъектМД.Имя];
				СсылочныеТипы[ТипЗнч(ОбъектМета.ПустаяСсылка())] = ОбъектМД;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
			    Сообщить(НСтр("ru = '" +ОписаниеОшибки + "'"), СтатусСообщения.Внимание);
			КонецПопытки;
			
			
		КонецЕсли;
		
		Если ВсеМетаданные.РегистрыНакопления.Содержит(ОбъектМД) 
			Или	ВсеМетаданные.РегистрыБухгалтерии.Содержит(ОбъектМД) Тогда
			
			ИспользующиеИтоги.Добавить(ЭлементДЗ);
			
		КонецЕсли;
		
	КонецЕсли;		
		
	// подчиненные ветви
	Для Каждого ПодчиненныйКласс Из ЭлементОписания.Строки Цикл
		
		Если Не ПодчиненныйКласс.Выгружаемый Тогда
			Продолжить;
		КонецЕсли;
		
		ВеткаКласса = ЭлементДЗ.Строки.Добавить();
		ВеткаКласса.Метаданные = ПодчиненныйКласс.Класс;
		ВеткаКласса.Выгружать = Ложь;
		ВеткаКласса.ВыгружатьПриНеобходимости = Истина;
		ВеткаКласса.ПолноеИмяМетаданных = ПодчиненныйКласс.Класс;
		ВеткаКласса.ИндексКартинки = ПодчиненныйКласс.ИндексКартинки;
				
		ПодчиненныеОбъектыДанногоКласса = ОбъектМД[ПодчиненныйКласс.Класс];
		
		Сч = 0;
		Для Каждого ПодчиненныйОбъектМД Из ПодчиненныеОбъектыДанногоКласса Цикл 
			Сч = Сч + 1;
			
			ПодчиненныйЭлементДЗ = ВеткаКласса.Строки.Добавить();
			ПостроениеПоддереваОбъекта(ПодчиненныйОбъектМД, ПодчиненныйЭлементДЗ, ПодчиненныйКласс, ВсеМетаданные);
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура удаляет из дерева метаданных строки, соответствующие метаданным, заведомо не попадающим в выгрузку
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных, подчиненные которой рассматриваются
//        с точки зрения удаления из списка потенциально выгружаемых
//
Процедура СверткаПоддереваОбъекта(ЭлементДЗ)
	
	УдаляемыеВеткиКлассов = Новый Массив;
	Для Каждого ВеткаКласса Из ЭлементДЗ.Строки Цикл
		
		УдаляемыеПодчиненныеМД = Новый Массив;
		
		Для Каждого ПодчиненныйОбъектМД Из ВеткаКласса.Строки Цикл
			СверткаПоддереваОбъекта(ПодчиненныйОбъектМД);
			Если (ПодчиненныйОбъектМД.Строки.Количество()) = 0 
				и (Не ПодчиненныйОбъектМД.ЭлементОписания.Выгружаемый) Тогда 
				
				УдаляемыеПодчиненныеМД.Добавить(ВеткаКласса.Строки.Индекс(ПодчиненныйОбъектМД));
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Сч = 1 По УдаляемыеПодчиненныеМД.Количество() Цикл
			ВеткаКласса.Строки.Удалить(УдаляемыеПодчиненныеМД[УдаляемыеПодчиненныеМД.Количество() - Сч]);
		КонецЦикла;
		
		Если ВеткаКласса.Строки.Количество() = 0 Тогда
			УдаляемыеВеткиКлассов.Добавить(ЭлементДЗ.Строки.Индекс(ВеткаКласса));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = 1 По УдаляемыеВеткиКлассов.Количество() Цикл
		ЭлементДЗ.Строки.Удалить(УдаляемыеВеткиКлассов[УдаляемыеВеткиКлассов.Количество() - Сч]);
	КонецЦикла;
	
КонецПроцедуры

// Процедура проставляет признак Выгрузка строкам дерева метаданных, подчиненных данной, вычисляет и 
//      выставляет признак выгрузки "по ссылке" другим объектам, ссылки на которые может или должен
//      содержать объект, соответствующий данной строке
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура УстановитьВыгружатьПодчиненным(ЭлементДЗ)
	Для Каждого ПодчиненнаяСтрока Из ЭлементДЗ.Строки Цикл
		ПодчиненнаяСтрока.Выгружать = ЭлементДЗ.Выгружать;
		УстановитьВыгружатьПодчиненным(ПодчиненнаяСтрока);
	КонецЦикла;
КонецПроцедуры

// Процедура проставляет признак Выгрузка строке дерева метаданных на основании этого признака подчиненных строк,
// затем вызывает себя же для родителя, обеспечивая отработку до корня дерева
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура ОбновитьСостояниеВыгружать(ЭлементДЗ)
	Если ЭлементДЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если (ЭлементДЗ.ЭлементОписания <> Неопределено) И ЭлементДЗ.ЭлементОписания.Выгружаемый Тогда
		Возврат; // обновляем вверх или до корня, или до первого встретившегося выгружаемого
	КонецЕсли;
	Состояние = Неопределено;
	Для Каждого ПодчиненныйЭлементДЗ Из ЭлементДЗ.Строки Цикл
		Если Состояние = Неопределено Тогда
			Состояние = ПодчиненныйЭлементДЗ.Выгружать;
		Иначе
			Если Не Состояние = ПодчиненныйЭлементДЗ.Выгружать Тогда
				Состояние = 2;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Состояние <> Неопределено Тогда
		ЭлементДЗ.Выгружать = Состояние;
		ОбновитьСостояниеВыгружать(ЭлементДЗ.Родитель);
	КонецЕсли;
КонецПроцедуры

// Процедура обрабатывает состояние признака Выгрузка, проставляя признаки Выгрузка и ВыгружатьПриНеобходимости
// связанным ветвям дерева
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура ОбработкаИзмененияСостоянияВыгружать(ЭлементДЗ) Экспорт
	Если ЭлементДЗ.Выгружать = 2 Тогда
		ЭлементДЗ.Выгружать = 0;
	КонецЕсли;
	// Изменяем состояние "вниз"
	УстановитьВыгружатьПодчиненным(ЭлементДЗ);
	// Изменяем состояние "вверх"
	ОбновитьСостояниеВыгружать(ЭлементДЗ.Родитель);
КонецПроцедуры

// Процедура проставляет признак Выгрузка строкам дерева метаданных, подчиненных данной, вычисляет и 
//      выставляет признак выгрузки "по ссылке" другим объектам, ссылки на которые может или должен
//      содержать объект, соответствующий данной строке
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура УстановитьВыгружатьПриНеобходимостиПодчиненным(ЭлементДЗ)
	
	Для Каждого ПодчиненнаяСтрока Из ЭлементДЗ.Строки Цикл
		ПодчиненнаяСтрока.ВыгружатьПриНеобходимости = ЭлементДЗ.ВыгружатьПриНеобходимости;
		УстановитьВыгружатьПриНеобходимостиПодчиненным(ПодчиненнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Процедура проставляет признак Выгрузка строке дерева метаданных на основании этого признака подчиненных строк,
// затем вызывает себя же для родителя, обеспечивая отработку до корня дерева
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура ОбновитьСостояниеВыгружатьПриНеобходимости(ЭлементДЗ)
	
	Если ЭлементДЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ЭлементДЗ.ЭлементОписания <> Неопределено) И ЭлементДЗ.ЭлементОписания.Выгружаемый Тогда
		Возврат; // обновляем вверх или до корня, или до первого встретившегося выгружаемого
	КонецЕсли;
	
	Состояние = Неопределено;
	Для Каждого ПодчиненныйЭлементДЗ Из ЭлементДЗ.Строки Цикл
		
		Если Состояние = Неопределено Тогда
			Состояние = ПодчиненныйЭлементДЗ.ВыгружатьПриНеобходимости;
		Иначе
			Если Не Состояние = ПодчиненныйЭлементДЗ.ВыгружатьПриНеобходимости Тогда
				Состояние = 2;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Состояние <> Неопределено Тогда
		ЭлементДЗ.ВыгружатьПриНеобходимости = Состояние;
		ОбновитьСостояниеВыгружатьПриНеобходимости(ЭлементДЗ.Родитель);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обрабатывает состояние признака Выгрузка, проставляя признаки Выгрузка и ВыгружатьПриНеобходимости
// связанным ветвям дерева
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура ОбработкаИзмененияСостоянияВыгружатьПриНеобходимости(ЭлементДЗ) Экспорт
	
	Если ЭлементДЗ.ВыгружатьПриНеобходимости = 2 Тогда
		ЭлементДЗ.ВыгружатьПриНеобходимости = 0;
	КонецЕсли;
	
	// Изменяем состояние "вниз"
	УстановитьВыгружатьПриНеобходимостиПодчиненным(ЭлементДЗ);
	// Изменяем состояние "вверх"
	ОбновитьСостояниеВыгружатьПриНеобходимости(ЭлементДЗ.Родитель);
	
КонецПроцедуры

// Функция определяет, являются ли объекты данного класса метаданных типизированными
//
// Параметры
//   Описание - Описание класса
// Возврат - Истина, если объекты данного класса метаданных типизированы, Ложь в противном случае
//
Функция КлассМДТипизированный(Описание)
	
	Для Каждого Свойство Из Описание.Свойства Цикл
		Если Свойство.Значение = "Тип" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

// Функция определяет, являются ли тип ссылочным
//
// Параметры
//   Тип - исследуемый тип
// Возврат - Истина, если тип ссылочный, Ложь в противном случае
//
Функция СсылочныйТип(Тип)
	
	МетаданныеТипа = СсылочныеТипы.Получить(Тип);
	Возврат МетаданныеТипа <> Неопределено;	
		
КонецФункции

// Функция возвращает массив типов, которые могут иметь поля записи объекта метаданных, соответствующего строке дерева
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
// Возврат - массив потенциально используемых соответствующей записью типов
//
Функция ПолучитьВсеТипы(ЭлементДЗ)
	
	ОбъектМД = ЭлементДЗ.ОбъектМД;
	Если ТипЗнч(ОбъектМД) <> Тип("ОбъектМетаданных") 
		И ТипЗнч(ОбъектМД) <> Тип("ОбъектМетаданныхКонфигурация") Тогда
		
		ВызватьИсключение(Нстр("ru = 'Внутренняя ошибка обработки выгрузки'"));
		
	КонецЕсли;
	
	Возврат ПолучитьТипыИспользуемыеОМД(ОбъектМД, ЭлементДЗ.ЭлементОписания);
	
КонецФункции

// Функция возвращает массив типов, которые могут иметь поля записи объекта метаданных
//
// Параметры
//   ОбъектМД - описание метаданного
//   ЭлементОписания - описание класса объекта метаданного
// Возврат - массив потенциально используемых соответствующей записью типов
//
Функция ПолучитьТипыИспользуемыеОМД(ОбъектМД, ЭлементОписания)
	
	//ВсеТипы = Новый Массив;
	//+ Muraviev Sergey 2024.01.03
	ВсеТипыСоотв = Новый Соответствие;
	ПолноеИмяОбъекта = ОбъектМД.ПолноеИмя();
	
	Для Каждого Свойство Из ЭлементОписания.Свойства Цикл
		
		ЗначениеСвойства = ОбъектМД[Свойство.Значение];
		Если ТипЗнч(ЗначениеСвойства) = Тип("КоллекцияЗначенийСвойстваОбъектаМетаданных") И ЗначениеСвойства.Количество() > 0 Тогда
			
			Для Каждого СтрокаКоллекции Из ЗначениеСвойства Цикл
				
				СсылочныйТипКлючИЗначение = СоответствиеОбъектовМетаданныхИСсылочныхТипов[СтрокаКоллекции];
				
				Если СсылочныйТипКлючИЗначение <> Неопределено Тогда
					
					ВсеТипыСоотв.Вставить(СсылочныйТипКлючИЗначение);
					
				КонецЕсли;
				
			КонецЦикла;			
						
		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("ОбъектМетаданных") Тогда
			
			Для Каждого СсылочныйТипКлючИЗначение Из СсылочныеТипы Цикл
				
				Если ЗначениеСвойства = СсылочныйТипКлючИЗначение.Значение Тогда
					ВсеТипыСоотв.Вставить(СсылочныйТипКлючИЗначение.Ключ);	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КлассМДТипизированный(ЭлементОписания) Тогда
		
		ОписаниеТипа = ОбъектМД.Тип;
		Для Каждого ОдинТип Из ОписаниеТипа.Типы() Цикл
			
			Если СсылочныйТип(ОдинТип) Тогда
				//ДобавитьВМассивЕслиУникальный(ВсеТипы, ОдинТип);
				ВсеТипыСоотв.Вставить(ОдинТип);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Метаданные.РегистрыСведений.Содержит(ОбъектМД) Или 
			Метаданные.РегистрыНакопления.Содержит(ОбъектМД) Или
			Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМД) Или
			Метаданные.РегистрыРасчета.Содержит(ОбъектМД) Тогда
			
			// какой-то из регистров, ищем в возможных регистраторах
			Для Каждого ДокументМД Из Метаданные.Документы Цикл
				
				Если ДокументМД.Движения.Содержит(ОбъектМД) Тогда
					
					//ДобавитьВМассивЕслиУникальный(ВсеТипы, ТипЗнч(Документы[ДокументМД.Имя].ПустаяСсылка()));
					ВсеТипыСоотв.Вставить(ТипЗнч(Документы[ДокументМД.Имя].ПустаяСсылка()));
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ПодчиненныйКласс Из ЭлементОписания.Строки Цикл
		
		Для Каждого ПодчиненныйОбъектМД Из ОбъектМД[ПодчиненныйКласс.Класс] Цикл
			
			ТипыПодчиненного = ПолучитьТипыИспользуемыеОМД(ПодчиненныйОбъектМД, ПодчиненныйКласс);
			Для Каждого ОдинТип Из ТипыПодчиненного Цикл
				ВсеТипыСоотв.Вставить(ОдинТип);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ВсеТипы = Новый Массив;
	Для каждого КЗ Из ВсеТипыСоотв Цикл
		ВсеТипы.Добавить(КЗ.Ключ);
	КонецЦикла;
	
	Возврат ВсеТипы;
	
КонецФункции

// Функция возвращает строку дерева метаданных, соответствующую переданному объекту метаданных
// Поиск осуществляется по всему дереву метаданных
//
// Параметры
//   ОбъектМД - описание метаданного
// Возврат - строка дерева метаданных
//
Функция ЭлементДЗПоОбъектуМД(ОбъектМД)
	
	//+ Muraviev Sergey 2024.01.11
	//Для Каждого СтрокаДЗ Из ДеревоМетаданных.Строки Цикл
	//	ЭлементДЗ = ЭлементДЗПоОбъектуМДИСтроке(СтрокаДЗ, ОбъектМД);
	//	Если ЭлементДЗ <> Неопределено Тогда 
	//		Возврат ЭлементДЗ;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Возврат Неопределено;
	
	Результат = мСоотвОбъектовМетаданныхДерева[ОбъектМД];
	
	Возврат Результат;
	//- Muraviev Sergey 2024.01.11
	
КонецФункции

// Процедура определяет, на какие объект может ссылаться запись, соответствующая объекту метаданных, отображаемому
// данной строкой дерева метаданных и проставляет им признак ВыгружатьПриНеобходимости
//
// Параметры
//   ЭлементДЗ - строка дерева метаданных
//
Процедура УстановкаСостоянияВыгружатьПриНеобходимости(ЭлементДЗ)
	
	ОбновитьСостояниеВыгружатьПриНеобходимости(ЭлементДЗ.Родитель);
	Если ЭлементДЗ.Выгружать <> 1 И ЭлементДЗ.ВыгружатьПриНеобходимости <> 1 Тогда
		Возврат;
	КонецЕсли;
	Если ЭлементДЗ.ОбъектМД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеТипы = ПолучитьВсеТипы(ЭлементДЗ);
	Для Каждого СсылочныйТип Из ВсеТипы Цикл
		
		ТипИОбъект = СсылочныеТипы.Получить(СсылочныйТип);
		Если ТипИОбъект = Неопределено Тогда
			
			ТекстИсключения = Нстр("ru = 'Внутренняя ошибка. Неполное заполнение структуры ссылочных типов %1'");
			ТекстИсключения = ПодставитьПараметрыВСтроку(ТекстИсключения, СсылочныйТип);
			ВызватьИсключение(ТекстИсключения);
			
		КонецЕсли;
		
		ОбъектМД = ТипИОбъект;
		СтрокаДЗ = ЭлементДЗПоОбъектуМД(ОбъектМД);
		Если СтрокаДЗ = Неопределено Тогда 
			
			ТекстИсключения = Нстр("ru = 'Внутренняя ошибка. Неполное заполнение дерева метаданных. Отсутствует объект, образующий тип %1'");
			ТекстИсключения = ПодставитьПараметрыВСтроку(ТекстИсключения, СсылочныйТип);
			ВызватьИсключение(ТекстИсключения);
			
		КонецЕсли;
		
		Если СтрокаДЗ.Выгружать = 1 
			Или СтрокаДЗ.ВыгружатьПриНеобходимости = 1 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаДЗ.ВыгружатьПриНеобходимости = 1;
		УстановкаСостоянияВыгружатьПриНеобходимости(СтрокаДЗ);
						
	КонецЦикла;
	
КонецПроцедуры

// Функция определяет общее количество произведенных записей констант + объектного типа + наборов записей
//
// Возврат - общее количество произведенных записей
Функция ВсегоОбработанныхЗаписей()
	
	Возврат мВыгруженныеОбъекты.Количество() + ОбработанныхКонстант + ОбработанныхНаборовЗаписей;
	
КонецФункции

// Процедура производит заполнение дерева описания классов объектов метаданных
//
// Параметры
//
Процедура ЗаполнитьОписаниеМетаданных()
	
	СтэкДереваЗначенийСтроки = Новый Массив;
	МетаданныеОписание = Новый ДеревоЗначений;
	МетаданныеОписание.Колонки.Добавить("Выгружаемый", Новый ОписаниеТипов("Булево"));
	МетаданныеОписание.Колонки.Добавить("ДляЗапроса", Новый ОписаниеТипов("Строка"));
	МетаданныеОписание.Колонки.Добавить("Класс", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	МетаданныеОписание.Колонки.Добавить("Менеджер");
	МетаданныеОписание.Колонки.Добавить("Свойства", Новый ОписаниеТипов("СписокЗначений"));
	МетаданныеОписание.Колонки.Добавить("ИндексКартинки");
	СтэкДереваЗначенийСтроки.Вставить(0, МетаданныеОписание.Строки);
	//////////////////////////////////
	// Конфигурации
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Конфигурации";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.ИндексКартинки = 0;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Константы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Константы";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = Константы;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.ИндексКартинки = 1;
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.Справочники
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Справочники";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = Справочники;
	ОписаниеКласса.ДляЗапроса  = "Справочник.";
	ОписаниеКласса.Свойства.Добавить("Владельцы");
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.ИндексКартинки = 3;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Справочники.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("Использование");
	//////////////////////////////////
	// Конфигурации.Справочники.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Использование");
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Справочники.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.Документы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Документы";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = Документы;
	ОписаниеКласса.ДляЗапроса  = "Документ.";
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.Свойства.Добавить("Движения");
	ОписаниеКласса.ИндексКартинки = 7;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Документы.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.Документы.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Документы.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.Последовательности
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Последовательности";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = Последовательности;
	ОписаниеКласса.ДляЗапроса  = "Последовательность.";
	ОписаниеКласса.Свойства.Добавить("Документы");
	ОписаниеКласса.Свойства.Добавить("Движения");
	ОписаниеКласса.ИндексКартинки = 5;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Последовательности.Измерения
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Измерения";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("СоответствиеДокументам");
	ОписаниеКласса.Свойства.Добавить("СоответствиеДвижениям");
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.ПланыВидовХарактеристик
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ПланыВидовХарактеристик";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = ПланыВидовХарактеристик;
	ОписаниеКласса.ДляЗапроса  = "ПланВидовХарактеристик.";
	ОписаниеКласса.Свойства.Добавить("ДополнительныеЗначенияХарактеристик");
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.ИндексКартинки = 9;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыВидовХарактеристик.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("Использование");
	//////////////////////////////////
	// Конфигурации.ПланыВидовХарактеристик.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Использование");
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыВидовХарактеристик.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.ПланыСчетов
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ПланыСчетов";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = ПланыСчетов;
	ОписаниеКласса.ДляЗапроса  = "ПланСчетов.";
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.Свойства.Добавить("ВидыСубконто");
	ОписаниеКласса.ИндексКартинки = 11;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыСчетов.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.ПланыСчетов.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыСчетов.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.ПланыВидовРасчета
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ПланыВидовРасчета";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = ПланыВидовРасчета;
	ОписаниеКласса.ДляЗапроса  = "ПланВидовРасчета.";
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.Свойства.Добавить("ЗависимостьОтВидовРасчета");
	ОписаниеКласса.Свойства.Добавить("БазовыеВидыРасчета");
	ОписаниеКласса.Свойства.Добавить("ИспользованиеПериодаДействия");
	ОписаниеКласса.ИндексКартинки = 13;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыВидовРасчета.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.ПланыВидовРасчета.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыВидовРасчета.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.РегистрыСведений
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "РегистрыСведений";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = РегистрыСведений;
	ОписаниеКласса.ДляЗапроса  = "РегистрСведений.";
	ОписаниеКласса.ИндексКартинки = 15;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.РегистрыСведений.Ресурсы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Ресурсы";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыСведений.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыСведений.Измерения
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Измерения";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.РегистрыНакопления
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "РегистрыНакопления";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = РегистрыНакопления;
	ОписаниеКласса.ДляЗапроса  = "РегистрНакопления.";
	ОписаниеКласса.ИндексКартинки = 17;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.РегистрыНакопления.Ресурсы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Ресурсы";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыНакопления.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыНакопления.Измерения
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Измерения";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.РегистрыБухгалтерии
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "РегистрыБухгалтерии";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = РегистрыБухгалтерии;
	ОписаниеКласса.ДляЗапроса  = "РегистрБухгалтерии.";
	ОписаниеКласса.Свойства.Добавить("ПланСчетов");
	ОписаниеКласса.Свойства.Добавить("Корреспонденция");
	ОписаниеКласса.ИндексКартинки = 19;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.РегистрыБухгалтерии.Измерения
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Измерения";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыБухгалтерии.Ресурсы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Ресурсы";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыБухгалтерии.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.РегистрыРасчета
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "РегистрыРасчета";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = РегистрыРасчета;
	ОписаниеКласса.ДляЗапроса  = "РегистрРасчета.";
	ОписаниеКласса.Свойства.Добавить("Периодичность");
	ОписаниеКласса.Свойства.Добавить("ПериодДействия");
	ОписаниеКласса.Свойства.Добавить("БазовыйПериод");
	ОписаниеКласса.Свойства.Добавить("График");
	ОписаниеКласса.Свойства.Добавить("ЗначениеГрафика");
	ОписаниеКласса.Свойства.Добавить("ДатаГрафика");
	ОписаниеКласса.Свойства.Добавить("ПланВидовРасчета");
	ОписаниеКласса.ИндексКартинки = 21;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.РегистрыРасчета.Ресурсы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Ресурсы";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.РегистрыРасчета.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("СвязьСГрафиком");
	//////////////////////////////////
	// Конфигурации.РегистрыРасчета.Измерения
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Измерения";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("БазовоеИзмерение");
	ОписаниеКласса.Свойства.Добавить("СвязьСГрафиком");
	//////////////////////////////////
	// Конфигурации.РегистрыРасчета.Перерасчеты
	//ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	//ОписаниеКласса.Класс = "Перерасчеты";
	//ОписаниеКласса.Выгружаемый = истина;
	//ОписаниеКласса.Менеджер  = "РегистрыРасчета.%i.Перерасчеты";
	//ОписаниеКласса.ДляЗапроса  = "РегистрРасчета.%i.";
	//СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.РегистрыРасчета.Перерасчеты.Измерения
	//ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	//ОписаниеКласса.Класс = "Измерения";
	//ОписаниеКласса.Выгружаемый = ложь;
	//ОписаниеКласса.Свойства.Добавить("ДанныеВедущихРегистров");
	//ОписаниеКласса.Свойства.Добавить("ИзмерениеРегистра");
	//СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.БизнесПроцессы
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "БизнесПроцессы";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = БизнесПроцессы;
	ОписаниеКласса.ДляЗапроса  = "БизнесПроцесс.";
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.Свойства.Добавить("Задача");
	ОписаниеКласса.ИндексКартинки = 23;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.БизнесПроцессы.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.БизнесПроцессы.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.БизнесПроцессы.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	//////////////////////////////////
	// Конфигурации.Задачи
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Задачи";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = Задачи;
	ОписаниеКласса.ДляЗапроса  = "Задача.";
	ОписаниеКласса.Свойства.Добавить("Адресация");
	ОписаниеКласса.Свойства.Добавить("ОсновнойРеквизитАдресации");
	ОписаниеКласса.Свойства.Добавить("ТекущийИсполнитель");
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.ИндексКартинки = 25;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Задачи.РеквизитыАдресации
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "РеквизитыАдресации";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	ОписаниеКласса.Свойства.Добавить("ИзмерениеАдресации");
	//////////////////////////////////
	// Конфигурации.Задачи.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.Задачи.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.Задачи.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);
	
	//////////////////////////////////
	// Конфигурации.ПланыОбмена
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ПланыОбмена";
	ОписаниеКласса.Выгружаемый = истина;
	ОписаниеКласса.Менеджер = ПланыОбмена;
	ОписаниеКласса.ДляЗапроса  = "ПланОбмена.";
	ОписаниеКласса.Свойства.Добавить("ВводитсяНаОсновании");
	ОписаниеКласса.ИндексКартинки = 27;
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыОбмена.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	//////////////////////////////////
	// Конфигурации.ПланыОбмена.ТабличныеЧасти
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "ТабличныеЧасти";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	СтэкДереваЗначенийСтроки.Вставить(0, ОписаниеКласса.Строки);
	//////////////////////////////////
	// Конфигурации.ПланыОбмена.ТабличныеЧасти.Реквизиты
	ОписаниеКласса = СтэкДереваЗначенийСтроки[0].Добавить();
	ОписаниеКласса.Класс = "Реквизиты";
	ОписаниеКласса.Выгружаемый = ложь;
	ОписаниеКласса.ДляЗапроса  = "";
	ОписаниеКласса.Свойства.Добавить("Тип");
	СтэкДереваЗначенийСтроки.Удалить(0);
	СтэкДереваЗначенийСтроки.Удалить(0);	
	
	СтэкДереваЗначенийСтроки.Удалить(0);
	
КонецПроцедуры

// Функция определяет имеет ли переданный объект метаданных ссылочный тип
//
// Возврат - Истина, если переданный объект метаданных имеет ссылочный тип, Ложь - противном случае
Функция ОбъектОбразуетСсылочныйТип(ОбъектМД) Экспорт
	
	Если ОбъектМД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Метаданные.Справочники.Содержит(ОбъектМД)
		ИЛИ Метаданные.Документы.Содержит(ОбъектМД)
		ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМД)
		ИЛИ Метаданные.ПланыСчетов.Содержит(ОбъектМД)
		ИЛИ Метаданные.ПланыВидовРасчета.Содержит(ОбъектМД)
		ИЛИ Метаданные.ПланыОбмена.Содержит(ОбъектМД)
		ИЛИ Метаданные.БизнесПроцессы.Содержит(ОбъектМД)
		ИЛИ Метаданные.Задачи.Содержит(ОбъектМД) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// Процедура определяет, какие типы объектов следует выгружать для сохранения ссылочной целостности
//
// Параметры
//   Выгрузка - массив строк - совокупность выгружаемых объектов
Процедура ПересчитатьВыгружаемыеПоСсылке(Выгрузка)
	
	Адапт_ИнициализироватьСоотвОбъектовМетаданныхДерева(); 
	
	// сброс всех флажков ВыгружатьПриНеобходимости
	СтрокаКонфигурации = ДеревоМетаданных.Строки[0];
	СтрокаКонфигурации.ВыгружатьПриНеобходимости = 0;
	ОбработкаИзмененияСостоянияВыгружатьПриНеобходимости(СтрокаКонфигурации);
	
	// обработка переданного набора объектов
	Для Каждого Выгружаемый Из Выгрузка Цикл
		
		УстановкаСостоянияВыгружатьПриНеобходимости(Выгружаемый.СтрокаДерева);
				
	КонецЦикла;
	
КонецПроцедуры

// Процедура, при необходимости, устанавливает отсутствие необходимости использования итогов
//
// Параметры
Процедура УбратьИспользованиеИтогов() Экспорт
	
	Если ВключитьВозможностьРедактированияИспользованияИтогов Тогда
		
		Для Каждого Регистр_СДЗ Из ИспользующиеИтоги Цикл
			
			Регистр_СДЗ.ЭлементОписания.Менеджер[Регистр_СДЗ.ОбъектМД.Имя].УстановитьИспользованиеИтогов(Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, при необходимости, устанавливает необходимость использования итогов
//
// Параметры
Процедура ВосстановитьИспользованиеИтогов() Экспорт
	
	Если ВключитьВозможностьРедактированияИспользованияИтогов Тогда
		
		Для Каждого Регистр_СДЗ Из ИспользующиеИтоги Цикл
			
			Регистр_СДЗ.ЭлементОписания.Менеджер[Регистр_СДЗ.ОбъектМД.Имя].УстановитьИспользованиеИтогов(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текущее значение версии обработки
//
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  Текущее значение версии обработки
//
Функция ВерсияОбъекта() Экспорт
	
	Возврат "2.1.8";
	
КонецФункции

Процедура СообщитьПользователю(Текст, Поле = Неопределено, Данные = Неопределено)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	
	Если Поле <> Неопределено Тогда
		Сообщение.Поле = Поле;              
	КонецЕсли;

	Если Данные <> Неопределено Тогда
		Сообщение.УстановитьДанные(Данные);
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

Процедура ИнициализироватьТаблицуПредопределенных()
	
	ТаблицаПредопределенных = Новый ТаблицаЗначений;
	ТаблицаПредопределенных.Колонки.Добавить("ИмяТаблицы");
	ТаблицаПредопределенных.Колонки.Добавить("Ссылка");
	ТаблицаПредопределенных.Колонки.Добавить("ИмяПредопределенныхДанных");
	
КонецПроцедуры

Процедура ВыгрузитьТаблицуПредопределенных(ЗаписьXML)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PredefinedData");
	
	Если ТаблицаПредопределенных.Количество() > 0 Тогда
		
		ТаблицаПредопределенных.Сортировать("ИмяТаблицы");
		
		ИмяПредыдущейТаблицы = "";
		
		Для Каждого Элемент Из ТаблицаПредопределенных Цикл
			
			Если ИмяПредыдущейТаблицы <> Элемент.ИмяТаблицы Тогда
				Если Не ПустаяСтрока(ИмяПредыдущейТаблицы) Тогда
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
				ЗаписьXML.ЗаписатьНачалоЭлемента(Элемент.ИмяТаблицы);
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("item");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", Элемент.Ссылка);
			ЗаписьXML.ЗаписатьАтрибут("ИмяПредопределенныхДанных", Элемент.ИмяПредопределенныхДанных);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ИмяПредыдущейТаблицы = Элемент.ИмяТаблицы;
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗагрузитьТаблицуПредопределенных(ЧтениеXML)
	
	ЧтениеXML.Пропустить(); // При первом чтении пропускам основной блок данных
	ЧтениеXML.Прочитать();
	
	ИнициализироватьТаблицуПредопределенных();
	ВременнаяСтрока = ТаблицаПредопределенных.Добавить();
	
	СоответствиеЗаменыСсылок = Новый Соответствие;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ЧтениеXML.ЛокальноеИмя <> "item" Тогда
				
				ВременнаяСтрока.ИмяТаблицы = ЧтениеXML.ЛокальноеИмя;
				
				//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВременнаяСтрока.ИмяТаблицы, "ИмяПредопределенныхДанных") Тогда
				//	ИмяРеквизита = "ИмяПредопределенныхДанных";
				//ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВременнаяСтрока.ИмяТаблицы, "ИмяПредопределенногоНабора") Тогда
				//	ИмяРеквизита = "ИмяПредопределенногоНабора";
				//КонецЕсли;
				ИмяРеквизита = "ИмяПредопределенныхДанных";
				
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	Таблица.Ссылка КАК Ссылка
				|ИЗ
				|	" + ВременнаяСтрока.ИмяТаблицы + " КАК Таблица
				|ГДЕ
				|	Таблица."+ ИмяРеквизита + " = &ИмяПредопределенныхДанных";
				Запрос = Новый Запрос(ТекстЗапроса);
				
			Иначе
				
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					
					ВременнаяСтрока[ЧтениеXML.ЛокальноеИмя] = ЧтениеXML.Значение;
					
				КонецЦикла;
				
				Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ВременнаяСтрока.ИмяПредопределенныхДанных);

				ПустойЗапрос = Новый Запрос("Выбрать 0 ГДЕ ЛОЖЬ");
				РезультатЗапроса = ПустойЗапрос.Выполнить();
				
				Попытка
					РезультатЗапроса = Запрос.Выполнить();
				Исключение
					ОШ = ИнформацияОбОшибке();
					//ВызватьИсключение(Ош.Описание,,, Ош.НомерСтроки, Ош.Причина);
				КонецПопытки;
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Если Выборка.Количество() = 1 Тогда
						
						Выборка.Следующий();
						
						СсылкаВБазе = XMLСтрока(Выборка.Ссылка);
						СсылкаВФайле = ВременнаяСтрока.Ссылка;
						
						Если СсылкаВБазе <> СсылкаВФайле Тогда
							
							XMLТип = XMLТипСсылки(Выборка.Ссылка);
							
							СоответствиеТипа = СоответствиеЗаменыСсылок.Получить(XMLТип);
							
							Если СоответствиеТипа = Неопределено Тогда
								
								СоответствиеТипа = Новый Соответствие;
								СоответствиеТипа.Вставить(СсылкаВФайле, СсылкаВБазе);
								СоответствиеЗаменыСсылок.Вставить(XMLТип, СоответствиеТипа);
								
							Иначе
								
								СоответствиеТипа.Вставить(СсылкаВФайле, СсылкаВБазе);
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						ТекстИсключения = НСтр("ru = 'Обнаружено дублирование предопределенных элементов %1 в таблице %2!'");
						ТекстИсключения = СтрЗаменить(ТекстИсключения, "%1", ВременнаяСтрока.ИмяПредопределенныхДанных);
						ТекстИсключения = СтрЗаменить(ТекстИсключения, "%2", ВременнаяСтрока.ИмяТаблицы);
						
						ВызватьИсключение ТекстИсключения;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры

Процедура ЗаменитьСсылкиНаПредопределенные(ИмяФайла)
	
	ПотокЧтения = Новый ЧтениеТекста(ИмяФайла);
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	ПотокЗаписи = Новый ЗаписьТекста(ВременныйФайл);
	
	// Константы для разбора текста
	НачалоТипа = "xsi:type=""v8:";
	ДлинаНачалаТипа = СтрДлина(НачалоТипа);
	КонецТипа = """>";
	ДлинаКонцаТипа = СтрДлина(КонецТипа);
	
	ИсходнаяСтрока = ПотокЧтения.ПрочитатьСтроку();
	Пока ИсходнаяСтрока <> Неопределено Цикл
		
		ОстатокСтроки = Неопределено;
		
		ТекущаяПозиция = 1;
		ПозицияТипа = Найти(ИсходнаяСтрока, НачалоТипа);
		Пока ПозицияТипа > 0 Цикл
			
			ПотокЗаписи.Записать(Сред(ИсходнаяСтрока, ТекущаяПозиция, ПозицияТипа - 1 + ДлинаНачалаТипа));
			
			ОстатокСтроки = Сред(ИсходнаяСтрока, ТекущаяПозиция + ПозицияТипа + ДлинаНачалаТипа - 1);
			ТекущаяПозиция = ТекущаяПозиция + ПозицияТипа + ДлинаНачалаТипа - 1;
			
			ПозицияКонцаТипа = Найти(ОстатокСтроки, КонецТипа);
			Если ПозицияКонцаТипа = 0 Тогда
				Прервать;
			КонецЕсли;
			
			ИмяТипа = Лев(ОстатокСтроки, ПозицияКонцаТипа - 1);
			СоответствиеЗамены = СоответствиеЗаменыСсылок.Получить(ИмяТипа);
			Если СоответствиеЗамены = Неопределено Тогда
				ПозицияТипа = Найти(ОстатокСтроки, НачалоТипа);
				Продолжить;
			КонецЕсли;
			
			ПотокЗаписи.Записать(ИмяТипа);
			ПотокЗаписи.Записать(КонецТипа);
			
			ИсходнаяСсылкаXML = Сред(ОстатокСтроки, ПозицияКонцаТипа + ДлинаКонцаТипа, 36);
			
			НайденнаяСсылкаXML = СоответствиеЗамены.Получить(ИсходнаяСсылкаXML);
			
			Если НайденнаяСсылкаXML = Неопределено Тогда
				ПотокЗаписи.Записать(ИсходнаяСсылкаXML);
			Иначе
				ПотокЗаписи.Записать(НайденнаяСсылкаXML);
			КонецЕсли;
			
			ТекущаяПозиция = ТекущаяПозиция + ПозицияКонцаТипа - 1 + ДлинаКонцаТипа + 36;
			ОстатокСтроки = Сред(ОстатокСтроки, ПозицияКонцаТипа + ДлинаКонцаТипа + 36);
			ПозицияТипа = Найти(ОстатокСтроки, НачалоТипа);
			
		КонецЦикла;
		
		Если ОстатокСтроки <> Неопределено Тогда
			ПотокЗаписи.ЗаписатьСтроку(ОстатокСтроки);
		Иначе
			ПотокЗаписи.ЗаписатьСтроку(ИсходнаяСтрока);
		КонецЕсли;
		
		ИсходнаяСтрока = ПотокЧтения.ПрочитатьСтроку();
		
	КонецЦикла;
	
	ПотокЧтения.Закрыть();
	ПотокЗаписи.Закрыть();
	
	ИмяФайла = ВременныйФайл;
	
КонецПроцедуры

Функция ЭтоМетаданныеСПредопределеннымиЭлементами(ОбъектМетаданных)
	
	Возврат Метаданные.Справочники.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных)
		Или Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных);
	
КонецФункции

// Возвращает СериализаторXDTO с аннотацией типов.
//
// Возвращаемое значение:
//	Сериализатор - Глобальная переменная типа СериализаторXDTO.
//
Процедура ИнициализироватьСериализаторXDTOСАннотациейТипов()
	
	ТипыСАннотациейСсылок = ПредопределенныеТипыПриВыгрузке();
	
	Если ТипыСАннотациейСсылок.Количество() > 0 Тогда
		
		Фабрика = ПолучитьФабрикуСУказаниемТипов(ТипыСАннотациейСсылок);
		Сериализатор = Новый СериализаторXDTO(Фабрика);
		
	Иначе
		
		Сериализатор = СериализаторXDTO;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПредопределенныеТипыПриВыгрузке()
	
	Типы = Новый Массив;
	
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		Типы.Добавить(ОбъектМетаданных);
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.ПланыСчетов Цикл
		Типы.Добавить(ОбъектМетаданных);
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовХарактеристик Цикл
		Типы.Добавить(ОбъектМетаданных);
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовРасчета Цикл
		Типы.Добавить(ОбъектМетаданных);
	КонецЦикла;
	
	Возврат Типы;
	
КонецФункции

// Возвращает фабрику с указанием типов.
//
// Параметры:
//	Типы - ФиксированныйМассив (Метаданные) - массив типов.
//
// Возвращаемое значение:
//	ФабрикаXDTO - фабрика.
//
Функция ПолучитьФабрикуСУказаниемТипов(Знач Типы)
	
	НаборСхем = ФабрикаXDTO.ЭкспортСхемыXML("http://v8.1c.ru/8.1/data/enterprise/current-config");
	Схема = НаборСхем[0];
	Схема.ОбновитьЭлементDOM();
	
	УказанныеТипы = Новый Соответствие;
	Для каждого Тип Из Типы Цикл
		УказанныеТипы.Вставить(XMLТипСсылки(Тип), Истина);
	КонецЦикла;
	
	ПространствоИмен = Новый Соответствие;
	ПространствоИмен.Вставить("xs", "http://www.w3.org/2001/XMLSchema");
	РазыменовательПространствИменDOM = Новый РазыменовательПространствИменDOM(ПространствоИмен);
	ТекстXPath = "/xs:schema/xs:complexType/xs:sequence/xs:element[starts-with(@type,'tns:')]";
	
	Запрос = Схема.ДокументDOM.СоздатьВыражениеXPath(ТекстXPath, РазыменовательПространствИменDOM);
	Результат = Запрос.Вычислить(Схема.ДокументDOM);

	Пока Истина Цикл
		
		УзелПоля = Результат.ПолучитьСледующий();
		Если УзелПоля = Неопределено Тогда
			Прервать;
		КонецЕсли;
		АтрибутТип = УзелПоля.Атрибуты.ПолучитьИменованныйЭлемент("type");
		ТипБезNSПрефикса = Сред(АтрибутТип.ТекстовоеСодержимое, СтрДлина("tns:") + 1);
		
		Если УказанныеТипы.Получить(ТипБезNSПрефикса) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УзелПоля.УстановитьАтрибут("nillable", "true");
		УзелПоля.УдалитьАтрибут("type");
	КонецЦикла;
	
	ЗаписьXML = Новый ЗаписьXML;
	ИмяФайлаСхемы = ПолучитьИмяВременногоФайла("xsd");
	ЗаписьXML.ОткрытьФайл(ИмяФайлаСхемы);
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(Схема.ДокументDOM, ЗаписьXML);
	ЗаписьXML.Закрыть();
	
	Фабрика = СоздатьФабрикуXDTO(ИмяФайлаСхемы);
	
	Попытка
		УдалитьФайлы(ИмяФайлаСхемы);
	Исключение
	КонецПопытки;
	
	Возврат Фабрика;
	
КонецФункции

// Возвращает имя типа, который будет использован в xml файле для указанного объекта метаданных
// Используется при поиске и замене ссылок при загрузке, при модификации схемы current-config при записи
// 
// Параметры:
//  Значение - Объект метаданных или Ссылка
//
// Возвращаемое значение:
//  Строка - Строка вида AccountingRegisterRecordSet.Хозрасчетный, описывающая объект метаданных 
//
Функция XMLТипСсылки(Знач Значение)
	
	Если ТипЗнч(Значение) = Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Значение;
		МенеджерОбъекта = МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		Ссылка = МенеджерОбъекта.ПолучитьСсылку();
	Иначе
		ОбъектМетаданных = Значение.Метаданные();
		Ссылка = Значение;
	КонецЕсли;
	
	Если ОбъектОбразуетСсылочныйТип(ОбъектМетаданных) Тогда
		
		Возврат СериализаторXDTO.XMLТипЗнч(Ссылка).ИмяТипа;
		
	Иначе
		
		ТекстИсключения = НСтр("ru = 'Ошибка при определении XMLТипа ссылки для объекта %1: объект не является ссылочным!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%1", ОбъектМетаданных.ПолноеИмя());
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецФункции

// Возвращает менеджер объекта по полному имени объекта метаданных.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер.
// 
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя)
	
	ЧастиИмени = РазложитьСтрокуВМассивПодстрок(ПолноеИмя);
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ = ЧастиИмени[1];
	КонецЕсли;
	
	Если ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
	КонецЕсли;
	
	Возврат Менеджер[ИмяОМ];
	
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ".")
	
	МассивСтрок = Новый Массив();
	ДлинаРазделителя = СтрДлина(Разделитель);
	Пока Истина Цикл
		Поз = Найти(Стр, Разделитель);
		Если Поз = 0 Тогда
			Если (СокрЛП(Стр) <> "") Тогда
				МассивСтрок.Добавить(Стр);
			КонецЕсли;
			Возврат МассивСтрок;
		КонецЕсли;
		МассивСтрок.Добавить(Лев(Стр,Поз - 1));
		Стр = Сред(Стр, Поз + ДлинаРазделителя);
	КонецЦикла;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	
	Возврат СтрокаПодстановки;
КонецФункции

// Возвращает Истина, если подсистема существует.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка. Полное имя объекта метаданных подсистема без слов "Подсистема.".
//                        Например: "СтандартныеПодсистемы.БазоваяФункциональность".
//
// Пример вызова необязательной подсистемы:
//
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
//  	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
//  	МодульУправлениеДоступом.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = ИменаПодсистем();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции

// Возвращает соответствие имен подсистем и значения Истина;
Функция ИменаПодсистем() Экспорт
	
	Возврат Новый ФиксированноеСоответствие(ИменаПодчиненныхПодсистем(Метаданные));
	
КонецФункции

Функция ИменаПодчиненныхПодсистем(РодительскаяПодсистема)
	
	Имена = Новый Соответствие;
	
	Для Каждого ТекущаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл
		
		Имена.Вставить(ТекущаяПодсистема.Имя, Истина);
		ИменаПодчиненных = ИменаПодчиненныхПодсистем(ТекущаяПодсистема);
		
		Для каждого ИмяПодчиненной Из ИменаПодчиненных Цикл
			Имена.Вставить(ТекущаяПодсистема.Имя + "." + ИмяПодчиненной.Ключ, Истина);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Имена;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль.
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции


#Область АдаптивнаяЧасть

Процедура Адапт_ВыполнитьВыгрузкуВФоне(СтруктураПараметров, АдресРезультата) Экспорт 
	
	Инициализация();
	Адапт_ПроставитьПометкиВыгружаемыхДанных(ДеревоМетаданных.Строки, СтруктураПараметров.ДеревоМетаданных.Строки);
	
	Адапт_ИнициализироватьПараметры(СтруктураПараметров);
	
	ВыполнитьВыгрузку(СтруктураПараметров);
	
	Файл = Новый Файл(СтруктураПараметров.ИмяФайла);
	Если Не Файл.Существует() Тогда
		ВызватьИсключение("Нет файла выгрузки для записи");	
	КонецЕсли;
	
	Если СтруктураПараметров.РежимРаботыНаКлиенте Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(СтруктураПараметров.ИмяФайла);
		ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура Адапт_ИнициализироватьПараметры(СтруктураПараметров) 
	
	ИспользоватьОтборПоДатеДляВсехОбъектов = СтруктураПараметров.ИспользоватьОтборПоДатеДляВсехОбъектов;
	ВыгружатьСДокументомЕгоДвижения        = СтруктураПараметров.ВыгружатьСДокументомЕгоДвижения;
	ПериодВыгрузки                         = СтруктураПараметров.ПериодВыгрузки;
	ТипВыгрузкиПериодическихРегистров      = СтруктураПараметров.ТипВыгрузкиПериодическихРегистров;
	ДатаНачала                             = СтруктураПараметров.ДатаНачала;
	ДатаОкончания                          = СтруктураПараметров.ДатаОкончания;
	РежимРаботыНаКлиенте                   = СтруктураПараметров.РежимРаботыНаКлиенте;
	
КонецПроцедуры

Функция Адапт_ПолучитьЧтениеXMLИзФайла(ИмяФайла) 
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	// проверка формата файла обмена
	Если Не ЧтениеXML.Прочитать()
		Или ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента
		Или ЧтениеXML.ЛокальноеИмя <> "_1CV8DtUD_Adapt"
		Или ЧтениеXML.URIПространстваИмен <> "http://www.1c.ru/V8/1CV8DtUD/" Тогда
		
		Если мЭтоФоновыйРежим = Истина Тогда
			ВызватьИсключение("Неверный формат файла выгрузки");
		Иначе
			СообщитьПользователю("Неверный формат файла выгрузки");
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЧтениеXML.Прочитать()
		Или ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента
		Или ЧтениеXML.ЛокальноеИмя <> "Data" Тогда
		
		Если мЭтоФоновыйРежим = Истина Тогда
			ВызватьИсключение("Неверный формат файла выгрузки");
		Иначе
			СообщитьПользователю("Неверный формат файла выгрузки");
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЧтениеXML;
	
КонецФункции

Функция Адапт_ПрочитатьУзел(ЧтениеXML) 
	
	Если Не ЧтениеXML.Прочитать() Тогда 
		
		Если Адапт_ЭтоФоновыйРежим() Тогда
			ВызватьИсключение("Неверный формат файла выгрузки");
		Иначе
			СообщитьПользователю("Неверный формат файла выгрузки");
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция Адапт_ЭтоФоновыйРежим() 
	
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	Если Сеанс.ПолучитьФоновоеЗадание() = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура Адапт_ПроставитьПометкиВыгружаемыхДанных(СтрокиИсходногоДерева, СтрокиЗаменяемогоДерева)
	
	КолонкаВыгружать = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("Выгружать");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаВыгружать, "Выгружать");
	
	КолонкаВыгружатьПриНеобходимости = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("ВыгружатьПриНеобходимости");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаВыгружатьПриНеобходимости, "ВыгружатьПриНеобходимости");
	
	КолонкаРазвернут = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("Развернут");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаРазвернут, "Развернут");
	
	КолонкаОтбор = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("Отбор");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаОтбор, "Отбор");
	
	Для Каждого СтрокаИсходногоДерева Из СтрокиИсходногоДерева Цикл
		
		ИндексСтроки = СтрокиИсходногоДерева.Индекс(СтрокаИсходногоДерева);
		СтрокаИзменяемогоДерева = СтрокиЗаменяемогоДерева.Получить(ИндексСтроки);
		
		Адапт_ПроставитьПометкиВыгружаемыхДанных(СтрокаИсходногоДерева.Строки, СтрокаИзменяемогоДерева.Строки);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Адапт_ПолучитьКолонкиОтбора(Отбор) 
	
	ПоляОтбора = Новый Соответствие;
	Для каждого Эл Из Отбор Цикл
		ПоляОтбора.Вставить(Эл.Имя, Истина);
	КонецЦикла;
	
	Возврат ПоляОтбора;
	
КонецФункции

Функция Адапт_ПолучитьСвойстваОбъектаXDTOТекущейКонфигурации(ИмяОбъекта)

	СтрокаТЗ = мВсеОбъектыКонфигурации.Найти(ИмяОбъекта, "Наименование");
	
	Возврат СтрокаТЗ.СоответствиеСвойств;
	
КонецФункции

Функция Адапт_НайтиЗначениеСвойстваВКоллекции(КоллекцияЭлементов, ИмяСвойства, Значение) 
	
	Для каждого Эл Из КоллекцияЭлементов Цикл
		Если Эл[ИмяСвойства] = Значение Тогда
			Возврат Эл;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция Адапт_ПолучитьСвойствоXDTO(КоллекцияСвойствОбъекта, ИмяСвойства, ПолноеИмяРодОбъекта) 
	
	СвойстваОбъектаИзКэша = мКэшСвойствXDTO[ПолноеИмяРодОбъекта];
	
	Если СвойстваОбъектаИзКэша = Неопределено Тогда
		Соотв = Новый Соответствие;
		Для каждого Эл Из КоллекцияСвойствОбъекта Цикл
			Соотв.Вставить(Эл.Имя, Эл);
		КонецЦикла;
		мКэшСвойствXDTO.Вставить(ПолноеИмяРодОбъекта, Соотв);
		
		СвойстваОбъектаИзКэша = Соотв;
	КонецЕсли;
	
	Результат = СвойстваОбъектаИзКэша[ИмяСвойства];
	
	Возврат Результат;
	
КонецФункции

Функция Адапт_ВсеСсылочныеТипыКонфигурации()
	
	Результат = Новый Массив;
	
	Адапт_ДополнитьМассив(Результат, Справочники.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, Документы.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, БизнесПроцессы.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, ПланыВидовХарактеристик.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, ПланыСчетов.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, ПланыВидовРасчета.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, Задачи.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, ПланыОбмена.ТипВсеСсылки().Типы());
	Адапт_ДополнитьМассив(Результат, Перечисления.ТипВсеСсылки().Типы());
	
	Возврат Результат;
	
КонецФункции

Процедура Адапт_ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь)
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция Адапт_ПустоеЗначениеТипаXDTO(ТипXDTO) 
	
	ИмяТипа = ВРЕГ(ТипXDTO.Имя); 
	Если ИмяТипа = "DATETIME" Тогда
		ИмяТипа = "DATE";
	ИначеЕсли ИмяТипа = "DECIMAL" Тогда
		ИмяТипа = "NUMBER";
	КонецЕсли;
	
	Если ИмяТипа = "ANYREF" Тогда
		МассивТипов = Адапт_ВсеСсылочныеТипыКонфигурации();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "ANYTYPE" Тогда
		ОписаниеТипов = Новый ОписаниеТипов;
		Возврат Неопределено;
	ИначеЕсли ИмяТипа = "CATALOGREF" Тогда
		МассивТипов = Справочники.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "DOCUMENTREF" Тогда
		МассивТипов = Документы.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "BISUNESSPROCESSREF" Тогда
		МассивТипов = БизнесПроцессы.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "CHARTOFCHARACTERISTICTYPESREF" Тогда
		МассивТипов = ПланыВидовХарактеристик.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "CHARTOFACCOUNTREF" Тогда
		МассивТипов = ПланыСчетов.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "CHARTOFCALCULATIONTYPESREF" Тогда
		МассивТипов = ПланыВидовРасчета.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "TAKSREF" Тогда
		МассивТипов = Задачи.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "EXCHANGEPLANREF" Тогда
		МассивТипов = ПланыОбмена.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ИмяТипа = "ENUMREF" Тогда
		МассивТипов = Перечисления.ТипВсеСсылки().Типы();
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли СтрНайти(ИмяТипа, "EXTDIMENSIONS.") > 0 Тогда
		Возврат ФабрикаXDTO.Создать(ТипXDTO);	
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов(ИмяТипа);
	КонецЕсли;
	
	ПустоеЗначение = ОписаниеТипов.ПривестиЗначение("");
	
	Возврат ПустоеЗначение;
	
КонецФункции

// Откуда - структура со свойствами:
//		  *Коллекция - 
//		  *Имя -
//		  *ТипXDTO -
Процедура Адапт_ЗаполнитьТабЧастьОбъектаXDTO(Куда, Откуда, СоответствиеСвойствОбъектаЭтойКонфигурации) 
	
	Если Откуда.Коллекция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗначений = Новый Массив;
	Для каждого КолонкаСтрокиТЧ Из Откуда.Коллекция Цикл
		МассивЗначений.Добавить(КолонкаСтрокиТЧ);
	КонецЦикла;
	
	ТипXDTO = Откуда.ТипXDTO;
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
		
	Адапт_ЗаполнитьСвойстваОбъектаXDTO(ОбъектXDTO, МассивЗначений, ТипXDTO.Имя, СоответствиеСвойствОбъектаЭтойКонфигурации);
	
	Если Куда = Неопределено Тогда
		Куда = ОбъектXDTO;
	Иначе
		Куда.Добавить(ОбъектXDTO);
	КонецЕсли;
	
КонецПроцедуры

// Откуда - структура со свойствами:
//		  *Коллекция - СписокУзловDOM 
//		  *Имя - Строка
//		  *ТипXDTO - ТипОбъектаXDTO
Процедура Адапт_ЗаполнитьСубконтоОбъектаXDTO(Куда, Откуда, СоответствиеСвойствОбъектаЭтойКонфигурации) 
	
	//Откуда.Коллекция - СписокУзловDOM
	
	Коллекция = Откуда.Коллекция;
	Количество = Коллекция.Количество();
	Если Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокСубконто = Новый Массив;
	Сч = 0;
	Пока Сч < Количество - 1 Цикл
		Тип = Коллекция[Сч];
		Значение = Коллекция[Сч + 1];
		
		Массив = Новый Массив;
		Массив.Добавить(Тип);
		Массив.Добавить(Значение);
		СписокСубконто.Добавить(Массив);
		
		Сч = Сч + 2;
	КонецЦикла;
	
	
	ТипXDTO = Откуда.ТипXDTO;
	
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
	Для каждого выбСубконто Из СписокСубконто Цикл
		
		Адапт_ЗаполнитьСвойстваОбъектаXDTO(ОбъектXDTO, выбСубконто, ТипXDTO.Имя, СоответствиеСвойствОбъектаЭтойКонфигурации);
	КонецЦикла;
	
	Куда = ОбъектXDTO;

КонецПроцедуры

Процедура Адапт_ЗаполнитьСубконтоЗаписиНабораЗаписей(Куда, Откуда) 
	
	Если Адапт_ЕстьСвойство(Откуда, "ExtDimensionsDr") И Адапт_ЕстьСвойство(Куда, "ExtDimensionsDr") Тогда
		
		СубконтоДтОткуда = Откуда.ExtDimensionsDr;
		СписокСубконтоКуда = Куда.ExtDimensionsDr;
		
		Для Сч = 0 По СубконтоДтОткуда.Value.Количество() - 1 Цикл
			ИмяСубконто = СубконтоДтОткуда.Type[Сч];
			ЗначениеСубКонто =  СубконтоДтОткуда.Value[Сч];
			СписокСубконтоКуда.Вставить(ИмяСубконто, ЗначениеСубКонто);
		КонецЦикла;
		
	КонецЕсли;
		
	Если Адапт_ЕстьСвойство(Откуда, "ExtDimensionsCr") И Адапт_ЕстьСвойство(Куда, "ExtDimensionsCr") Тогда
		СубконтоКтОткуда = Откуда.ExtDimensionsCr;
		СписокСубконтоКуда = Куда.ExtDimensionsCr;
		
		Для Сч = 0 По СубконтоКтОткуда.Value.Количество() - 1 Цикл
			ИмяСубконто = СубконтоКтОткуда.Type[Сч];
			ЗначениеСубКонто =  СубконтоКтОткуда.Value[Сч];
			СписокСубконтоКуда.Вставить(ИмяСубконто, ЗначениеСубКонто);
		КонецЦикла;
	КонецЕсли;
	
	Если Адапт_ЕстьСвойство(Откуда, "ExtDimensions") И Адапт_ЕстьСвойство(Куда, "ExtDimensions") Тогда
		СубконтоОткуда = Откуда.ExtDimensions;
		СписокСубконтоКуда = Куда.ExtDimensions;
		
		Для Сч = 0 По СубконтоОткуда.Value.Количество() - 1 Цикл
			ИмяСубконто = СубконтоОткуда.Type[Сч];
			ЗначениеСубКонто =  СубконтоОткуда.Value[Сч];
			СписокСубконтоКуда.Вставить(ИмяСубконто, ЗначениеСубКонто);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура Адапт_ЗаполнитьДополнительныеСвойства(ЗагруженноеЗначение, СтруктураПараметров)
	

	Если Не Адапт_ЕстьСвойство(ЗагруженноеЗначение, "ДополнительныеСвойства") Тогда
		Возврат;
	КонецЕсли;

	Если СтруктураПараметров.ОтключитьРегистрациюПлановОбмена Тогда
		ЗагруженноеЗначение.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	КонецЕсли;
	
	Если СтруктураПараметров.НеВыполнятьКонтрольУдаляемых Тогда
		ЗагруженноеЗначение.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	КонецЕсли;
	
	Если СтруктураПараметров.ПропуститьЗаписьВерсииОбъекта Тогда
		ЗагруженноеЗначение.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
	КонецЕсли;

КонецПроцедуры

Процедура Адапт_ЗаполнитьРядКоллекцииОбъектаXDTO(Куда, Откуда, СоответствиеСвойствОбъектаЭтойКонфигурации) 
	
	//Куда - СписокXDTO - может быть пустым, если данный ряд - первый
	//Откуда.Имя         = "ChartOfAccountsObject.Хозрасчетный"
	//Откуда.ИмяСвойства = "ExtDimensionType"
	//Откуда.Коллекция - СписокУзловDOM - содержит ЭлементыDOM на каждый реквизит
	Если Откуда.Коллекция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипXDTO = Откуда.ТипXDTO;
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
	
	Если СтрНайти(Откуда.ТипXDTO.Имя, "Row.") > 0 Тогда
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
		Адапт_ЗаполнитьСвойстваОбъектаXDTO(ОбъектXDTO, Откуда.Коллекция, ТипXDTO.Имя, СоответствиеСвойствОбъектаЭтойКонфигурации);
		НовСтрока = Куда.Добавить(ОбъектXDTO);
	Иначе
		Для каждого выбРяд Из Откуда.Коллекция Цикл
			ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
			
			Адапт_ЗаполнитьСвойстваОбъектаXDTO(ОбъектXDTO, выбРяд.ДочерниеУзлы, ТипXDTO.Имя, СоответствиеСвойствОбъектаЭтойКонфигурации);
			НовСтрока = Куда.Добавить(ОбъектXDTO);
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура Адапт_ЗаполнитьРядТабличнойЧастиОбъектаXDTO(Куда, Откуда, ИмяТипа, СоответствиеСвойствОбъектаЭтойКонфигурации) 
	
	Если Откуда.Коллекция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипXDTO = Откуда.ТипXDTO;
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
	
	Если Откуда.Коллекция[0].ИмяУзла = "Row" Тогда
		Для каждого выбРяд Из Откуда.Коллекция Цикл
			Адапт_ЗаполнитьСвойстваОбъектаXDTO(ОбъектXDTO, выбРяд.ДочерниеУзлы, ТипXDTO.Имя, СоответствиеСвойствОбъектаЭтойКонфигурации);
			НовСтрока = Куда.Добавить(ОбъектXDTO);
		КонецЦикла;
		
	Иначе
		Адапт_ЗаполнитьСвойстваОбъектаXDTO(ОбъектXDTO, Откуда.Коллекция, ТипXDTO.Имя, СоответствиеСвойствОбъектаЭтойКонфигурации);
		НовСтрока = Куда.Добавить(ОбъектXDTO);	
	КонецЕсли;
	
КонецПроцедуры

// Заполняет ОбъектXDTO из списка элементов DOM
//  Параметры:
//       Куда   - ОбъектXDTO     - ОбъектXDTO нужного типа из типов XDTO данной конфигурации
//       Откуда - СписокУзловDOM - список содержит элементы DOM со значениями реквизитов
Функция Адапт_ЗаполнитьСвойстваОбъектаXDTO(Куда, Откуда, ПолноеИмяРодОбъекта, СоответствиеСвойствОбъектаЭтойКонфигурации) 

	
	ТипXDTO_ОписаниеТипов = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "TypeDescription");
	ТипXDTO_Отбор = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/enterprise", "Filter");
	КлючиОткуда = "Коллекция, Имя, ИмяСвойства, ТипXDTO";
	
	ОписаниеРеквизитовОбъекта = Адапт_ПолучитьИнформациюОРеквизитахОбъектаЭтойКонфигурации(ПолноеИмяРодОбъекта);
	
	ЭтоГруппа = Ложь;
	ГУИД = Неопределено;
	Для каждого СвойствоОбъекта Из Откуда Цикл
		
		Попытка
			ИмяСвойства = Адапт_ПолучитьИмяОбъекта(СвойствоОбъекта);
			
			Если ИмяСвойства = "IsFolder" Тогда
				ЭтоГруппа = СвойствоОбъекта.ТекстовоеСодержимое = "true";
			ИначеЕсли ИмяСвойства = "Ref" Тогда
				ГУИД = СвойствоОбъекта.ТекстовоеСодержимое;
			КонецЕсли;
			
			СвойствоXDTOИзСхемы = СоответствиеСвойствОбъектаЭтойКонфигурации[ИмяСвойства];
			
			
			Если СвойствоXDTOИзСхемы = Неопределено Тогда
				
				//ТекстСообщения = "Нет свойства: " + ПолноеИмяРодОбъекта + " " + ИмяСвойства; //мВсеОбъектыКонфигурации
				//Адапт_СообщитьОбОшибкеБезПовторов(ТекстСообщения);
				
				Продолжить;
			КонецЕсли;			
			
			ТипСвойстваЭтаКонфигурация = Адапт_ПолучитьТипСвойстваЭтаКонфигурация(СвойствоXDTOИзСхемы, СвойствоОбъекта);
			
			Если ТипСвойстваЭтаКонфигурация = Неопределено Тогда
				Продолжить;
			ИначеЕсли  ТипСвойстваЭтаКонфигурация = Null Тогда // свойство Откуда - не заполнено и не указан тип
				Продолжить;
			КонецЕсли;
			
			
			Подчиненные = СвойствоОбъекта.ДочерниеУзлы;
			
			Если Адапт_ЕстьСвойство(ТипСвойстваЭтаКонфигурация, "Свойства") Тогда
				ИмяТипа = СвойствоXDTOИзСхемы.type.ЛокальноеИмя;
				
				
				ВариантЗагрузкиСвойства = Адапт_ВариантЗагрузкиСвойства(ТипСвойстваЭтаКонфигурация, ИмяТипа, ТипXDTO_ОписаниеТипов, ТипXDTO_Отбор);
				
				Если ВариантЗагрузкиСвойства = "ЭтоОписаниеТипов" Тогда
					
					КоллекцияСвойствОбъекта = Куда.Свойства();
					СвойствоXDTO = Адапт_ПолучитьСвойствоXDTO(КоллекцияСвойствОбъекта, ИмяСвойства, ПолноеИмяРодОбъекта);
					
					ЗначениеXDTO = ФабрикаXDTO.Создать(ТипСвойстваЭтаКонфигурация);
					Адапт_ЗаполнитьОписаниеТиповXDTO(ЗначениеXDTO, СвойствоОбъекта); 
					Куда.Установить(СвойствоXDTO, ЗначениеXDTO);
					Продолжить;
					
				ИначеЕсли ВариантЗагрузкиСвойства = "ЭтоОтбор" Тогда
					
					КоллекцияСвойствОбъекта = Куда.Свойства();
					СвойствоXDTO = Адапт_ПолучитьСвойствоXDTO(КоллекцияСвойствОбъекта, ИмяСвойства, ПолноеИмяРодОбъекта);
					ЗначениеXDTO = ФабрикаXDTO.Создать(ТипСвойстваЭтаКонфигурация);
					Если Адапт_ЗаполнитьОтборXDTO(ЗначениеXDTO, СвойствоОбъекта) = Истина Тогда
						Куда.Установить(СвойствоXDTO, ЗначениеXDTO);
					Иначе
						Возврат Новый Структура("ГУИД, Ошибка", Неопределено, Истина);
					КонецЕсли;
					
				ИначеЕсли ВариантЗагрузкиСвойства = "ЭтоРядТабличнойЧасти" Тогда
					
					ОписанияРеквизитовКоллекции = Адапт_ПолучитьСвойстваОбъектаXDTOТекущейКонфигурации(ИмяТипа);
					СтруктураОткуда = Новый Структура(КлючиОткуда, Подчиненные, ПолноеИмяРодОбъекта, ИмяСвойства, ТипСвойстваЭтаКонфигурация);
						
					Адапт_ЗаполнитьРядТабличнойЧастиОбъектаXDTO(Куда[ИмяСвойства], СтруктураОткуда, ИмяТипа, ОписанияРеквизитовКоллекции);
					
				ИначеЕсли ВариантЗагрузкиСвойства = "ЭтоРядКоллекции" Тогда
					
					ИмяКоллекцииЕдЧисло = Адапт_ПреобразоватьИмяСтандартнойКоллекции(Куда, ИмяСвойства);
					
					ОписанияРеквизитовКоллекции = Адапт_ПолучитьСвойстваОбъектаXDTOТекущейКонфигурации(ИмяТипа);
					СтруктураОткуда = Новый Структура(КлючиОткуда, Подчиненные, ПолноеИмяРодОбъекта, ИмяСвойства, ТипСвойстваЭтаКонфигурация);
					Адапт_ЗаполнитьРядКоллекцииОбъектаXDTO(Куда[ИмяКоллекцииЕдЧисло], СтруктураОткуда, ОписанияРеквизитовКоллекции);
					
				ИначеЕсли ВариантЗагрузкиСвойства = "ЭтоСубконто" Тогда
					
					ОписанияРеквизитовКоллекции = Адапт_ПолучитьСвойстваОбъектаXDTOТекущейКонфигурации(ИмяТипа);
					СтруктураОткуда = Новый Структура(КлючиОткуда, Подчиненные, ПолноеИмяРодОбъекта, ИмяСвойства, ТипСвойстваЭтаКонфигурация);
					Адапт_ЗаполнитьСубконтоОбъектаXDTO(Куда[ИмяСвойства], СтруктураОткуда, ОписанияРеквизитовКоллекции);	
					
				Иначе
					
					ОписанияРеквизитовКоллекции = Адапт_ПолучитьСвойстваОбъектаXDTOТекущейКонфигурации(ИмяТипа);
					СтруктураОткуда = Новый Структура(КлючиОткуда, Подчиненные, ПолноеИмяРодОбъекта, ИмяСвойства, ТипСвойстваЭтаКонфигурация);
					Адапт_ЗаполнитьТабЧастьОбъектаXDTO(Куда[ИмяСвойства], СтруктураОткуда, ОписанияРеквизитовКоллекции);
				КонецЕсли;
				
			Иначе
				ТекстовоеСодержимоеУзла = СвойствоОбъекта.ТекстовоеСодержимое;
				
				Если Адапт_ЭтоПеречисление(ТипСвойстваЭтаКонфигурация.Имя)  Тогда
					Значение = Адапт_ПолучитьЗначениеПеречисления(ТипСвойстваЭтаКонфигурация.Имя, ТекстовоеСодержимоеУзла);
					
					Если Значение = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ЗначениеXDTO = ФабрикаXDTO.Создать(ТипСвойстваЭтаКонфигурация, Значение);
				Иначе

					ОписаниеТипаРеквизитаОбъекта = ОписаниеРеквизитовОбъекта[ИмяСвойства];
					Если Адапт_ЭтоПростойТипXDTO(ТипСвойстваЭтаКонфигурация) Или ТекстовоеСодержимоеУзла = "" Тогда
						ОписаниеТипов = ОписаниеТипаРеквизитаОбъекта.Тип;
						ПриведенноеЗначение = ОписаниеТипов.ПривестиЗначение(ТекстовоеСодержимоеУзла);
						Адапт_ПроверитьНаСимволыВозвратКаретки(ОписаниеТипов, ТекстовоеСодержимоеУзла, ПриведенноеЗначение);
						ЗначениеXDTO = ФабрикаXDTO.Создать(ТипСвойстваЭтаКонфигурация, ПриведенноеЗначение);
					Иначе
						ЗначениеXDTO = ФабрикаXDTO.Создать(ТипСвойстваЭтаКонфигурация, ТекстовоеСодержимоеУзла);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипЗнч(Куда[ИмяСвойства]) = Тип("СписокXDTO") Тогда
					Куда[ИмяСвойства].Добавить(ЗначениеXDTO);
					
				Иначе
					КоллекцияСвойствОбъекта = Куда.Свойства();
					СвойствоXDTO = Адапт_ПолучитьСвойствоXDTO(КоллекцияСвойствОбъекта, ИмяСвойства, ПолноеИмяРодОбъекта);
					Куда.Установить(СвойствоXDTO, ЗначениеXDTO);
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			ОШ = ОписаниеОшибки();
			СообщитьПользователю(ОШ);
			Возврат Новый Структура("ГУИД, Ошибка", ГУИД, Истина);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЭтоГруппа = Ложь Тогда
		Адапт_ДоЗаполнитьПустымиЗначениямиТипов(Куда, ПолноеИмяРодОбъекта, СоответствиеСвойствОбъектаЭтойКонфигурации);
	КонецЕсли;
	
	Возврат Новый Структура("ГУИД, Ошибка", ГУИД, Ложь);
	
КонецФункции

Функция Адапт_ВариантЗагрузкиСвойства(ТипСвойстваЭтаКонфигурация, ИмяТипа, ТипXDTO_ОписаниеТипов, ТипXDTO_Отбор) 
	
	ЭтоОписаниеТипов = (ТипСвойстваЭтаКонфигурация = ТипXDTO_ОписаниеТипов);
	
	Если ТипСвойстваЭтаКонфигурация = ТипXDTO_ОписаниеТипов Тогда
		Возврат "ЭтоОписаниеТипов";
		
	ИначеЕсли ТипСвойстваЭтаКонфигурация = ТипXDTO_Отбор Тогда
		Возврат "ЭтоОтбор";
		
	ИначеЕсли СтрНайти(ИмяТипа, "Row.") > 0 Тогда
		
		Если (СтрНайти(ИмяТипа, "TabularSectionRow.") > 0) Тогда
			Возврат "ЭтоРядТабличнойЧасти";
		Иначе
			Возврат "ЭтоРядКоллекции";
		КонецЕсли;
		
	ИначеЕсли СтрНайти(ИмяТипа, "AccountingRegisterExtDimensions.") > 0 Тогда
		Возврат "ЭтоСубконто";
		
	Иначе
		
		Возврат "ОбщийВариант";
	КонецЕсли;
	
КонецФункции

Процедура Адапт_ПроверитьНаСимволыВозвратКаретки(ОписаниеТипов, ТекстовоеСодержимоеУзла, ПриведенноеЗначение) 
	
	Если ТипЗнч(ПриведенноеЗначение) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(ТекстовоеСодержимоеУзла) > СтрДлина(ПриведенноеЗначение) Тогда
		НовТекст = СтрЗаменить(ТекстовоеСодержимоеУзла, Символы.ВК, "");
		ПриведенноеЗначение = ОписаниеТипов.ПривестиЗначение(НовТекст);
	КонецЕсли;
	
КонецПроцедуры

// Создает структуру с информацией о реквизите объекта конфигурации из метаданных
// Возвращаемое значение:
//	Структура - содержит поля:
//		* Имя - Строка - Русское соответствие имени ("Code" - "Код") 
//		* Тип - ОписаниеТипов -  
//		* Использование - Строка - "ДляГруппы", "ДляГруппыИЭлемента", "ДляЭлемента", Неопределено 
Функция Адапт_ПолучитьИнформациюОРеквизитеОбъектаЭтойКонфигурации(ПолноеИмяОбъекта, ИмяРеквизита = Неопределено) 
	
	Структура = Адапт_ПолучитьЧастиИмениОбъекта(ПолноеИмяОбъекта, Истина);
	ВидОбъектаРус = Структура.ВидОбъекта;
	ИмяОбъекта = Структура.ИмяОбъекта;
	ИмяТабчасти = Структура.ИмяТабчасти;
	
	Если ИмяТабчасти = "" Тогда
		Реквизиты = мОписанияТиповКонфигурации[ВидОбъектаРус][ИмяОбъекта].Реквизиты;
	Иначе
		Реквизиты = мОписанияТиповКонфигурации[ВидОбъектаРус][ИмяОбъекта].ТабличныеЧасти[ИмяТабчасти];
	КонецЕсли;
	
	Если ИмяРеквизита = Неопределено Тогда
		Результат = Реквизиты;
	Иначе
		Результат = Реквизиты[ИмяРеквизита];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает структуру с информацией о реквизитах объекта конфигурации из метаданных
// Возвращаемое значение:
//	Соответствие 
//   Ключ - Строка - ПолноеИмяОбъекта
//   Значение - Структура - содержит поля:
//		* Имя - Строка - Русское соответствие имени ("Code" - "Код") 
//		* Тип - ОписаниеТипов -  
//		* Использование - Строка - "ДляГруппы", "ДляГруппыИЭлемента", "ДляЭлемента", Неопределено 
Функция Адапт_ПолучитьИнформациюОРеквизитахОбъектаЭтойКонфигурации(ПолноеИмяОбъекта) 
	
	Результат = Адапт_ПолучитьИнформациюОРеквизитеОбъектаЭтойКонфигурации(ПолноеИмяОбъекта);
	
	Возврат Результат;
	
КонецФункции

Функция Адапт_ПолучитьЧастиИмениОбъекта(ПолноеИмяОбъекта, ПеревестиАнглРус = Ложь) 
	
	ЧастиИмени = СтрРазделить(ПолноеИмяОбъекта, ".", Ложь);
	
	ВидОбъекта = ЧастиИмени[0];
	ИмяОбъекта = ЧастиИмени[1];
	Если ЧастиИмени.Количество() = 3 Тогда
		ИмяТабЧасти = ЧастиИмени[2];
	Иначе
		ИмяТабЧасти = "";
	КонецЕсли;
	
	
	Если ПеревестиАнглРус Тогда
		ВидОбъектаРус = мСоответствиеВидовбъектов[ВидОбъекта];
		Если ВидОбъектаРус = Неопределено Тогда
			ВызватьИсключение("Не найден вид объекта: " + ВидОбъекта);
		КонецЕсли;
		
		ВидОбъекта = ВидОбъектаРус;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("ВидОбъекта",              ВидОбъекта);
	Результат.Вставить("ИмяОбъекта",              ИмяОбъекта);
	Результат.Вставить("ИмяТабчасти",             ИмяТабчасти);
	
	Возврат Результат;
	
КонецФункции

Процедура Адапт_ИнициализироватьСоответствиеВидовОбъектов() 
	
	мСоответствиеВидовбъектов = Новый Соответствие;
	мСоответствиеВидовбъектов.Вставить("ConstantValueManager",                        "Константы");
	
	мСоответствиеВидовбъектов.Вставить("CatalogObject",                               "Справочники");
	мСоответствиеВидовбъектов.Вставить("CatalogTabularSectionRow",                    "Справочники");
	
	мСоответствиеВидовбъектов.Вставить("DocumentObject",                              "Документы");
	мСоответствиеВидовбъектов.Вставить("DocumentTabularSectionRow",                   "Документы");
	
	мСоответствиеВидовбъектов.Вставить("ChartOfCharacteristicTypesObject",            "ПланыВидовХарактеристик");
	мСоответствиеВидовбъектов.Вставить("ChartOfCharacteristicTypesTabularSectionRow", "ПланыВидовХарактеристик");
	
	мСоответствиеВидовбъектов.Вставить("ChartOfAccountsObject",                       "ПланыСчетов");
	мСоответствиеВидовбъектов.Вставить("ChartOfAccountsExtDimensionTypesRow",         "ПланыСчетов");
	
	
	мСоответствиеВидовбъектов.Вставить("ChartOfCalculationTypesObject",               "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("ChartOfCalculationTypesTabularSectionRow",    "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("BaseCalculationTypes",                        "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("BaseCalculationTypesRow",                     "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("DisplacingCalculationTypes",                  "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("DisplacingCalculationTypesRow",               "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("LeadingCalculationTypes",                     "ПланыВидовРасчета");
	мСоответствиеВидовбъектов.Вставить("LeadingCalculationTypesRow",                  "ПланыВидовРасчета");
	
	
	мСоответствиеВидовбъектов.Вставить("InformationRegisterRecordSet",                "РегистрыСведений");
	мСоответствиеВидовбъектов.Вставить("InformationRegisterRecord",                   "РегистрыСведений");
	
	мСоответствиеВидовбъектов.Вставить("AccumulationRegisterRecordSet",               "РегистрыНакопления");
	мСоответствиеВидовбъектов.Вставить("AccumulationRegisterRecord",                  "РегистрыНакопления");
	
	мСоответствиеВидовбъектов.Вставить("AccountingRegisterRecordSet",                 "РегистрыБухгалтерии");
	мСоответствиеВидовбъектов.Вставить("AccountingRegisterRecord",                    "РегистрыБухгалтерии");
	мСоответствиеВидовбъектов.Вставить("AccountingRegisterExtDimensions",             "РегистрыБухгалтерии");
	
	мСоответствиеВидовбъектов.Вставить("CalculationRegisterRecordSet",                "РегистрыРасчета");
	мСоответствиеВидовбъектов.Вставить("CalculationRegisterRecord",                   "РегистрыРасчета");
	
	
	мСоответствиеВидовбъектов.Вставить("BusinessProcessObject",                       "БизнесПроцессы");
	мСоответствиеВидовбъектов.Вставить("BusinessProcessTabularSectionRow",            "БизнесПроцессы");
	
	мСоответствиеВидовбъектов.Вставить("TaskObject",                                  "Задачи");
	мСоответствиеВидовбъектов.Вставить("TaskTabularSectionRow",                       "Задачи");
	
	мСоответствиеВидовбъектов.Вставить("ExchangePlanObject",                          "ПланыОбмена");
	мСоответствиеВидовбъектов.Вставить("ExchangePlanTabularSectionRow",               "ПланыОбмена");
	
КонецПроцедуры

Функция Адапт_ПолучитьТипСвойстваЭтаКонфигурация(СвойствоXDTOИзСхемы, СвойствоОбъекта) 
	
	Если СвойствоXDTOИзСхемы.type = Неопределено Тогда
		Если СвойствоОбъекта.ТекстовоеСодержимое = "" Тогда
			Возврат Null;
		КонецЕсли;
		//Составной тип, но возможно пустое значение
		URIПространстваИмен = "http://v8.1c.ru/8.1/data/enterprise/current-config";
		ТипСвойстваXDTOИзСхемы = Адапт_ОпределитьТипПоАтрибуту(СвойствоОбъекта);
		Если ТипСвойстваXDTOИзСхемы = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		URIПространстваИмен = СвойствоXDTOИзСхемы.type.URIПространстваИмен;
		ТипСвойстваXDTOИзСхемы = ФабрикаXDTO.Тип(URIПространстваИмен, СвойствоXDTOИзСхемы.type.ЛокальноеИмя);
	КонецЕсли;
	
	Если URIПространстваИмен = "http://v8.1c.ru/8.1/data/enterprise" 
		И (СвойствоXDTOИзСхемы.type.ЛокальноеИмя = "AnyRef") Тогда
		ТипЛюбаяСсылка = ТипСвойстваXDTOИзСхемы;
		
		ТипСвойстваЭтаКонфигурация = Адапт_ОпределитьТипПоАтрибуту(СвойствоОбъекта);
		Если ТипСвойстваЭтаКонфигурация = Неопределено Тогда
			ТипСвойстваЭтаКонфигурация = ТипЛюбаяСсылка;
		КонецЕсли;
	Иначе
		ТипСвойстваЭтаКонфигурация = ТипСвойстваXDTOИзСхемы;
		
	КонецЕсли;
	
	Возврат ТипСвойстваЭтаКонфигурация;
	
КонецФункции

Функция Адапт_ЭтоПеречисление(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 7) = "EnumRef";
	
КонецФункции

Функция Адапт_ЭтоСправочник(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 13) = "CatalogObject";
	
КонецФункции

Функция Адапт_ЭтоДокумент(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 14) = "DocumentObject";
	
КонецФункции

Функция Адапт_ЭтоКонстанта(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 20) = "ConstantValueManager";
	
КонецФункции

Функция Адапт_ЭтоНаборЗаписейРегистра(ПолноеИмяОбъекта) 
	
	Если СтрНайти(ПолноеИмяОбъекта, "RecordSet.") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция Адапт_ЭтоПланВидовХарактеристик(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 32) = "ChartOfCharacteristicTypesObject";
	
КонецФункции

Функция Адапт_ЭтоПланВидовРасчета(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 29) = "ChartOfCalculationTypesObject";
	
КонецФункции

Функция Адапт_ЭтоПланСчетов(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 21) = "ChartOfAccountsObject";
	
КонецФункции

Функция Адапт_ЭтоБизнесПроцесс(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 21) = "BusinessProcessObject";
	
КонецФункции

Функция Адапт_ЭтоЗадача(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 10) = "TaskObject";
	
КонецФункции

Функция Адапт_ЭтоПланОбмена(ПолноеИмяОбъекта) 
	
	Возврат Лев(ПолноеИмяОбъекта, 18) = "ExchangePlanObject";
	
КонецФункции

Функция Адапт_ПолучитьЗначениеПеречисления(ПолноеИмяПеречисления, ТекстовоеСодержимоеУзла) 
	
	ЧастиИмени = СтрРазделить(ПолноеИмяПеречисления, ".", Ложь);
	ИмяПеречисления = ЧастиИмени[1];
	ПеречислениеМенеджер = Перечисления[ИмяПеречисления];
	
	Результат = Неопределено;
	Если Адапт_ЭтоГУИД(ТекстовоеСодержимоеУзла) Тогда
		Для каждого выбЗначение Из ПеречислениеМенеджер Цикл
			ГУИДЗначения = Адапт_ПолучитьГУИД(выбЗначение);
			Если ГУИДЗначения = ТекстовоеСодержимоеУзла Тогда
				Результат = выбЗначение;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Адапт_ЕстьСвойство(ПеречислениеМенеджер, ТекстовоеСодержимоеУзла) Тогда
			Результат = ПеречислениеМенеджер[ТекстовоеСодержимоеУзла];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Адапт_ПолучитьГУИД(Ссылка)
	
    СтрокаВнутр = ЗначениеВСтрокуВнутр(Ссылка);    
    СтрокаБуфер = СтрЗаменить(СтрЗаменить(СтрокаВнутр, "}", ""), "{", "");
    СтрокаБуфер = СтрРазделить(СтрокаБуфер, ",")[2];
    СтрокаБуфер = СтрРазделить(СтрокаБуфер, ":")[1];
    Результат = 
        Прав(СтрокаБуфер, 8) + "-" + 
        Сред(СтрокаБуфер, 21, 4) + "-" + 
        Сред(СтрокаБуфер, 17, 4) + "-" + 
        Лев(СтрокаБуфер, 4) + "-" + 
        Сред(СтрокаБуфер, 5, 12);
    
    Возврат Результат;
	
КонецФункции

Функция Адапт_ЭтоГУИД(Значение) 
	
	Шаблон = "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX";
	
	Если СтрДлина(Шаблон) <> СтрДлина(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Позиция = 1 По СтрДлина(Значение) Цикл
		Если КодСимвола(Шаблон, Позиция) = 88 // X
			И ((КодСимвола(Значение, Позиция) < 48 Или КодСимвола(Значение, Позиция) > 57) // 0..9
			И (КодСимвола(Значение, Позиция) < 97 Или КодСимвола(Значение, Позиция) > 102) // a..f
			И (КодСимвола(Значение, Позиция) < 65 Или КодСимвола(Значение, Позиция) > 70)) // A..F
			Или КодСимвола(Шаблон, Позиция) = 45 И КодСимвола(Значение, Позиция) <> 45 Тогда // -
				Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

	
КонецФункции

Процедура Адапт_ЗаполнитьОписаниеТиповXDTO(Значение, СвойствоОбъекта) 
	
	Перем КвалификаторыСтроки, КвалификаторыЧисла, КвалификаторыДаты, КвалификаторыДвоичныхДанных;
	
	МассивТипов = Новый Массив;
	
	Для каждого выбУзел Из СвойствоОбъекта.ДочерниеУзлы Цикл
		СтруктураИмени = Адапт_ВыделитьПрефикс(выбУзел.ИмяЭлемента);
		ИмяЭлемента = СтруктураИмени.Имя;
		Префикс = СтруктураИмени.Префикс;
		
		Если ИмяЭлемента = "StringQualifiers" Тогда
			КвалификаторыСтроки = Адапт_ПолучитьКвалификаторыСтроки(выбУзел.ДочерниеУзлы);
		ИначеЕсли ИмяЭлемента = "NumberQualifiers" Тогда
			КвалификаторыЧисла = Адапт_ПолучитьКвалификаторыЧисла(выбУзел.ДочерниеУзлы);
		ИначеЕсли ИмяЭлемента = "DateQualifiers" Тогда
			КвалификаторыДаты = Адапт_ПолучитьКвалификаторыДаты(выбУзел.ДочерниеУзлы);
		ИначеЕсли ИмяЭлемента = "BinaryDataQualifiers" Тогда
			КвалификаторыДвоичныхДанных = Адапт_ПолучитьКвалификаторыДвоичныхДанных(выбУзел.ДочерниеУзлы);
		ИначеЕсли ИмяЭлемента = "Type" Тогда
						
			РасширенноеИмяXML = Адапт_ПолучитьРасширенноеИмяXMLТипа(выбУзел, Префикс);
			Если РасширенноеИмяXML <> Неопределено Тогда
				Значение.Type.Добавить(РасширенноеИмяXML);	
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Types" Тогда
			Для каждого выбТип Из выбУзел.ДочерниеУзлы Цикл
				РасширенноеИмяXML = Адапт_ПолучитьРасширенноеИмяXMLТипа(выбТип, Префикс);
				Если РасширенноеИмяXML <> Неопределено Тогда
					Значение.Type.Добавить(РасширенноеИмяXML);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			ВызватьИсключение "Неизвестное имя элемента: " + выбУзел.ИмяЭлемента;	
		КонецЕсли;
	КонецЦикла;
	
	Если КвалификаторыСтроки <> Неопределено Тогда
		Значение.StringQualifiers = КвалификаторыСтроки;
	КонецЕсли;
	
	Если КвалификаторыЧисла <> Неопределено Тогда
		Значение.NumberQualifiers = КвалификаторыЧисла;
	КонецЕсли;
	
	Если КвалификаторыДаты <> Неопределено Тогда
		Значение.DateQualifiers = КвалификаторыДаты;
	КонецЕсли;
	
	Если КвалификаторыДвоичныхДанных <> Неопределено Тогда
		Значение.BinaryDataQualifiers = КвалификаторыДвоичныхДанных;
	КонецЕсли;
	
	
КонецПроцедуры

Функция Адапт_ВыделитьПрефикс(ИмяУзла, ПрефиксРодителя = "") 
	
	Перем Имя, Префикс;
	
	ЧастиИмени = СтрРазделить(ИмяУзла, ":", Ложь);
	Если ЧастиИмени.Количество() = 2 Тогда
		Префикс = ЧастиИмени[0];
		Имя = ЧастиИмени[1];
	Иначе
		Если ЗначениеЗаполнено(ПрефиксРодителя) Тогда
			Префикс = ПрефиксРодителя;
		Иначе
			Префикс = "xmlns";
		КонецЕсли;
		
		Имя = ЧастиИмени[0];
	КонецЕсли;
	
	Возврат Новый Структура("Имя, Префикс", Имя, Префикс);;
	
КонецФункции

Функция Адапт_ПолучитьРасширенноеИмяXMLТипа(выбУзел, ПрефиксРодителя) 
	
	СтруктураИмени = Адапт_ВыделитьПрефикс(выбУзел.ТекстовоеСодержимое, ПрефиксРодителя);
	ИмяТипа = СтруктураИмени.Имя;
	Префикс = СтруктураИмени.Префикс;
	
	Если ВРег(ИмяТипа) = "DATETIME" Тогда
		ТипЗначения = Тип("Дата");
	ИначеЕсли ВРег(ИмяТипа) = "DECIMAL" Тогда
		ТипЗначения = Тип("Число");
	Иначе
		
		Попытка
			ТипЗначения = Тип(ИмяТипа);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ТекстСообщения = "В данной конфигурации нет типа: " + ИмяТипа;
			Адапт_СообщитьОбОшибкеБезПовторов(ТекстСообщения);
			Возврат Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	URIПространстваИмен = выбУзел.НайтиURIПространстваИмен(Префикс);
	Если URIПространстваИмен = "http://v8.1c.ru/data" Тогда
		URIПространстваИмен = "http://v8.1c.ru/8.1/data/enterprise/current-config";
	КонецЕсли;
	
	РасширенноеИмяXML = Новый РасширенноеИмяXML(URIПространстваИмен, ИмяТипа);
	
	Возврат РасширенноеИмяXML;
	
КонецФункции

Функция Адапт_ЗаполнитьОтборXDTO(ЗначениеXDTO, СвойствоОбъекта) 
	
	ЭлементыОтбора = ЗначениеXDTO.FilterItem;
	ТипXDTO_FilterItem = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/enterprise", "FilterItem");
	
	
	Для каждого Эл Из СвойствоОбъекта.ДочерниеУзлы Цикл
		ЗначениеXDTO_FilterItem = ФабрикаXDTO.Создать(ТипXDTO_FilterItem);
		
		ЛевоеЗначение = Адапт_НайтиЗначениеСвойстваВКоллекции(Эл.ДочерниеУзлы, "ИмяУзла", "Name").ТекстовоеСодержимое;
		ПравоеЗначение = Адапт_НайтиЗначениеСвойстваВКоллекции(Эл.ДочерниеУзлы, "ИмяУзла", "Value");
		
		Тип = Адапт_ОпределитьТипПоАтрибуту(ПравоеЗначение);
		Если Тип = Неопределено Тогда
			ЧастиИмениОбъектаРус = Адапт_ПолучитьЧастиИмениОбъекта(СвойствоОбъекта.РодительскийУзел.ЛокальноеИмя, Истина);
			ТекстСообщения = "Ошибка заполнения отбора набора записей: ";
			ТекстСообщения = ТекстСообщения + ЧастиИмениОбъектаРус.ВидОбъекта + "." + ЧастиИмениОбъектаРус.ИмяОбъекта;
			Адапт_СообщитьОбОшибкеБезПовторов(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		ПравоеЗначение = ФабрикаXDTO.Создать(Тип, ПравоеЗначение.ТекстовоеСодержимое); 
		
		ЗначениеXDTO_FilterItem.Name = ЛевоеЗначение;
		ЗначениеXDTO_FilterItem.Value = ПравоеЗначение;
		
		ЭлементыОтбора.Добавить(ЗначениеXDTO_FilterItem);
	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция Адапт_ПолучитьКвалификаторыСтроки(СписокЭлементов) 
	
	лДлинаСтроки = 0;
	лДопустимаяДлина = ДопустимаяДлина.Переменная;
	
	Для каждого выбКвал Из СписокЭлементов Цикл
		Если выбКвал.ИмяЭлемента = "Length" Тогда
			лДлинаСтроки = Число(выбКвал.ТекстовоеСодержимое);
		ИначеЕсли выбКвал.ИмяЭлемента = "AllowedLength" Тогда
			Если выбКвал.ТекстовоеСодержимое = "Variable" Тогда
				лДопустимаяДлина = ДопустимаяДлина.Переменная;
			ИначеЕсли выбКвал.ТекстовоеСодержимое = "Fixed" Тогда
				лДопустимаяДлина = ДопустимаяДлина.Фиксированная;
			КонецЕсли;					
		КонецЕсли;
	КонецЦикла;
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(лДлинаСтроки, лДопустимаяДлина);
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(КвалификаторыСтроки);
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция Адапт_ПолучитьКвалификаторыЧисла(СписокЭлементов) 
	
	лДопустимыйЗнак = ДопустимыйЗнак.Любой;
	лРазрядность = 0;
	лРазрядностьДробнойЧасти = 0;
	
	Для каждого выбКвал Из СписокЭлементов Цикл
		Если выбКвал.ИмяЭлемента = "AllowedSign" Тогда
			Если выбКвал.ТекстовоеСодержимое = "Any" Тогда
				лДопустимыйЗнак = ДопустимыйЗнак.Любой;
			ИначеЕсли выбКвал.ТекстовоеСодержимое = "Nonnegative" Тогда
				лДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный;
			КонецЕсли;
		ИначеЕсли выбКвал.ИмяЭлемента = "Digits" Тогда
			лРазрядность = Число(выбКвал.ТекстовоеСодержимое);	
		ИначеЕсли выбКвал.ИмяЭлемента = "FractionDigits" Тогда
			лРазрядностьДробнойЧасти = Число(выбКвал.ТекстовоеСодержимое);	
		КонецЕсли;
	КонецЦикла;
	
	КвалификаторыЧисла = Новый КвалификаторыЧисла(лРазрядность, лРазрядностьДробнойЧасти, лДопустимыйЗнак);
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(КвалификаторыЧисла);
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция Адапт_ПолучитьКвалификаторыДаты(СписокЭлементов) 
	
	лЧастиДаты = ЧастиДаты.ДатаВремя;
	
	Для каждого выбКвал Из СписокЭлементов Цикл
		Если выбКвал.ТекстовоеСодержимое = "Time" Тогда
			лЧастиДаты = ЧастиДаты.Время;
		ИначеЕсли выбКвал.ТекстовоеСодержимое = "Date" Тогда
			лЧастиДаты = ЧастиДаты.Дата;;	
		ИначеЕсли выбКвал.ТекстовоеСодержимое = "DateTime" Тогда
			лЧастиДаты = ЧастиДаты.ДатаВремя;	
		КонецЕсли;
	КонецЦикла;
	
	КвалификаторыДаты = Новый КвалификаторыДаты(лЧастиДаты);
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(КвалификаторыДаты);
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция Адапт_ПолучитьКвалификаторыДвоичныхДанных(СписокЭлементов) 
	
	лДлина = 0;
	лДопустимаяДлина = 0;
	
	Для каждого выбКвал Из СписокЭлементов Цикл
		Если выбКвал.ИмяЭлемента = "Length" Тогда
			лДлина = Число(выбКвал.ТекстовоеСодержимое);
		ИначеЕсли выбКвал.ИмяЭлемента = "AllowedLength" Тогда
			лДопустимаяДлина = Число(выбКвал.ТекстовоеСодержимое);;	
		КонецЕсли;
	КонецЦикла;
	
	КвалификаторыДвоичныхДанных = Новый КвалификаторыДвоичныхДанных(лДлина, лДопустимаяДлина);
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(КвалификаторыДвоичныхДанных);
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция Адапт_ОпределитьТипПоАтрибуту(СвойствоОбъекта) 
	
	Атрибуты = СвойствоОбъекта.Атрибуты;
	ТипСсылки = Адапт_НайтиЗначениеСвойстваВКоллекции(Атрибуты, "ЛокальноеИмя", "type");
	Если ТипСсылки <> Неопределено Тогда
		Атрибут = ТипСсылки.Значение; 
		ЧастиИмени = СтрРазделить(Атрибут, ":", Ложь);
		Если ЧастиИмени.Количество() > 1 Тогда
			ПрефиксПространстваИмен = ЧастиИмени[0];
			URIПространстваИмен = Адапт_НайтиПространствоИменВАтрибутах(ПрефиксПространстваИмен, Атрибуты);
			ИмяТипа = ЧастиИмени[1];
		Иначе
			URIПространстваИмен = "http://v8.1c.ru/8.1/data/enterprise/current-config";
			ИмяТипа = ЧастиИмени[0];
		КонецЕсли;

		Попытка
			ТипСвойства = ФабрикаXDTO.Тип(URIПространстваИмен, ИмяТипа);
			
			Возврат ТипСвойства;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

Функция Адапт_НайтиПространствоИменВАтрибутах(ПрефиксПространстваИмен, Атрибуты = Неопределено) 
	
	Если Не ЗначениеЗаполнено(ПрефиксПространстваИмен) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	URIПространстваИмен = мДокументDOM.НайтиURIПространстваИмен(ПрефиксПространстваИмен);
	
	Если URIПространстваИмен <> Неопределено Тогда
		Возврат URIПространстваИмен;
	КонецЕсли;
	
	Если Атрибуты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для каждого выбАтрибут Из Атрибуты Цикл
		Если выбАтрибут.ЛокальноеИмя = ПрефиксПространстваИмен Тогда
			URIПространстваИмен = выбАтрибут.Значение;
			Возврат URIПространстваИмен;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура Адапт_ДозаполнитьПустымиЗначениямиТипов(Куда, ПолноеИмяРодОбъекта, ОписанияТиповЭтойКонфигурации) 
	
	Если Адапт_ЭтоСправочник(ПолноеИмяРодОбъекта) Или Адапт_ЭтоПланВидовХарактеристик(ПолноеИмяРодОбъекта) Тогда
		ПроверятьПринадлежностьСвойств = Истина;
	Иначе
		ПроверятьПринадлежностьСвойств = Ложь;	
	КонецЕсли;

	ЭтоГруппа = Ложь;	
		
	Для каждого СвойствоОбъекта Из Куда.Свойства() Цикл
		ИмяСвойства = СвойствоОбъекта.Имя;
		ЗначениеСвойства = Куда[ИмяСвойства];
		Если ЗначениеСвойства <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяСвойства = "IsFolder" Тогда
			ЭтоГруппа = ЗначениеСвойства;
		КонецЕсли;
		
		Если ПроверятьПринадлежностьСвойств Тогда
			Принадлежность = Адапт_ПолучитьПринадлежностьСвойстваДляГруппыИлиЭлемента(ПолноеИмяРодОбъекта, ИмяСвойства);
			Если ЭтоГруппа = Истина И Принадлежность = "ДляЭлемента" Тогда
				Продолжить;
			ИначеЕсли ЭтоГруппа = Ложь И Принадлежность = "ДляГруппы" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяСвойства = "ValueType" Тогда
			
			ТипОбъектаXDTO_ОписаниеТипов = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "TypeDescription");
			ЗначениеXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO_ОписаниеТипов);
			Куда.Установить(СвойствоОбъекта, ЗначениеXDTO);
		ИначеЕсли ИмяСвойства = "Filter" Тогда
			
			ТипОбъектаXDTO_Фильтр = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/enterprise", "Filter");
			ЗначениеXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO_Фильтр);
			Куда.Установить(СвойствоОбъекта, ЗначениеXDTO);
		ИначеЕсли СвойствоОбъекта.Тип = Неопределено Тогда
			
			Куда[ИмяСвойства] = "";
		ИначеЕсли ИмяСвойства = "PredefinedDataName" Тогда
			Продолжить;
		Иначе
			
			ЗначениеXDTO = Адапт_ПустоеЗначениеТипаXDTO(СвойствоОбъекта.Тип);

			Куда[ИмяСвойства] = ЗначениеXDTO;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция Адапт_ПолучитьПринадлежностьСвойстваДляГруппыИлиЭлемента(ПолноеИмяОбъекта, ИмяСвойства) 
	
	Структура = Адапт_ПолучитьЧастиИмениОбъекта(ПолноеИмяОбъекта, Истина);
	ВидОбъекта = Структура.ВидОбъекта;
	ИмяОбъекта = Структура.ИмяОбъекта;
	
	Список = мОписанияТиповКонфигурации[ВидОбъекта];
	
	Принадлежность = Список[ИмяОбъекта].Реквизиты[ИмяСвойства].Использование;
	
	Возврат Принадлежность;
	
КонецФункции

Функция Адапт_ЕстьСвойство(Элемент, Свойство)
	
	Попытка
 		ЗначениеСвойства = Элемент[Свойство];
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

Функция Адапт_ПолучитьМодифицированностьОбъекта(ЗаписанноеЗначение, ОбъектМодифицирован)
	
	Попытка
		Возврат ЗаписанноеЗначение.Модифицированность();
	Исключение
		Возврат Истина;
	КонецПопытки;

КонецФункции

Функция Адапт_ТекстЗамераВремени(РазницаМиллисекунд) 
	
	СекундВсего = Цел(РазницаМиллисекунд /1000);
	
	Минут = Цел(СекундВсего / 60);
	Если Минут > 0 Тогда
		Склонения = ПолучитьСклоненияСтрокиПоЧислу("минута", Минут); 
		ТекстМинут = Склонения[0];
	Иначе
		ТекстМинут = "";
	КонецЕсли;
	
	Секунд = Цел(СекундВсего % 60);
	Если Секунд = 0 Тогда
		Секунд = 1;
	КонецЕсли;

	Склонения = ПолучитьСклоненияСтрокиПоЧислу("секунда", Секунд);
	ТекстСекунд = Склонения[0];
	
	ТекстСообщения = СтрШаблон("Время выполнения: %1 %2", ТекстМинут, ТекстСекунд);
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция Адапт_СоздатьОбновитьОбъект(ПолноеИмяОбъекта, НовыйОбъектXDTO, ГУИД) 
		
	ОбъектБазыДанных = Адапт_ПолучитьОбъектБД(ПолноеИмяОбъекта, НовыйОбъектXDTO, ГУИД);
	ЭтоНовый = ОбъектБазыДанных.ЭтоНовый();
	
	Для каждого Эл Из НовыйОбъектXDTO.Свойства() Цикл
		РеквизитМодифицирован = Ложь;
		
		ИмяРеквизитаXDTO = Эл.Имя;
		НовоеЗначение = НовыйОбъектXDTO[ИмяРеквизитаXDTO];
		НовТипЗначения = ТипЗнч(НовоеЗначение);
		
		ИмяРеквизита = Адапт_ПолучитьИмяРеквизитаОбъектаБДПоИмениXDTO(ОбъектБазыДанных, ИмяРеквизитаXDTO);
		ПредЗначение = ОбъектБазыДанных[ИмяРеквизита];
		
		ТабЧастьМодифицирована = Ложь;
		Если НовТипЗначения = Тип("СписокXDTO") Тогда
			
			Адапт_ЗаполнитьТабЧасть(ОбъектБазыДанных, НовоеЗначение, ПредЗначение, ТабЧастьМодифицирована);

			Продолжить;
		ИначеЕсли НовТипЗначения = Тип("ОбъектXDTO") Тогда
			
			НовоеЗначение = Сериализатор.ПрочитатьXDTO(НовоеЗначение);
			
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(ПредЗначение) И НовоеЗначение = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ТипЗнч(ПредЗначение) = Тип("ХранилищеЗначения") И НовТипЗначения = Тип("ХранилищеЗначения") Тогда
			Если ЭтоНовый Тогда
				Адапт_УстановитьРеквизитОбъектаБезопасно(ИмяРеквизита, НовоеЗначение, ОбъектБазыДанных);
				РеквизитМодифицирован = Истина;
			ИначеЕсли Адапт_КонтрольнаяСуммаСтрокой(ПредЗначение) <> Адапт_КонтрольнаяСуммаСтрокой(НовоеЗначение) Тогда
				Адапт_УстановитьРеквизитОбъектаБезопасно(ИмяРеквизита, НовоеЗначение, ОбъектБазыДанных);
				РеквизитМодифицирован = Истина;
			КонецЕсли;
			Продолжить;
			
		КонецЕсли;
		
		Если ПредЗначение <> НовоеЗначение Тогда
			Если Не ЭтоНовый И Адапт_НужноЗащититьПредопределенныйЭлемент(ИмяРеквизита) = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаБезВозвратовКаретки = СтрЗаменить(НовоеЗначение, Символы.ВК, "");
			Если ПредЗначение = СтрокаБезВозвратовКаретки Тогда
				Продолжить;
			КонецЕсли;
			
			Адапт_УстановитьРеквизитОбъектаБезопасно(ИмяРеквизита, НовоеЗначение, ОбъектБазыДанных);
			РеквизитМодифицирован = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбъектБазыДанных;
	
КонецФункции

// Создание объекта БД из ОбъектXDTO глючит для плана видов расчета, поэтому приходится делать это вручную 
Функция Адапт_ПолучитьОбъектБД(ИмяТипа, НовыйОбъектXDTO, ГУИД)
	
	СсылкаНаОбъект = НовыйОбъектXDTO.Ref;
	
	ПредставлениеСсылки = Строка(СсылкаНаОбъект);
	Если Лев(ПредставлениеСсылки, 18) = "<Объект не найден>" Или СсылкаНаОбъект.Пустая() Тогда
		Менеджер = Адапт_ПолучитьМенеджерПоИмени(ИмяТипа);
		Если Адапт_ЭтоДокумент(ИмяТипа) Тогда
			Результат = Менеджер.СоздатьДокумент();
		ИначеЕсли Адапт_ЭтоСправочник(ИмяТипа) Тогда
			Если Адапт_ЕстьСвойство(НовыйОбъектXDTO, "IsFolder") И НовыйОбъектXDTO.IsFolder = Истина Тогда 
				Результат = Менеджер.СоздатьГруппу();
			Иначе
				Результат = Менеджер.СоздатьЭлемент();
			КонецЕсли;
		ИначеЕсли Адапт_ЭтоПланВидовХарактеристик(ИмяТипа) Тогда
			Если Адапт_ЕстьСвойство(НовыйОбъектXDTO, "IsFolder") И НовыйОбъектXDTO.IsFolder = Истина Тогда 
				Результат = Менеджер.СоздатьГруппу();
			Иначе
				Результат = Менеджер.СоздатьЭлемент();
			КонецЕсли;
		ИначеЕсли Адапт_ЭтоПланСчетов(ИмяТипа) Тогда
			Результат = Менеджер.СоздатьСчет();
		ИначеЕсли Адапт_ЭтоПланВидовРасчета(ИмяТипа) Тогда
			Результат = Менеджер.СоздатьВидРасчета();
		ИначеЕсли Адапт_ЭтоБизнесПроцесс(ИмяТипа) Тогда
			Результат = Менеджер.СоздатьБизнесПроцесс();
		ИначеЕсли Адапт_ЭтоЗадача(ИмяТипа) Тогда
			Результат = Менеджер.СоздатьЗадачу();
		ИначеЕсли Адапт_ЭтоПланОбмена(ИмяТипа) Тогда
			Результат = Менеджер.СоздатьУзел();
		Иначе
			ВызватьИсключение("Не определен тип менеджера:" + ИмяТипа);
		КонецЕсли;
		
		Результат.УстановитьСсылкуНового(СсылкаНаОбъект);
		
		Возврат Результат;
	КонецЕсли;
	
	ОбъектБазыДанных = СсылкаНаОбъект.ПолучитьОбъект();
	Возврат ОбъектБазыДанных;

КонецФункции

Функция Адапт_ОбновитьКонстанту(ПолноеИмяОбъекта, НовыйОбъектXDTO, ОбъектМодифицирован) 
	
	ЧастиИмени = СтрРазделить(ПолноеИмяОбъекта, ".", Ложь);
	ИмяКонстанты = ЧастиИмени[1];
	КонстантаМенеджер = Константы[ИмяКонстанты].СоздатьМенеджерЗначения();
	
	КонстантаМенеджер.Прочитать();
	Если КонстантаМенеджер.Значение <> НовыйОбъектXDTO.value Тогда
		КонстантаМенеджер.Значение = НовыйОбъектXDTO.value;
		ОбъектМодифицирован = Истина;
	КонецЕсли;
	
	Возврат КонстантаМенеджер;
	
КонецФункции

Функция Адапт_СоздатьНаборЗаписейРегистра(ПолноеИмяОбъекта, НовыйОбъектXDTO) 
	
	МенеджерРегистра = Адапт_ПолучитьМенеджерПоИмени(ПолноеИмяОбъекта);
	
	НаборЗаписей = МенеджерРегистра.СоздатьНаборЗаписей();
	ПодчиненРегистратору = Адапт_ЕстьСвойство(НаборЗаписей.Отбор, "Регистратор");
	
	
	КоличествоЭлементовОтбора = 0;
	
	СписокЭлементовОтбораXDTO = НовыйОбъектXDTO.Filter.FilterItem;
	Для каждого СтрокаОтбора Из СписокЭлементовОтбораXDTO Цикл
		НаборЭлементОтбора = НаборЗаписей.Отбор[СтрокаОтбора.name];
		Если НаборЭлементОтбора = Неопределено Тогда
			ВызватьИсключение("Ошибка заполнения отбора набора записей:" + ПолноеИмяОбъекта);
		КонецЕсли;	
		НаборЭлементОтбора.Установить(СтрокаОтбора.value);
		КоличествоЭлементовОтбора = КоличествоЭлементовОтбора + 1;
	КонецЦикла;
	
	// В другой конфигурации могли измениться измерения, это может привести к очистке регистра. Сверяем количество.

	
	Если ПодчиненРегистратору = Ложь И СписокЭлементовОтбораXDTO.Количество() <> КоличествоЭлементовОтбора Тогда
		ВызватьИсключение("Ошибка заполнения отбора набора записей:" + ПолноеИмяОбъекта);	
	КонецЕсли;
	
	Для каждого выбЗапись Из НовыйОбъектXDTO.Record Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, выбЗапись);
		
		Адапт_ЗаполнитьСубконтоЗаписиНабораЗаписей(НоваяЗапись, выбЗапись);
	КонецЦикла;
	
	Возврат НаборЗаписей;
	
КонецФункции

Функция Адапт_НужноЗащититьПредопределенныйЭлемент(ИмяРеквизита)
	
	Если ИмяРеквизита = "PredefinedDataName" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура Адапт_УстановитьРеквизитОбъектаБезопасно(ИмяРеквизита, НовоеЗначение, ОбъектБазыДанных)
	
	Попытка
		ОбъектБазыДанных[ИмяРеквизита] = НовоеЗначение;
	Исключение
		Если ИмяРеквизита <> "Ref" Тогда
			ОписаниеОшибки = ОписаниеОшибки();
			СообщитьПользователю("" + ОбъектБазыДанных.Ссылка + "     Ошибка установки реквизита: " + ИмяРеквизита);
		КонецЕсли;
		
	КонецПопытки;

КонецПроцедуры

Функция Адапт_КонтрольнаяСуммаСтрокой(Знач Данные, Знач Алгоритм = Неопределено)
	
	Если Алгоритм = Неопределено Тогда
		Алгоритм = ХешФункция.MD5;
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(Алгоритм);
	Если ТипЗнч(Данные) <> Тип("Строка") И ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		Данные = Адапт_ЗначениеВСтрокуXML(Данные);
	КонецЕсли;
	ХешированиеДанных.Добавить(Данные);
	
	Если ТипЗнч(ХешированиеДанных.ХешСумма) = Тип("ДвоичныеДанные") Тогда 
		Результат = СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	ИначеЕсли ТипЗнч(ХешированиеДанных.ХешСумма) = Тип("Число") Тогда
		Результат = Формат(ХешированиеДанных.ХешСумма, "ЧГ=");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Адапт_ЗначениеВСтрокуXML(Значение)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция Адапт_ПолучитьИмяРеквизитаОбъектаБДПоИмениXDTO(ОбъектБазыДанных, ИмяРеквизитаXDTO) 
	
	Если Адапт_ЕстьСвойство(ОбъектБазыДанных, ИмяРеквизитаXDTO) Тогда
		Возврат ИмяРеквизитаXDTO;
	КонецЕсли;
	
	Если ИмяРеквизитаXDTO = "ExtDimensionType" Тогда
		Возврат "ExtDimensionTypes";
	ИначеЕсли ИмяРеквизитаXDTO = "BaseCalculationType" Тогда
		Возврат "BaseCalculationTypes";
	ИначеЕсли ИмяРеквизитаXDTO = "LeadingCalculationType" Тогда
		Возврат "LeadingCalculationTypes";
	ИначеЕсли ИмяРеквизитаXDTO = "DisplacingCalculationType" Тогда
		Возврат "DisplacingCalculationTypes";
	Иначе
		ВызватьИсключение("Не найден реквизит объекта: " + ИмяРеквизитаXDTO);
	КонецЕсли;
	
КонецФункции

Функция Адапт_ПреобразоватьИмяСтандартнойКоллекции(ОбъектКуда, ИмяКоллекции) 
	
	Если Адапт_ЕстьСвойство(ОбъектКуда, ИмяКоллекции) Тогда
		Возврат ИмяКоллекции;
	КонецЕсли;
	
	Если ИмяКоллекции = "ExtDimensionTypes" Тогда
		Возврат "ExtDimensionType";
	ИначеЕсли ИмяКоллекции = "BaseCalculationTypes" Тогда
		Возврат "BaseCalculationType";
	ИначеЕсли ИмяКоллекции = "LeadingCalculationTypes" Тогда
		Возврат "LeadingCalculationType";
	ИначеЕсли ИмяКоллекции = "DisplacingCalculationTypes" Тогда
		Возврат "DisplacingCalculationType";
	Иначе
		ВызватьИсключение("Не найдено имя стандартной коллекции объекта: " + ИмяКоллекции);
	КонецЕсли;
	
КонецФункции

Процедура Адапт_ЗаполнитьТабЧасть(ОбъектБазыДанных, СписокОткуда, ТабЧастьКуда, ТабЧастьМодифицирована)
	
	ЭтоНовый = ОбъектБазыДанных.ЭтоНовый();
	
	ПредКоличество = ТабЧастьКуда.Количество();
	НовКоличество = СписокОткуда.Количество();
	Если ПредКоличество <> НовКоличество Тогда
		ТабЧастьКуда.Очистить();	
		
		Для Сч = 0 По НовКоличество - 1 Цикл
			ТабЧастьКуда.Добавить();
		КонецЦикла;
		ТабЧастьМодифицирована = Истина;
	КонецЕсли;
	
	Для Сч = 0 По НовКоличество - 1 Цикл
		НовСтрокаТЧ = СписокОткуда[Сч];
		ПредСтрокаТЧ = ТабЧастьКуда[Сч];
		Для каждого выбКолонка Из НовСтрокаТЧ.Свойства() Цикл
			ИмяКолонки = выбКолонка.Имя;
			НовоеЗначение = НовСтрокаТЧ[ИмяКолонки];
			ПредЗначение = ПредСтрокаТЧ[ИмяКолонки];
			НовТипЗначения = ТипЗнч(НовоеЗначение);
			
			Если НовТипЗначения = Тип("ХранилищеЗначения") Тогда
				Если ЭтоНовый 
					Или Адапт_КонтрольнаяСуммаСтрокой(ПредСтрокаТЧ[ИмяКолонки]) <> Адапт_КонтрольнаяСуммаСтрокой(НовоеЗначение) Тогда
					
					Адапт_УстановитьРеквизитОбъектаБезопасно(ИмяКолонки, НовоеЗначение, ПредСтрокаТЧ);
					ТабЧастьМодифицирована = Истина;
				КонецЕсли;
				Продолжить;
				
			ИначеЕсли НовТипЗначения = Тип("ОбъектXDTO") Тогда // ОписаниеТипов

				НовоеЗначение = Сериализатор.ПрочитатьXDTO(НовоеЗначение);
				Адапт_УстановитьРеквизитОбъектаБезопасно(ИмяКолонки, НовоеЗначение, ПредСтрокаТЧ);
				ТабЧастьМодифицирована = Истина;
				Продолжить;
			КонецЕсли;
			
			Если ЭтоНовый 
				Или ПредЗначение <> НовоеЗначение Тогда
				
				СтрокаБезВозвратовКаретки = СтрЗаменить(НовоеЗначение, Символы.ВК, "");
				Если ПредЗначение = СтрокаБезВозвратовКаретки Тогда
					Продолжить;
				КонецЕсли;
				ПредСтрокаТЧ[ИмяКолонки] = НовоеЗначение;
				ТабЧастьМодифицирована = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Функция Адапт_ПолучитьИмяОбъекта(Знач выбОбъект)
	
	Если ЗначениеЗаполнено(выбОбъект.ЛокальноеИмя) Тогда
		ИмяОбъекта = выбОбъект.ЛокальноеИмя;
	Иначе
		ИмяОбъекта = выбОбъект.ИмяУзла;
		ЧастиИмени = СтрРазделить(ИмяОбъекта, ":", Ложь);
		ИмяОбъекта = ЧастиИмени[ЧастиИмени.ВГраница()];
	КонецЕсли;
	
	Возврат ИмяОбъекта;

КонецФункции

Процедура Адапт_ИнициализироватьСвойстваXDTOЭтойКонфигурации() 
	
	Если мВсеОбъектыКонфигурации <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеОбъектыКонфигурации = ФабрикаXDTO.ЭкспортМоделиXDTO("http://v8.1c.ru/8.1/data/enterprise/current-config").package[0].objectType;
	мВсеОбъектыКонфигурации = Новый ТаблицаЗначений;
	мВсеОбъектыКонфигурации.Колонки.Добавить("Наименование");
	мВсеОбъектыКонфигурации.Колонки.Добавить("ОбъектXDTO");
	мВсеОбъектыКонфигурации.Колонки.Добавить("СоответствиеСвойств");
	Для каждого Эл Из ВсеОбъектыКонфигурации Цикл
		НоваяСтрока = мВсеОбъектыКонфигурации.Добавить();
		НоваяСтрока.Наименование = Эл.name;
		НоваяСтрока.ОбъектXDTO = Эл;
		СоответствиеСвойств = Новый Соответствие;
		Для каждого выбСвойство Из Эл.property Цикл
			ИмяСвойства = выбСвойство.name;
			СоответствиеСвойств.Вставить(ИмяСвойства, выбСвойство);
			
			Если ИмяСвойства = "ExtDimensionType" Тогда
				СоответствиеСвойств.Вставить("ExtDimensionTypes", выбСвойство);
			КонецЕсли;
			
		КонецЦикла;
		НоваяСтрока.СоответствиеСвойств = СоответствиеСвойств;
	КонецЦикла;
	мВсеОбъектыКонфигурации.Индексы.Добавить("Наименование");
	
КонецПроцедуры

Процедура Адапт_СообщитьОбОшибкеБезПовторов(ТекстСообщения) 
	
	Если мОшибкиБезПовторов = Неопределено Тогда
		мОшибкиБезПовторов = Новый Соответствие;	
	КонецЕсли;
	
	Если мОшибкиБезПовторов[ТекстСообщения] = Неопределено Тогда
		Сообщить(ТекстСообщения);
		мОшибкиБезПовторов.Вставить(ТекстСообщения, "СообщениеВыведено");
	КонецЕсли;
	
КонецПроцедуры

Процедура Адапт_ИнициализироватьОписаниеТиповКонфигурации() 
	
	Если мОписанияТиповКонфигурации <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидыМетаданных = Адапт_ПолучитьВидыОбъектов();
	
	СоотвВидыОбъектов = Новый Соответствие;
	
	СоотвРусАнгл = Новый Соответствие;
	СоотвРусАнгл.Вставить("Ссылка",                    "Ref");
	СоотвРусАнгл.Вставить("Код",                       "Code");
	СоотвРусАнгл.Вставить("Наименование",              "Description");
	СоотвРусАнгл.Вставить("Владелец",                  "Owner");
	СоотвРусАнгл.Вставить("Родитель",                  "Parent");
	СоотвРусАнгл.Вставить("ЭтоГруппа",                 "IsFolder");
	СоотвРусАнгл.Вставить("ПометкаУдаления",           "DeletionMark");
	СоотвРусАнгл.Вставить("Предопределенный",          "Predefined");
	СоотвРусАнгл.Вставить("Предопределенное",          "Predefined");
	СоотвРусАнгл.Вставить("ИмяПредопределенныхДанных", "PredefinedDataName");
	СоотвРусАнгл.Вставить("Активность",                "Active");
	СоотвРусАнгл.Вставить("Проведен",                  "Posted");
	СоотвРусАнгл.Вставить("Дата",                      "Date");
	СоотвРусАнгл.Вставить("Номер",                     "Number");
	СоотвРусАнгл.Вставить("ТипЗначения",               "ValueType");
	СоотвРусАнгл.Вставить("Порядок",                   "Order");
	СоотвРусАнгл.Вставить("Забалансовый",              "OffBalance");
	СоотвРусАнгл.Вставить("Вид",                       "Type");
	СоотвРусАнгл.Вставить("ПериодДействияБазовый",     "ActionPeriodIsBasic");
	СоотвРусАнгл.Вставить("Период",                    "Period");
	СоотвРусАнгл.Вставить("НомерСтроки",               "LineNumber");
	СоотвРусАнгл.Вставить("Регистратор",               "Recorder");
	СоотвРусАнгл.Вставить("ВидДвижения",               "RecordType");
	СоотвРусАнгл.Вставить("Счет",                      "Account");
	СоотвРусАнгл.Вставить("Субконто1",                 "ExtDimension1");
	СоотвРусАнгл.Вставить("Субконто2",                 "ExtDimension2");
	СоотвРусАнгл.Вставить("Субконто3",                 "ExtDimension3");
	СоотвРусАнгл.Вставить("Субконто4",                 "ExtDimension4");
	СоотвРусАнгл.Вставить("ВидСубконто1",              "ExtDimensionType1");
	СоотвРусАнгл.Вставить("ВидСубконто2",              "ExtDimensionType2");
	СоотвРусАнгл.Вставить("ВидСубконто3",              "ExtDimensionType3");
	СоотвРусАнгл.Вставить("ВидСубконто4",              "ExtDimensionType4");
	СоотвРусАнгл.Вставить("ПериодРегистрации",         "RegistrationPeriod");
	СоотвРусАнгл.Вставить("Сторно",                    "ReversingEntry");
	СоотвРусАнгл.Вставить("ТолькоОбороты",             "TurnoversOnly");
	СоотвРусАнгл.Вставить("БазовыйПериодНачало",       "BegOfBasePeriod");
	СоотвРусАнгл.Вставить("БазовыйПериодКонец",        "EndOfBasePeriod");
	СоотвРусАнгл.Вставить("ПериодДействия",            "ActionPeriod");
	СоотвРусАнгл.Вставить("ПериодДействияНачало",      "BegOfActionPeriod");
	СоотвРусАнгл.Вставить("ПериодДействияКонец",       "EndOfActionPeriod");
	СоотвРусАнгл.Вставить("ВидРасчета",                "CalculationType");
	СоотвРусАнгл.Вставить("Стартован",                 "Started");
	СоотвРусАнгл.Вставить("Завершен",                  "Completed");
	СоотвРусАнгл.Вставить("ВедущаяЗадача",             "HeadTask");
	СоотвРусАнгл.Вставить("НомерПринятого",            "ReceivedNo");
	СоотвРусАнгл.Вставить("НомерОтправленного",        "SentNo");
	СоотвРусАнгл.Вставить("ЭтотУзел",                  "ThisNode");
	СоотвРусАнгл.Вставить("Выполнена",                 "Executed");
	СоотвРусАнгл.Вставить("ТочкаМаршрута",             "RoutePoint");
	СоотвРусАнгл.Вставить("БизнесПроцесс",             "BusinessProcess");
	
	
	
	
	
	ОбщиеРеквизиты = Адапт_ПолучитьСоответствиеОбщихРеквизитов();
	
	Тип = Новый ОписаниеТипов;
	ПустойКвалификаторСтроки = Тип.КвалификаторыСтроки;
	ПустойКвалификаторДаты = Тип.КвалификаторыДаты;
	ПустойКвалификаторЧисла = Тип.КвалификаторыЧисла;
	ПустойКвалификаторДвоичныхДанных = Тип.КвалификаторыДвоичныхДанных;
	
	Для каждого ВидМетаданных Из ВидыМетаданных Цикл
		выбВид = Метаданные[ВидМетаданных];
		СоотвОбъекты = Новый Соответствие;
		СоотвВидыОбъектов.Вставить(ВидМетаданных, СоотвОбъекты);
		
		Для каждого выбОбъект Из выбВид Цикл
			СоотвРеквизитыОбъекта = Новый Соответствие;
			СоотвТабчастиОбъекта = Новый Соответствие;
			РеквизитыТабчасти = Новый Структура("Реквизиты, ТабличныеЧасти", СоотвРеквизитыОбъекта, СоотвТабчастиОбъекта);
			
			СоотвОбъекты.Вставить(выбОбъект.Имя, РеквизитыТабчасти);
			
			Если ВидМетаданных = "Константы" Тогда
				СтруктураРеквизита = Адапт_СтруктураРеквизита("Value", Неопределено, выбОбъект.Тип);
				СоотвРеквизитыОбъекта.Вставить("Value", СтруктураРеквизита);
				Продолжить;
			КонецЕсли;
			
			
			Для каждого выбРеквизит Из выбОбъект.СтандартныеРеквизиты Цикл
				СтруктураРеквизита = Новый Структура();
				
				ИмяРеквизитаАнгл = СоотвРусАнгл[выбРеквизит.Имя];
				Если ИмяРеквизитаАнгл = Неопределено Тогда
					СообщитьПользователю("Не найден английский синоним: " + выбРеквизит.Имя);	
				КонецЕсли;
				
				СтруктураРеквизита.Вставить("Имя",           выбРеквизит.Имя);
				СтруктураРеквизита.Вставить("Использование", Неопределено);
				СтруктураРеквизита.Вставить("Тип",           выбРеквизит.Тип);
				
				СоотвРеквизитыОбъекта.Вставить(ИмяРеквизитаАнгл, СтруктураРеквизита);
			КонецЦикла;
			
			Для каждого КЗ Из ОбщиеРеквизиты Цикл
				ОбщРеквизит = КЗ.Ключ;
				Состав = КЗ.Значение;
				ЭлСостава = Состав[выбОбъект];
				
				Если ЭлСостава = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураРеквизита = Новый Структура();
				СтруктураРеквизита.Вставить("Имя",           ОбщРеквизит.Имя);
				СтруктураРеквизита.Вставить("Использование", Неопределено);
				СтруктураРеквизита.Вставить("Тип",           ОбщРеквизит.Тип);
				
				СоотвРеквизитыОбъекта.Вставить(ОбщРеквизит.Имя, СтруктураРеквизита);
			КонецЦикла;
			
			Для каждого выбРеквизит Из выбОбъект.Реквизиты Цикл
				Если ВидМетаданных = "Справочники" Или ВидМетаданных = "ПланыВидовХарактеристик" Тогда
					Использование = Строка(выбРеквизит.Использование);
				Иначе
					Использование = Неопределено;
				КонецЕсли;
				СтруктураРеквизита = Новый Структура();
				СтруктураРеквизита.Вставить("Имя",           выбРеквизит.Имя);
				СтруктураРеквизита.Вставить("Использование", Использование);
				СтруктураРеквизита.Вставить("Тип",           выбРеквизит.Тип);
				
				СоотвРеквизитыОбъекта.Вставить(выбРеквизит.Имя, СтруктураРеквизита);
			КонецЦикла;
			
			Если ВидМетаданных = "ПланыВидовХарактеристик" Тогда
				СтруктураРеквизита = Новый Структура();
				СтруктураРеквизита.Вставить("Имя",           выбРеквизит.Имя);
				СтруктураРеквизита.Вставить("Использование", Неопределено);
				СтруктураРеквизита.Вставить("Тип",           Тип("ОписаниеТипов"));
				СоотвРеквизитыОбъекта.Вставить("ValueType", СтруктураРеквизита);
				
			ИначеЕсли ВидМетаданных = "ПланыСчетов" Тогда
				Для каждого выбПризнак Из выбОбъект.ПризнакиУчета Цикл
					СтруктураРеквизита = Адапт_СтруктураРеквизита(выбПризнак.Имя, Неопределено, выбПризнак.Тип);
					СоотвРеквизитыОбъекта.Вставить(выбПризнак.Имя, СтруктураРеквизита);
				КонецЦикла;
				
				Для каждого выбПризнак Из выбОбъект.ПризнакиУчетаСубконто Цикл
					СтруктураРеквизита = Адапт_СтруктураРеквизита(выбПризнак.Имя, Неопределено, выбПризнак.Тип);
					СоотвРеквизитыОбъекта.Вставить(выбПризнак.Имя, СтруктураРеквизита);
				КонецЦикла;
				
				СтруктураРеквизита = Адапт_СтруктураРеквизита("TurnoversOnly", Неопределено, Новый ОписаниеТипов("Булево"));
				СоотвРеквизитыОбъекта.Вставить("TurnoversOnly", СтруктураРеквизита);
				
			ИначеЕсли ВидМетаданных = "РегистрыБухгалтерии" Тогда
				Для каждого выбИзмерение Из выбОбъект.Измерения Цикл
					
					Если выбИзмерение.ПризнакУчета = Неопределено Тогда
						СтруктураИзмерения = Новый Структура;
						СтруктураИзмерения.Вставить("Имя",      выбИзмерение.Имя);
						СтруктураИзмерения.Вставить("Тип",      выбИзмерение.Тип);
						СоотвРеквизитыОбъекта.Вставить(выбИзмерение.Имя, СтруктураИзмерения);
					Иначе
						СтруктураИзмерения = Новый Структура;
						СтруктураИзмерения.Вставить("Имя",      выбИзмерение.Имя + "Cr");
						СтруктураИзмерения.Вставить("Тип",      выбИзмерение.Тип);
						СоотвРеквизитыОбъекта.Вставить(выбИзмерение.Имя + "Cr", СтруктураИзмерения);
						СтруктураИзмерения = Новый Структура;
						СтруктураИзмерения.Вставить("Имя",      выбИзмерение.Имя + "Dr");
						СтруктураИзмерения.Вставить("Тип",      выбИзмерение.Тип);
						СоотвРеквизитыОбъекта.Вставить(выбИзмерение.Имя + "Dr", СтруктураИзмерения);
					КонецЕсли;
				КонецЦикла;
				
				Для каждого выбРесурс Из выбОбъект.Ресурсы Цикл
					Если выбРесурс.ПризнакУчета = Неопределено Тогда
						СтруктураРесурса = Новый Структура;
						СтруктураРесурса.Вставить("Имя",      выбРесурс.Имя);
						СтруктураРесурса.Вставить("Тип",      выбРесурс.Тип);
						СоотвРеквизитыОбъекта.Вставить(выбРесурс.Имя, СтруктураРесурса);
					Иначе
						СтруктураРесурса = Новый Структура;
						СтруктураРесурса.Вставить("Имя",      выбРесурс.Имя + "Cr");
						СтруктураРесурса.Вставить("Тип",      выбРесурс.Тип);
						СоотвРеквизитыОбъекта.Вставить(выбРесурс.Имя + "Cr", СтруктураРесурса);
						
						СтруктураРесурса = Новый Структура;
						СтруктураРесурса.Вставить("Имя",      выбРесурс.Имя + "Dr");
						СтруктураРесурса.Вставить("Тип",      выбРесурс.Тип);
						СоотвРеквизитыОбъекта.Вставить(выбРесурс.Имя + "Dr", СтруктураРесурса);
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ВидМетаданных = "РегистрыСведений"
				Или ВидМетаданных = "РегистрыНакопления"
				Или ВидМетаданных = "РегистрыРасчета" Тогда
				
				Для каждого выбИзмерение Из выбОбъект.Измерения Цикл
					СтруктураИзмерения = Новый Структура;
					СтруктураИзмерения.Вставить("Имя",      выбИзмерение.Имя);
					СтруктураИзмерения.Вставить("Тип",      выбИзмерение.Тип);
					СоотвРеквизитыОбъекта.Вставить(выбИзмерение.Имя, СтруктураИзмерения);
				КонецЦикла;
				Для каждого выбРесурс Из выбОбъект.Ресурсы Цикл
					СтруктураРесурса = Новый Структура;
					СтруктураРесурса.Вставить("Имя",        выбРесурс.Имя);
					СтруктураРесурса.Вставить("Тип",        выбРесурс.Тип);
					СоотвРеквизитыОбъекта.Вставить(выбРесурс.Имя, СтруктураРесурса);
				КонецЦикла;
			ИначеЕсли ВидМетаданных =  "ПланыВидовРасчета" Тогда

			КонецЕсли;
			
			Если Адапт_ЕстьСвойство(выбОбъект, "ТабличныеЧасти") Тогда
				Для каждого выбТабчасть Из выбОбъект.ТабличныеЧасти Цикл
					РеквизитыТабчасти = Новый Соответствие;
					СоотвТабчастиОбъекта.Вставить(выбТабчасть.Имя, РеквизитыТабчасти);
					
					Для каждого выбРеквизит Из выбТабчасть.СтандартныеРеквизиты Цикл
						СтруктураРеквизита = Адапт_СтруктураРеквизита(выбРеквизит.Имя, Неопределено, выбРеквизит.Тип);
						РеквизитыТабчасти.Вставить(выбРеквизит.Имя, СтруктураРеквизита);
					КонецЦикла;
					
					Для каждого выбРеквизит Из выбТабчасть.Реквизиты Цикл
						СтруктураРеквизита = Адапт_СтруктураРеквизита(выбРеквизит.Имя, Неопределено, выбРеквизит.Тип);
						РеквизитыТабчасти.Вставить(выбРеквизит.Имя, СтруктураРеквизита);
					КонецЦикла;
				КонецЦикла
			КонецЕсли;
			
			Если Адапт_ЕстьСвойство(выбОбъект, "СтандартныеТабличныеЧасти") Тогда
				Для каждого выбТабчасть Из выбОбъект.СтандартныеТабличныеЧасти Цикл
					РеквизитыТабчасти = Новый Соответствие;
					СоотвТабчастиОбъекта.Вставить(выбТабчасть.Имя, РеквизитыТабчасти);
					
					Для каждого выбРеквизит Из выбТабчасть.СтандартныеРеквизиты Цикл
						СтруктураРеквизита = Адапт_СтруктураРеквизита(выбРеквизит.Имя, Неопределено, выбРеквизит.Тип); 
						РеквизитыТабчасти.Вставить(выбРеквизит.Имя, СтруктураРеквизита);
					КонецЦикла;
					
				КонецЦикла
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	мОписанияТиповКонфигурации = СоотвВидыОбъектов;
	
КонецПроцедуры

Функция Адапт_СтруктураРеквизита(Имя, Использование, Тип) 
	
	СтруктураРеквизита = Новый Структура();
	СтруктураРеквизита.Вставить("Имя",           Имя);
	СтруктураРеквизита.Вставить("Использование", Использование);
	СтруктураРеквизита.Вставить("Тип",           Тип);
	
	Возврат СтруктураРеквизита;
	
КонецФункции

Функция Адапт_ПолучитьВидыОбъектов() 
	
	Массив = Новый Массив;
	Массив.Добавить("Константы");
	Массив.Добавить("Справочники");
	Массив.Добавить("Документы");
	Массив.Добавить("ПланыВидовХарактеристик");
	Массив.Добавить("ПланыСчетов");
	Массив.Добавить("ПланыВидовРасчета");
	Массив.Добавить("РегистрыСведений");
	Массив.Добавить("РегистрыНакопления");
	Массив.Добавить("РегистрыБухгалтерии");
	Массив.Добавить("РегистрыРасчета");
	Массив.Добавить("БизнесПроцессы");
	Массив.Добавить("Задачи");
	Массив.Добавить("ПланыОбмена");
	
	Возврат Массив;
	
КонецФункции

Функция Адапт_ПолучитьСоответствиеОбщихРеквизитов() 
	
	ОбщиеРеквизиты = Новый Соответствие;
	Авто = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто;
	Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
	АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать;
	
	Для каждого ОбщРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		Состав = ОбщРеквизит.Состав;
		
		Соотв = Новый Соответствие;
		ОбщиеРеквизиты.Вставить(ОбщРеквизит, Соотв);
		
		Для каждого ЭлСостава Из Состав Цикл
			Если ЭлСостава.Использование = Использование
					Или (ЭлСостава.Использование = Авто 
						И ОбщРеквизит.АвтоИспользование = АвтоИспользование)
					Тогда
					Соотв.Вставить(ЭлСостава.Метаданные, Истина);
			КонецЕсли;		
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат ОбщиеРеквизиты;
	
КонецФункции

Функция ПолучитьМенеджер(выбОбъект) 
	
	Возврат Вычислить("выбОбъект.Менеджер");	

КонецФункции

Функция Адапт_ПолучитьМенеджерПоИмени(ИмяТипа) 
	
	Структура = Адапт_ПолучитьЧастиИмениОбъекта(ИмяТипа, Истина);
	
	Попытка
		
		Результат = Вычислить(Структура.ВидОбъекта + "." + Структура.ИмяОбъекта);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	    Сообщить(НСтр("ru = '" + ОписаниеОшибки + "'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура Адапт_СообщитьПрогрессЗагрузки(КоличествоОбъектов, Сч, ТекстСообщения = "")
	
	Перем Квант, Процент;
	
	Если мЭтоФоновыйРежим = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		мДлительныеОперации.СообщитьПрогресс(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Квант = Окр(КоличествоОбъектов / 100);
	Если Квант = 0 Или Сч % Квант = 0 Тогда
		Процент = Окр(Сч / КоличествоОбъектов * 100);
		мДлительныеОперации.СообщитьПрогресс(Процент, "Загружено объектов: " + Сч + " из " + КоличествоОбъектов);	
	КонецЕсли;

КонецПроцедуры

Процедура Адапт_СообщитьПрогрессВыгрузки(Сч, КоличествоОбъектов, ТекстСообщения = "")
	
	Перем Квант, Процент;
	
	Если мЭтоФоновыйРежим = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		мДлительныеОперации.СообщитьПрогресс(, ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	Квант = Окр(КоличествоОбъектов / 100);
	Если Квант = 0 Или Сч % Квант = 0 Тогда
		Процент = Окр(Сч / КоличествоОбъектов * 100);
		мДлительныеОперации.СообщитьПрогресс(Процент, "Выгружено объектов: " + Сч + " из " + КоличествоОбъектов);	
	КонецЕсли;

КонецПроцедуры

Процедура Адапт_ИнициализироватьСоотвОбъектовМетаданныхДерева() 
	
	Если мСоотвОбъектовМетаданныхДерева <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мСоотвОбъектовМетаданныхДерева = Новый Соответствие;
	
	Строки = ДеревоМетаданных.Строки;
	
	Адапт_ЗаполнитьСоотвОбъектовМетаданныхДереваРекурсия(Строки);
	
КонецПроцедуры

Процедура Адапт_ЗаполнитьСоотвОбъектовМетаданныхДереваРекурсия(Строки) 
	
	Для каждого выбСтрока Из Строки Цикл
		мСоотвОбъектовМетаданныхДерева.Вставить(выбСтрока.ОбъектМД, выбСтрока);
		Подчиненные = выбСтрока.Строки;
		Если Подчиненные.Количество() > 0 Тогда
			Адапт_ЗаполнитьСоотвОбъектовМетаданныхДереваРекурсия(Подчиненные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция Адапт_ПодсчитатьКоличествоВыгружаемыхОбъектов()
	
	Если Ложь Тогда ДополнительныеОбъектыДляВыгрузки = Новый ТаблицаЗначений КонецЕсли;
	
	мПодсчитанныеОбъекты = Новый ТаблицаЗначений;
	мПодсчитанныеОбъекты.Колонки.Добавить("Ссылка");
	мПодсчитанныеОбъекты.Индексы.Добавить("Ссылка");
	
	
	Адапт_СообщитьПрогрессВыгрузки(,,"Подсчет количества объектов выгрузки...");
	
	Для Каждого СтрокаТаблицыВыгрузки Из СоставПолнойВыгрузки Цикл
		
		СтрокаДереваМетаданных = СтрокаТаблицыВыгрузки.СтрокаДерева;
		
		Если СтрокаДереваМетаданных.ЭлементОписания.Менеджер = Неопределено Тогда
			ВызватьИсключение(Нстр("ru = 'Выгрузка данных. Внутренняя ошибка'"));
		КонецЕсли;
		
		Если Метаданные.Константы.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
			
			Адапт_КонстантыПодсчетВыгружаемых(СтрокаДереваМетаданных.ОбъектМД);
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтрокаДереваМетаданных.ОбъектМД) Или
			Метаданные.РегистрыНакопления.Содержит(СтрокаДереваМетаданных.ОбъектМД) Или
			Метаданные.РегистрыРасчета.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
			
			Адапт_РегистрПодсчетВыгружаемых(СтрокаДереваМетаданных);
			
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
			
			Адапт_РегистрПодсчетВыгружаемых(СтрокаДереваМетаданных, Истина);
			
		ИначеЕсли ТипЗнч(СтрокаДереваМетаданных.ЭлементОписания.Менеджер) = Тип("Строка") Тогда

			Адапт_ПерерасчетыПодсчетВыгружаемых(СтрокаДереваМетаданных);
			
		ИначеЕсли Метаданные.Последовательности.Содержит(СтрокаДереваМетаданных.ОбъектМД) Тогда
			
			Адапт_ПоследовательностиПодсчетВыгружаемых(СтрокаДереваМетаданных);
			
		Иначе
			
			Адапт_ДанныеОбъектногоТипаПодсчетВыгружаемых(СтрокаДереваМетаданных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеОбъектыДляВыгрузки.Сортировать("ИмяОбъектаДляЗапроса");
	ТекущийМассивСсылок = Новый Массив();
	ТекущееИмяЗапроса = "";
	
	Для Каждого СтрокаТаблицыВыгрузки Из ДополнительныеОбъектыДляВыгрузки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыВыгрузки.Объект)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыВыгрузки.ИмяОбъектаДляЗапроса) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ТекущееИмяЗапроса <> СтрокаТаблицыВыгрузки.ИмяОбъектаДляЗапроса Тогда
			
			Адапт_ДанныеМассиваСсылокПодсчетВыгружаемых();
			
			ТекущийМассивСсылок = Новый массив();
			ТекущееИмяЗапроса = СтрокаТаблицыВыгрузки.ИмяОбъектаДляЗапроса;
			
		КонецЕсли;
		
		ТекущийМассивСсылок.Добавить(СтрокаТаблицыВыгрузки.Объект);
		
	КонецЦикла;
	
	Адапт_ДанныеМассиваСсылокПодсчетВыгружаемых();
	
	Возврат мПодсчитанныеОбъекты.Количество();
	
	
КонецФункции

Процедура Адапт_КонстантыПодсчетВыгружаемых(МД_Константа) 
	
	МенеджерЗначения = Константы[МД_Константа.Имя].СоздатьМенеджерЗначения();
	МенеджерЗначения.Прочитать();
	Адапт_ПодсчитатьЗначениеПриНеобходимости(МенеджерЗначения.Значение);
	
КонецПроцедуры

Процедура Адапт_ПодсчитатьСсылкиНабораЗаписей(МенеджерНабораЗаписей, ДляЗапроса, ИмяОбъекта, СтрокаДереваМетаданных = Неопределено, РегистрБухгалтерии = Ложь)
	
	// получить состав колонок записи регистра и проверить наличие хотя бы одной записи
	Если ДляЗапроса = "РегистрБухгалтерии." Тогда
		ИмяТаблицыДляЗапроса = ДляЗапроса + ИмяОбъекта + ".ДвиженияССубконто";	
	Иначе
		ИмяТаблицыДляЗапроса = ДляЗапроса + ИмяОбъекта;	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ " + ИмяТаблицыДляЗапроса + " КАК ТаблицаОбъекта_" + ИмяОбъекта);
	
	РезультатЗапросаПоСоставу = Запрос.Выполнить();
	Если РезультатЗапросаПоСоставу.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДвижений = РезультатЗапросаПоСоставу.Выгрузить();
	МассивКолонок = ПолучитьМассивКолонокДвижения(ТаблицаДвижений, РегистрБухгалтерии);
	
	// выгрузка регистров осуществляется через его набор записей
	НаборЗаписей = МенеджерНабораЗаписей.СоздатьНаборЗаписей();
	
	Отбор = НаборЗаписей.Отбор;
	
	ЕстьРегистратор = Ложь;
	МассивИмен = Новый Массив;
	Для каждого выбКолонка Из МассивКолонок Цикл
		//для регистров, подчиненных регистратору, может быть отбор только по регистратору
		Если выбКолонка = "Регистратор" Тогда 
			МассивИмен.Очистить();
			МассивИмен.Добавить("Регистратор");
			ЕстьРегистратор = Истина;
			Прервать;
		КонецЕсли;
		Если СтрНайти(выбКолонка, "Субконто") = 1 Тогда
			Продолжить;
		КонецЕсли;
		МассивИмен.Добавить(выбКолонка);
	КонецЦикла;
	
	Если ЕстьРегистратор Тогда
		СтрокаПолейОтбора = "Регистратор";
	Иначе		
		СтрокаПолейОтбора = СтрСоединить(МассивИмен, ",");
	КонецЕсли;
	
	КолонкиОтбора = Адапт_ПолучитьКолонкиОтбора(Отбор);
	
	
	ПостроительОтчета = ПодготовитьПостроительДляВыгрузки(СтрокаДереваМетаданных, СтрокаПолейОтбора); 
	ПостроительОтчета.Выполнить();
	РезультатЗапросаПоЗначениямОтбора = ПостроительОтчета.Результат;	
	ВыборкаИзРезультата = РезультатЗапросаПоЗначениямОтбора.Выбрать();
	
	КоличествоПолейОтбора = Отбор.Количество();
	
	// читаем наборы записей с различным составом отбора и записываем их
	Пока ВыборкаИзРезультата.Следующий() Цикл
		
		// Отбор устанавливаем для регистров, у которых есть хотя бы один отбор (измерение)
		
		// для регистров подчиненных регистратору, отбор только по регистратору
		
		Если ЕстьРегистратор Тогда
			Отбор.Регистратор.Установить(ВыборкаИзРезультата["Регистратор"]);
		ИначеЕсли КоличествоПолейОтбора <> 0 Тогда
		
			Для Каждого Колонка Из РезультатЗапросаПоЗначениямОтбора.Колонки Цикл
				Если Адапт_ЕстьСвойство(Отбор, Колонка.Имя) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				Отбор[Колонка.Имя].Значение = ВыборкаИзРезультата[Колонка.Имя];
				Отбор[Колонка.Имя].ВидСравнения = ВидСравнения.Равно;
				Отбор[Колонка.Имя].Использование = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
		НаборЗаписей.Прочитать();
		
		
		Если мНаличиеВыгрузкиПодчиненныхОбъектов Тогда
		
			// проверяем все записанные в наборе значения на необходимость записи "по ссылке"
			//ВыгрузитьПодчиненныеЗначенияНабора(ЗаписьXML, НаборЗаписей, МассивКолонок, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
			Адапт_ПодсчитатьПодчиненныеЗначенияНабора(НаборЗаписей, МассивКолонок);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Адапт_РегистрПодсчетВыгружаемых(СтрокаДереваМетаданных, ЭтоРегистрБухгалтерии = Ложь) 
	
	МенеджерНабораЗаписей = СтрокаДереваМетаданных.ЭлементОписания.Менеджер[СтрокаДереваМетаданных.ОбъектМД.Имя];
	
	ИмяТаблицыДляЗапроса = СтрокаДереваМетаданных.ЭлементОписания.ДляЗапроса;
		
	//ЗаписьЧерезНаборЗаписей(ЗаписьXML, МенеджерНабораЗаписей, ИмяТаблицыДляЗапроса, 
		//СтрокаДереваМетаданных.ОбъектМД.Имя, СтрокаДереваМетаданных, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов, РегистрБухгалтерии);
	
	Адапт_ПодсчитатьСсылкиНабораЗаписей(
		МенеджерНабораЗаписей, 
		ИмяТаблицыДляЗапроса, 
		СтрокаДереваМетаданных.ОбъектМД.Имя, 
		СтрокаДереваМетаданных, 
		ЭтоРегистрБухгалтерии);	
		
КонецПроцедуры

Процедура Адапт_ПерерасчетыПодсчетВыгружаемых(СтрокаДереваМетаданных) 
	
	ИмяРегистраРасчета = СтрокаДереваМетаданных.Родитель.Родитель.ОбъектМД.Имя;
	МенеджерСтрокой = СтрЗаменить(СтрокаДереваМетаданных.ЭлементОписания.Менеджер, "%i", ИмяРегистраРасчета);
	МенеджерПерерасчета = Вычислить(МенеджерСтрокой);
	МенеджерПерерасчета = МенеджерПерерасчета[СтрокаДереваМетаданных.ОбъектМД.Имя];
	СтрокаДляЗапроса = СтрЗаменить(СтрокаДереваМетаданных.ЭлементОписания.ДляЗапроса, "%i", ИмяРегистраРасчета);
	
	Адапт_ПодсчитатьСсылкиНабораЗаписей(МенеджерПерерасчета, СтрокаДляЗапроса, СтрокаДереваМетаданных.ОбъектМД.Имя, СтрокаДереваМетаданных);
	
	
КонецПроцедуры

Процедура Адапт_ПоследовательностиПодсчетВыгружаемых(СтрокаДереваМетаданных) 
	
	МенеджерНабораЗаписей = СтрокаДереваМетаданных.ЭлементОписания.Менеджер[СтрокаДереваМетаданных.ОбъектМД.Имя];
	
	Адапт_ПодсчитатьСсылкиНабораЗаписей(МенеджерНабораЗаписей, СтрокаДереваМетаданных.ЭлементОписания.ДляЗапроса,
		СтрокаДереваМетаданных.ОбъектМД.Имя, СтрокаДереваМетаданных);
	
КонецПроцедуры

Процедура Адапт_ДанныеОбъектногоТипаПодсчетВыгружаемых(СтрокаДереваМетаданных) 
	
	РезультатЗапроса = ПолучитьРезультатЗапросаСОграничениями(СтрокаДереваМетаданных);
	
	//было:
	//ЗапросИЗапись(РезультатЗапроса, ЗаписьXML, Истина, ОбъектыВыгруженныеСОшибками, ТолькоПроверкаНедопустимыхСимволов);
	//	ОбработкаРезультатаЗапроса();
	
	//стало:
	Адапт_ПодсчетРезультатаЗапроса(РезультатЗапроса, Истина, Истина);
	
КонецПроцедуры

Функция Адапт_СсылкаПодсчитана(Ссылка)
	
	Возврат мПодсчитанныеОбъекты.Найти(Ссылка, "Ссылка") <> Неопределено;
	
КонецФункции

Процедура Адапт_ДобавитьСсылкуКПодсчитанным(Ссылка)
	
	СтрокаДобавления = мПодсчитанныеОбъекты.Добавить();
	СтрокаДобавления.Ссылка = Ссылка;
	
КонецПроцедуры

Процедура Адапт_ПодсчитатьЗначениеПриНеобходимости(АнализируемоеЗначение)
	
	Если Не ЗначениеЗаполнено(АнализируемоеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМД = СсылочныеТипы.Получить(ТипЗнч(АнализируемоеЗначение));
	
	Если ОбъектМД = Неопределено Тогда
		Возврат; // это не ссылка
	КонецЕсли;
			
	Если Адапт_СсылкаПодсчитана(АнализируемоеЗначение) Тогда
		Возврат; // объект уже был выгружен
	КонецЕсли;
	
	// Проверка того, что данный тип входит в список выгружаемых дополнительно
	СтрокаТаблицы = СоставПолнойВыгрузки.Найти(ОбъектМД, "ОбъектМД");
	Если СтрокаТаблицы <> Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	СтрокаТаблицы = СоставВспомогательнойВыгрузки.Найти(ОбъектМД, "ОбъектМД");
	Если СтрокаТаблицы <> Неопределено Тогда
		
		ДопЗапрос = Новый Запрос("ВЫБРАТЬ * ИЗ " + СтрокаТаблицы.СтрокаДерева.ЭлементОписания.ДляЗапроса + ОбъектМД.Имя +
			" КАК ТаблицаОбъекта_" + " ГДЕ Ссылка = &Ссылка");				
		ДопЗапрос.УстановитьПараметр("Ссылка", АнализируемоеЗначение);
		РезультатЗапроса = ДопЗапрос.Выполнить();
		
		Адапт_ПодсчетРезультатаЗапроса(РезультатЗапроса, Ложь, Истина);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура Адапт_ПодсчитатьПодчиненныеЗначенияНабора(Движение, МассивКолонок)
		
	Для Каждого ЗаписьИзНабора Из Движение Цикл
								
		Для Каждого Колонка Из МассивКолонок Цикл
			
			Если Колонка = "СубконтоДт"
				ИЛИ Колонка = "СубконтоКт" Тогда
				
				Значение = ЗаписьИзНабора[Колонка];
				Для Каждого КлючИЗначение Из Значение Цикл
					
					Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
						Адапт_ПодсчитатьЗначениеПриНеобходимости(КлючИЗначение.Значение);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
			
				СохраненноеЗначение = ЗаписьИзНабора[Колонка];
				Адапт_ПодсчитатьЗначениеПриНеобходимости(СохраненноеЗначение);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Адапт_ПодсчетРезультатаЗапроса(РезультатЗапроса, ВерхнийУровень = Ложь, ЭтоЗапросПоОбъекту = Ложь) 
	
	ВыборкаИзРезультатовЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаИзРезультатовЗапроса.Следующий() Цикл
		
		Если ЭтоЗапросПоОбъекту Тогда
			
			// выгрузка ссылочных объектов
			Ссылка = ВыборкаИзРезультатовЗапроса.Ссылка;
			Если Адапт_СсылкаПодсчитана(Ссылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Адапт_ДобавитьСсылкуКПодсчитанным(Ссылка);
			
		КонецЕсли;
		
		Если мНаличиеВыгрузкиПодчиненныхОбъектов Тогда
		
			// перебираем колонки запроса в поисках ссылочных значений, которые, возможно, нужно выгрузить
			Для Каждого КолонкаЗапроса Из РезультатЗапроса.Колонки Цикл
				
				ЗначениеКолонки = ВыборкаИзРезультатовЗапроса[КолонкаЗапроса.Имя];
				
				Если ТипЗнч(ЗначениеКолонки) = мТипРезультатЗапроса Тогда
					
					Адапт_ПодсчетРезультатаЗапроса(ЗначениеКолонки);
					
				Иначе
				
					Адапт_ПодсчитатьЗначениеПриНеобходимости(ЗначениеКолонки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЭтоЗапросПоОбъекту Тогда
			
			Объект = Ссылка.ПолучитьОбъект();
			
			Попытка
				
				//ВыполнитьВспомогательныеДействияДляЗаписиXML(ВсегоОбработаноОбъектов, ЗаписьXML, ТолькоПроверкаНедопустимыхСимволов);
				
				//Сериализатор.ЗаписатьXML(ЗаписьXML, Объект);
				
				МетаданныеОбъекта = Объект.Метаданные();
				
				//Если ЭтоМетаданныеСПредопределеннымиЭлементами(МетаданныеОбъекта) И Объект.Предопределенный Тогда
				//	
				//	НоваяСтрока = ТаблицаПредопределенных.Добавить();
				//	НоваяСтрока.ИмяТаблицы = МетаданныеОбъекта.ПолноеИмя();
				//	НоваяСтрока.Ссылка = XMLСтрока(Ссылка);
				//	НоваяСтрока.ИмяПредопределенныхДанных = Объект.ИмяПредопределенныхДанных;
				//	
				//КонецЕсли;
				
				Если ВыгружатьСДокументомЕгоДвижения И Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
					
					// выгрузка движений документа
					Для Каждого Движение Из Объект.Движения Цикл
						
						Движение.Прочитать();
						
						Если мНаличиеВыгрузкиПодчиненныхОбъектов
							И Движение.Количество() > 0 Тогда
							
							ТипРегистра = Тип(Движение);
							
							МассивКолонок = мСоответствиеКолонокДвижений.Получить(ТипРегистра);
							
							Если МассивКолонок = Неопределено Тогда
								
								ТаблицаДвижений = Движение.Выгрузить();
								РегистрБухгалтерии = Метаданные.РегистрыБухгалтерии.Содержит(Движение.Метаданные());
								МассивКолонок = ПолучитьМассивКолонокДвижения(ТаблицаДвижений, РегистрБухгалтерии);
								мСоответствиеКолонокДвижений.Вставить(ТипРегистра, МассивКолонок);	
								
							КонецЕсли;
							
							Адапт_ПодсчитатьПодчиненныеЗначенияНабора(Движение, МассивКолонок);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Исключение
				
				СтрокаОписанияОшибки = ОписаниеОшибки();
				Сообщить("Ошибка подсчета выгружаемых ссылок: " + СтрокаОписанияОшибки);
					
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Адапт_ДанныеМассиваСсылокПодсчетВыгружаемых() 
	
	
	
КонецПроцедуры

Функция Адапт_ОбщийМодуль(ИмяМодуля) 
	
	Попытка
		Возврат Вычислить(ИмяМодуля);
	Исключение
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

Функция Адапт_ЭтоПростойТипXDTO(Тип) 
	
	ИмяТипа = Тип.Имя;
	URIПространстваИмен = Тип.URIПространстваИмен;

	Если URIПространстваИмен = "http://www.w3.org/2001/XMLSchema" Тогда
		Если ИмяТипа = "string" Или ИмяТипа = "digital" Или ИмяТипа = "datetime" Или ИмяТипа = "boolean" Или ИмяТипа = "binarydata" Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти



ПриЗагрузкеИспользоватьРежимОбменаДанными = Истина;
ПродолжитьЗагрузкуВСлучаеВозникновенияОшибки = Ложь;
ИспользоватьОтборПоДатеДляВсехОбъектов = Истина;
мНаличиеВыгрузкиПодчиненныхОбъектов = Ложь;
мКоличествоСохраненныхПоследнихВыгрузок = 50;

мТипРезультатЗапроса = Тип("РезультатЗапроса");
мТипДанныхУдаления = Тип("УдалениеОбъекта");

мСоответствиеКолонокДвижений = Новый Соответствие;
ОбработанныхКонстант = 0;
ОбработанныхНаборовЗаписей = 0;

#КонецЕсли