//&Перед("ПередЗаписью")
//Процедура AVS_ПередЗаписью_Состав(Отказ, Замещение)
//	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
//	
//	Попытка
//		СписокКатегорий = Новый Соответствие;
//		Для Каждого ЭлементОтбора Из Отбор Цикл
//			Если ВРег(ЭлементОтбора.Имя) = "КАТЕГОРИЯ" И ЭлементОтбора.Использование Тогда
//				СписокКатегорий.Вставить(ЭлементОтбора.Значение, Истина);
//			КонецЕсли;
//		КонецЦикла;
//		Для Каждого Запись Из ЭтотОбъект Цикл
//			Если ЗначениеЗаполнено(Запись.Категория) Тогда СписокКатегорий.Вставить(Запись.Категория, Истина); КонецЕсли;
//		КонецЦикла;

//		Для Каждого Кв Из СписокКатегорий Цикл
//			AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(Кв.Ключ, "UPDATE");
//		КонецЦикла;
//	Исключение
//	КонецПопытки;
//КонецПроцедуры