
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВерсиюИРежимСовместимостиПлатформы();
	
	РежимРаботыНаКлиенте = (РежимРаботыНаКлиентеИлиНаСервере = 0);
	
	Элементы.ИмяФайлаВыгрузки.Доступность = Не РежимРаботыНаКлиенте;
	Элементы.ИмяФайлаЗагрузки.Доступность = Не РежимРаботыНаКлиенте;
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.Инициализация();
	ЗначениеВРеквизитФормы(ОбъектНаСервере.ДеревоМетаданных, "Объект.ДеревоМетаданных");
	
	Файл = Новый Файл(ИмяФайлаВыгрузки);
	
	РежимВыгрузки = (Элементы.ГруппаРежим.ТекущаяСтраница = Элементы.ГруппаРежим.ПодчиненныеЭлементы.ГруппаВыгрузка);
	
	//+ Muraviev Sergey 2023.12.08
	Адапт_УстановитьПредохранительЗагрузкиНаРабочейБазе();
	Адапт_ИнициализироватьНастройкиВыгрузкиЗагрузки();
	//- Muraviev Sergey 2023.12.08
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РежимРаботыНаКлиенте = (РежимРаботыНаКлиентеИлиНаСервере = 0);
	
	Элементы.ИмяФайлаВыгрузки.Доступность = Не РежимРаботыНаКлиенте;
	Элементы.ИмяФайлаЗагрузки.Доступность = Не РежимРаботыНаКлиенте;
	
	Файл = Новый Файл(ИмяФайлаВыгрузки);
	
	РежимВыгрузки = (Элементы.ГруппаРежим.ТекущаяСтраница = Элементы.ГруппаРежим.ПодчиненныеЭлементы.ГруппаВыгрузка);
	
	//+ Muraviev Sergey 2024.01.28
	Если Адапт_ВозможнаЗагрузкаВыгрузкаВФоновомРежиме() = Ложь Тогда
		ВыгружатьВФоновомРежиме = Ложь;
		ЗагружатьВФоновомРежиме = Ложь;
	КонецЕсли;
	//- Muraviev Sergey 2024.01.28
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытаФормаНастройкиКонсолиЗапросов" Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьВПриложении(Элемент, "ИмяФайлаВыгрузки", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРежимПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	РежимВыгрузки = (Элементы.ГруппаРежим.ТекущаяСтраница = Элементы.ГруппаРежим.ПодчиненныеЭлементы.ГруппаВыгрузка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеОбъектыДляВыгрузкиПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Объект) Тогда
		
		Элемент.ТекущиеДанные.ИмяОбъектаДляЗапроса = ИмяОбъектаПоТипуДляЗапроса(Элемент.ТекущиеДанные.Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьВПриложении(Элемент, "ИмяФайлаЗагрузки", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоМетаданных

&НаКлиенте
Процедура ДеревоМетаданныхВыгружатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоМетаданных.ТекущиеДанные;
	
	Если ТекущиеДанные.Выгружать = 2 Тогда
		ТекущиеДанные.Выгружать = 0;
	КонецЕсли;
	
	УстановитьПометкиПодчиненных(ТекущиеДанные, "Выгружать");
	УстановитьПометкиРодителей(ТекущиеДанные, "Выгружать");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхВыгружатьПриНеобходимостиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоМетаданных.ТекущиеДанные;
	
	Если ТекущиеДанные.ВыгружатьПриНеобходимости = 2 Тогда
		ТекущиеДанные.ВыгружатьПриНеобходимости = 0;
	КонецЕсли;
	
	УстановитьПометкиПодчиненных(ТекущиеДанные, "ВыгружатьПриНеобходимости");
	УстановитьПометкиРодителей(ТекущиеДанные, "ВыгружатьПриНеобходимости");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеОбъектыДляВыгрузки

&НаКлиенте
Процедура ДополнительныеОбъектыДляВыгрузкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Элемент.ТекущийЭлемент.ОграничениеТипа = ТипОбъектовДляВыгрузки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИзЗапроса(Команда)
	
	ОткрытьФорму(ИмяФормыКонсолиЗапросов(),ПараметрыКонсолиЗапросов(),ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДополнительныеОбъектыВыгрузки(Команда)
	
	Объект.ДополнительныеОбъектыДляВыгрузки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Объект.ДатаНачала = ПериодВыгрузки.ДатаНачала;
	Объект.ДатаОкончания = ПериодВыгрузки.ДатаОкончания;
	
	ОчиститьСообщения();
	
	Если Не РежимРаботыНаКлиенте Тогда
		
		Если ПустаяСтрока(ИмяФайлаВыгрузки) Тогда
			
			ТекстСообщения = Нстр("ru = 'Поле ""Имя файла"" не заполнено'");
			СообщитьПользователю(ТекстСообщения, "ИмяФайлаВыгрузки");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	//+ Muraviev Sergey 2024.01.02

	Если ВыгружатьВФоновомРежиме Тогда
		
		Адапт_ВыгрузитьДанныеВФоновомРежиме();
		
	Иначе
		
		Состояние(Нстр("ru = 'Выполняется выгрузка данных. Пожалуйста, подождите...'"));
		
		АдресФайлаВоВременномХранилище = "";
		
		ВыгрузитьДанныеНаСервере(АдресФайлаВоВременномХранилище);
		
		
		Если РежимРаботыНаКлиенте И Не ПустаяСтрока(АдресФайлаВоВременномХранилище) Тогда
			
			ИмяФайла = "Файл выгрузки.xml";
			ПолучитьФайл(АдресФайлаВоВременномХранилище, ИмяФайла);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ОчиститьСообщения();
	АдресФайлаВоВременномХранилище = "";
	
	
	Если РежимРаботыНаКлиенте Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеФайлПомещен", ЭтотОбъект);
		//Нстр("ru = 'Файл выгрузки'")
		НачатьПомещениеФайла(ОписаниеОповещения, АдресФайлаВоВременномХранилище,,, УникальныйИдентификатор);
		
	Иначе
		
		Если ПустаяСтрока(ИмяФайлаЗагрузки) Тогда
			
			ТекстСообщения = Нстр("ru = 'Поле ""Имя файла"" не заполнено'");
			СообщитьПользователю(ТекстСообщения, "ИмяФайлаЗагрузки");
			Возврат;
			
		КонецЕсли;
		
		ЗагрузитьДанныеФайлПомещен(Истина, АдресФайлаВоВременномХранилище, ИмяФайлаЗагрузки, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКонсолиЗапросов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВариантИспользованияКонсолиЗапросов", ВариантИспользованияКонсолиЗапросов);
	ПараметрыФормы.Вставить("ПутьКВнешнейКонсолиЗапросов", ПутьКВнешнейКонсолиЗапросов);
	
	ОткрытьФорму(ИмяФормыНастроекКонсолиЗапросов(), ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВыгружаемыеПоСсылке(Команда)
	
	Состояние(Нстр("ru = 'Выполняется поиск объектов метаданных, которые могут быть выгружены по ссылкам...'"));
	СохранитьОтображениеДерева(Объект.ДеревоМетаданных.ПолучитьЭлементы());
	
	ПересчитатьВыгружаемыеПоСсылкеНаСервере();
	
	ВосстановитьОтображениеДерева(Объект.ДеревоМетаданных.ПолучитьЭлементы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИмяФормыКонсолиЗапросов()
	
	Если ВариантИспользованияКонсолиЗапросов = 0 Тогда
		
		Обработка = РеквизитФормыВЗначение("Объект");
		ИдентификаторФормы = ".Форма.ВыборИзЗапроса";
		
	ИначеЕсли ВариантИспользованияКонсолиЗапросов = 1 Тогда
		
		Обработка = Обработки["КонсольЗапросов"].Создать();
		ИдентификаторФормы = ".Форма";
		
	Иначе //ВариантИспользованияКонсолиЗапросов = 2
		
		Обработка = ВнешниеОбработки.Создать(ПутьКВнешнейКонсолиЗапросов);
		ИдентификаторФормы = ".ФормаОбъекта";
		
	КонецЕсли;
	
	Возврат Обработка.Метаданные().ПолноеИмя() + ИдентификаторФормы;
	
КонецФункции

&НаСервере
Функция ИмяФормыНастроекКонсолиЗапросов()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ИмяФормыНастроек = Обработка.Метаданные().ПолноеИмя() + ".Форма.НастройкиКонсолиЗапросов";
	
	Возврат ИмяФормыНастроек;
	
КонецФункции

&НаКлиенте
Функция ПараметрыКонсолиЗапросов()
	
	ПараметрыФормы = Новый Структура;
	
	Если ВариантИспользованияКонсолиЗапросов = 0 Тогда
		
		ПараметрыФормы.Вставить("ВариантИспользованияКонсолиЗапросов", ВариантИспользованияКонсолиЗапросов);
		ПараметрыФормы.Вставить("ПутьКВнешнейКонсолиЗапросов", ПутьКВнешнейКонсолиЗапросов);
		
	Иначе
		
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Выбор данных для выгрузки'"));
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВПриложении(Элемент, ПутьКДанным, СтандартнаяОбработка)

	Файл = Новый Файл(Элемент.ТекстРедактирования);
	
	Если Файл.Существует() Тогда
		
		ЗапуститьПриложение(Элемент.ТекстРедактирования);
		
	Иначе
		
		СообщитьПользователю(Нстр("ru = 'Файл не найден'"), ПутьКДанным);
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРежимаРаботы()
	
	РежимРаботыНаКлиенте = (РежимРаботыНаКлиентеИлиНаСервере = 0);
	
	Элементы.ИмяФайлаВыгрузки.Доступность = Не РежимРаботыНаКлиенте;
	Элементы.ИмяФайлаЗагрузки.Доступность = Не РежимРаботыНаКлиенте;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РежимДиалога = ?(РежимВыгрузки, РежимДиалогаВыбораФайла.Сохранение, РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Не РежимВыгрузки;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Задайте имя файла выгрузки'");
	ДиалогВыбораФайла.ПолноеИмяФайла = ?(РежимВыгрузки, ИмяФайлаВыгрузки, ИмяФайлаЗагрузки);
	
	ДиалогВыбораФайла.Фильтр = "Формат выгрузки(*.xml)|*.xml|FastInfoSet (*.fi)|*.fi|Все файлы (*.*)|*.*";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Если РежимВыгрузки Тогда
			ИмяФайлаВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
		Иначе
			ИмяФайлаЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекСтрока, ИмяФлажка)
	
	Подчиненные = ТекСтрока.ПолучитьЭлементы();
	
	Если Подчиненные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка из Подчиненные Цикл
		
		Строка[ИмяФлажка] = ТекСтрока[ИмяФлажка];
		
		УстановитьПометкиПодчиненных(Строка, ИмяФлажка);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекСтрока, ИмяФлажка)
	
	Родитель = ТекСтрока.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекСостояние = Родитель[ИмяФлажка];
	
	НайденыВключенные  = Ложь;
	НайденыВыключенные = Ложь;
	
	Для Каждого Строка из Родитель.ПолучитьЭлементы() Цикл
		Если Строка[ИмяФлажка] = 0 Тогда
			НайденыВыключенные = Истина;
		ИначеЕсли Строка[ИмяФлажка] = 1
			ИЛИ Строка[ИмяФлажка] = 2 Тогда
			НайденыВключенные  = Истина;
		КонецЕсли; 
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если НайденыВключенные И НайденыВыключенные Тогда
		Включить = 2;
	ИначеЕсли НайденыВключенные И (Не НайденыВыключенные) Тогда
		Включить = 1;
	ИначеЕсли (Не НайденыВключенные) И НайденыВыключенные Тогда
		Включить = 0;
	ИначеЕсли (Не НайденыВключенные) И (Не НайденыВыключенные) Тогда
		Включить = 2;
	КонецЕсли;
	
	Если Включить = ТекСостояние Тогда
		Возврат;
	Иначе
		Родитель[ИмяФлажка] = Включить;
		УстановитьПометкиРодителей(Родитель, ИмяФлажка);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеНаСервере(АдресФайлаВоВременномХранилище)
	
	Если РежимРаботыНаКлиенте Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml");
		
	Иначе
		
		ИмяВременногоФайла = ИмяФайлаВыгрузки;
		
	КонецЕсли;
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ЗаполнитьДеревоМетаданныхНаСервере(ОбъектНаСервере);
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ИмяФайла", ИмяВременногоФайла);
	
	//!!!
	СтруктураПараметров.Вставить("РежимОтладки", РежимОтладки);
	
	ОбъектНаСервере.ВыполнитьВыгрузку(СтруктураПараметров);
	
	Если РежимРаботыНаКлиенте Тогда
		
		Файл = Новый Файл(ИмяВременногоФайла);
		
		Если Файл.Существует() Тогда
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
			УдалитьФайлы(ИмяВременногоФайла);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьПометкиВыгружаемыхДанных(СтрокиИсходногоДерева, СтрокиЗаменяемогоДерева)
	
	КолонкаВыгружать = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("Выгружать");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаВыгружать, "Выгружать");
	
	КолонкаВыгружатьПриНеобходимости = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("ВыгружатьПриНеобходимости");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаВыгружатьПриНеобходимости, "ВыгружатьПриНеобходимости");
	
	КолонкаРазвернут = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("Развернут");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаРазвернут, "Развернут");
	
	КолонкаОтбор = СтрокиЗаменяемогоДерева.ВыгрузитьКолонку("Отбор");
	СтрокиИсходногоДерева.ЗагрузитьКолонку(КолонкаОтбор, "Отбор");
	
	Для Каждого СтрокаИсходногоДерева Из СтрокиИсходногоДерева Цикл
		
		ИндексСтроки = СтрокиИсходногоДерева.Индекс(СтрокаИсходногоДерева);
		СтрокаИзменяемогоДерева = СтрокиЗаменяемогоДерева.Получить(ИндексСтроки);
		
		ПроставитьПометкиВыгружаемыхДанных(СтрокаИсходногоДерева.Строки, СтрокаИзменяемогоДерева.Строки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеФайлПомещен(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Если ЗагружатьВФоновомРежиме = Ложь Тогда
			ТекстОповещения = Нстр("ru = 'Выполняется загрузка данных. Пожалуйста, подождите...'");
			ПоказатьОповещениеПользователя(ТекстОповещения);
		КонецЕсли;
		
		
		Если Не Адапт_ФайлСуществует(ВыбранноеИмяФайла) Тогда
			
			ТекстСообщения = Нстр("ru = 'Указанный файл не существует'");
			ПутьКДанным = ?(РежимРаботыНаКлиенте, "", "ИмяФайлаЗагрузки");
			СообщитьПользователю(ТекстСообщения, ПутьКДанным);
			Возврат;
			
		КонецЕсли;
		
		
		
		Если ЗагружатьВФоновомРежиме И Адапт_ВозможнаЗагрузкаВыгрузкаВФоновомРежиме() Тогда
			
			Адапт_ЗагрузитьДанныеВФоновомРежиме(Адрес, ВыбранноеИмяФайла);
		Иначе
			ЗагрузитьДанныеНаСервере(Адрес);
			Сигнал();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Адапт_ФайлСуществует(ВыбранноеИмяФайла) 
	
	Если РежимРаботыНаКлиенте Тогда
		Файл = Новый Файл(ВыбранноеИмяФайла);
		Результат = Файл.Существует();
	Иначе
		Результат = Адапт_ФайлСуществуетСервер(ВыбранноеИмяФайла);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция Адапт_ФайлСуществуетСервер(ВыбранноеИмяФайла) 
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	Результат = Файл.Существует();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция Адапт_ВозможнаЗагрузкаВыгрузкаВФоновомРежиме() 
	
	Результат = (Метаданные.ОбщиеМодули.Найти("ДлительныеОперации") <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Адапт_ВыгрузитьДанныеВФоновомРежиме() 
	
	АдресВХФайла = "";
	
	НаименованиеЗадания = "Фоновое задание Выгрузка данных в XML";
	ИмяМетода           = "Адапт_ВыполнитьВыгрузкуВФоне"; 
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОбработки);
	АдресВХОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НаименованиеЗадания",      НаименованиеЗадания);
	СтруктураПараметров.Вставить("ИмяМетода",                ИмяМетода);
	СтруктураПараметров.Вставить("АдресВХФайла",             АдресВХФайла);
	СтруктураПараметров.Вставить("АдресВХОбработки",         АдресВХОбработки);
	
	
	СтруктураФоновогоЗадания = Адапт_ВыгрузитьДанныеСервер(СтруктураПараметров);
	
	МодульДлительныеОперацииКлиент = Вычислить("ДлительныеОперацииКлиент");
    ПараметрыОжидания = МодульДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
    ПараметрыОжидания.Интервал = 1;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Адапт_ВыгрузитьДанныеВФоновомРежимеЗавершение", ЭтотОбъект);
	
    МодульДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция Адапт_ВыгрузитьДанныеСервер(СтруктураПараметров) 
	
	НаименованиеЗадания = СтруктураПараметров.НаименованиеЗадания;
	ИмяМетода           = СтруктураПараметров.ИмяМетода;
	АдресВХФайла        = СтруктураПараметров.АдресВХФайла;
	АдресВХОбработки    = СтруктураПараметров.АдресВХОбработки;
	
	Если РежимРаботыНаКлиенте Тогда
		ИмяВременногоФайлаСервер = ПолучитьИмяВременногоФайла("xml");
	Иначе
		ИмяВременногоФайлаСервер = ИмяФайлаВыгрузки;
	КонецЕсли;
	
	
	ПараметрыЗапуска = Адапт_ПараметрыВыгрузки(ИмяВременногоФайлаСервер);
	
	СтруктураФоновогоЗадания = Адапт_ВыполнитьФоновоеЗаданиеНаСервере(НаименованиеЗадания, ИмяМетода, ПараметрыЗапуска, АдресВХФайла, АдресВХОбработки);
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура Адапт_ВыгрузитьДанныеВФоновомРежимеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	Если РежимРаботыНаКлиенте И Не ПустаяСтрока(Результат.АдресРезультата) Тогда
		
		ИмяФайла = "Файл выгрузки.xml";
		Интерактивно = Истина;
		ПолучитьФайл(Результат.АдресРезультата, ИмяФайла, Интерактивно);
		
	Иначе
		
		Сигнал();
		ПоказатьПредупреждение(, "Выгрузка завершена");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Адапт_ЗагрузитьДанныеВФоновомРежиме(АдресВХФайла, ПутьКФайлуКлиент) 
	
	Если Не Адапт_ФайлСуществует(ПутьКФайлуКлиент) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХФайла);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		ПутьКФайлуНаСервере = ИмяВременногоФайла;
	Иначе
		ПутьКФайлуНаСервере = ПутьКФайлуКлиент;
	КонецЕсли;
	
	
	НаименованиеЗадания = "Фоновое задание Адаптивная загрузка данных из XML";
	ИмяМетода =           "ВыполнитьЗагрузку"; 
	ПараметрыЗапуска =    Адапт_ПараметрыЗагрузки(ПутьКФайлуНаСервере);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОбработки);
	АдресВХОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	СтруктураФоновогоЗадания = Адапт_ВыполнитьФоновоеЗаданиеНаСервере(НаименованиеЗадания, ИмяМетода, ПараметрыЗапуска, АдресВХФайла, АдресВХОбработки);
	
	МодульДлительныеОперацииКлиент = Вычислить("ДлительныеОперацииКлиент");
    ПараметрыОжидания = МодульДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
    ПараметрыОжидания.Интервал = 1;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Адапт_ЗагрузитьДанныеВФоновомРежимеЗавершение", ЭтотОбъект);
	
    МодульДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция Адапт_ВыполнитьФоновоеЗаданиеНаСервере(НаименованиеЗадания, ИмяМетода, ПараметрыЗапуска, АдресВХФайла, АдресВХОбработки) 
	
	Если АдресВХФайла = "" Тогда //файл находится на сервере
		ПутьКФайлуНаСервере = ПараметрыЗапуска.ИмяФайла;
	Иначе
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХФайла);
		
		ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ПутьКФайлуНаСервере);
		
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХОбработки);
	ПутьКФайлуОбработкиНаСервере = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ПутьКФайлуОбработкиНаСервере);
		
	
	ПараметрыЗапуска.ИмяФайла = ПутьКФайлуНаСервере;
	
    ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
    ПараметрыЗадания = Новый Структура;
    ПараметрыЗадания.Вставить("ИмяОбработки", ПутьКФайлуОбработкиНаСервере);
    ПараметрыЗадания.Вставить("ИмяМетода", ИмяМетода);
    ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыЗапуска);
    ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Истина);
	
    МодульДлительныеОперации = Вычислить("ДлительныеОперации");
    ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
    ПараметрыВыполнения.ЗапуститьВФоне = Истина;
    ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
    СтруктураФоновогоЗадания = МодульДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
    
    Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаСервере
Функция Адапт_ПараметрыЗагрузки(ИмяФайла)
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ИмяФайла", ИмяФайла);
	
	ПараметрыЗапуска.Вставить("ПриЗагрузкеИспользоватьРежимОбменаДанными",     Объект.ПриЗагрузкеИспользоватьРежимОбменаДанными);
	ПараметрыЗапуска.Вставить("ПродолжитьЗагрузкуВСлучаеВозникновенияОшибки",  Объект.ПродолжитьЗагрузкуВСлучаеВозникновенияОшибки);
	
	ПараметрыЗапуска.Вставить("ЗагружатьТолькоНовыеИИзмененные",               Объект.Адапт_ЗагружатьТолькоНовыеИИзмененные);
	ПараметрыЗапуска.Вставить("ОтключитьРегистрациюПлановОбмена",              Объект.Адапт_ОтключитьРегистрациюПлановОбмена);
	ПараметрыЗапуска.Вставить("ПропуститьЗаписьВерсииОбъекта",                 Объект.Адапт_ПропуститьЗаписьВерсииОбъекта);
	ПараметрыЗапуска.Вставить("НеВыполнятьКонтрольУдаляемых",                  Объект.Адапт_НеВыполнятьКонтрольУдаляемых);
	ПараметрыЗапуска.Вставить("ОтладкаЗагрузкаВТранзакции",                    ОтладкаЗагрузкаВТранзакции);
	ПараметрыЗапуска.Вставить("НеЗагружатьПредопределенные",                   НеЗагружатьПредопределенные);
	
	//!!!
	ПараметрыЗапуска.Вставить("РежимОтладки",                                  РежимОтладки);
	
	Возврат ПараметрыЗапуска;

КонецФункции

&НаСервере
Функция Адапт_ПараметрыВыгрузки(ИмяФайла)
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ИмяФайла", ИмяФайла);
	
	ПараметрыЗапуска.Вставить("ИспользоватьОтборПоДатеДляВсехОбъектов",        Объект.ИспользоватьОтборПоДатеДляВсехОбъектов);
	ПараметрыЗапуска.Вставить("ВыгружатьСДокументомЕгоДвижения",               Объект.ВыгружатьСДокументомЕгоДвижения);
	ПараметрыЗапуска.Вставить("ПериодВыгрузки",                                ПериодВыгрузки);
	ПараметрыЗапуска.Вставить("ТипВыгрузкиПериодическихРегистров",             Объект.ТипВыгрузкиПериодическихРегистров);
	ПараметрыЗапуска.Вставить("ДатаНачала",                                    Объект.ДатаНачала);
	ПараметрыЗапуска.Вставить("ДатаОкончания",                                 Объект.ДатаОкончания);
	ПараметрыЗапуска.Вставить("ДеревоМетаданных",                              РеквизитФормыВЗначение("Объект.ДеревоМетаданных"));
	ПараметрыЗапуска.Вставить("РежимРаботыНаКлиенте",                          РежимРаботыНаКлиенте);
	
	//!!!
	ПараметрыЗапуска.Вставить("РежимОтладки",                                  РежимОтладки);
	
	
	Возврат ПараметрыЗапуска;

КонецФункции

//+ Muraviev Sergey 2023.12.24
&НаКлиенте
Процедура ПрогрессВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполняется" или Результат.Статус = "Выполнено" Тогда
		
		Прогресс = Результат.Прогресс;
		
		Если Прогресс <> Неопределено Тогда  
			
			Индикатор = Прогресс.Процент; // Индикатор - полей Индикатор на форме
			ТекстСопровождения = Прогресс.Текст; // поле надпись на форме
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Адапт_ЗагрузитьДанныеВФоновомРежимеЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	Сигнал();Сигнал();Сигнал();
	ПоказатьПредупреждение(, "Загрузка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(АдресФайлаВоВременномХранилище)
	
	Если РежимРаботыНаКлиенте Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
	Иначе
		
		ИмяВременногоФайла = ИмяФайлаЗагрузки;
		
	КонецЕсли;
	
	ПараметрыЗапуска = Адапт_ПараметрыЗагрузки(ИмяВременногоФайла);
	
	
	АдресРезультата = "";
	РеквизитФормыВЗначение("Объект").ВыполнитьЗагрузку(ПараметрыЗапуска, АдресРезультата);
	
	Если РежимРаботыНаКлиенте Тогда
		
		УдалитьФайлы(ИмяВременногоФайла);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВыгружаемыеПоСсылкеНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ЗаполнитьДеревоМетаданныхНаСервере(ОбъектНаСервере);
	ОбъектНаСервере.СоставВыгрузки(Истина);
	ЗначениеВРеквизитФормы(ОбъектНаСервере.ДеревоМетаданных, "Объект.ДеревоМетаданных");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхНаСервере(ОбъектНаСервере)
	
	ДеревоМетаданных = РеквизитФормыВЗначение("Объект.ДеревоМетаданных");
	
	ОбъектНаСервере.Инициализация();
	
	ПроставитьПометкиВыгружаемыхДанных(ОбъектНаСервере.ДеревоМетаданных.Строки, ДеревоМетаданных.Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтображениеДерева(СтрокиДерева)
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Строка.Развернут = Элементы.ДеревоМетаданных.Развернут(ИдентификаторСтроки);
		
		СохранитьОтображениеДерева(Строка.ПолучитьЭлементы());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьОтображениеДерева(СтрокиДерева)
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Если Строка.Развернут Тогда
			Элементы.ДеревоМетаданных.Развернуть(ИдентификаторСтроки);
		КонецЕсли;
		
		ВосстановитьОтображениеДерева(Строка.ПолучитьЭлементы());
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяОбъектаПоТипуДляЗапроса(Ссылка)
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	ИмяМетаданных = МетаданныеОбъекта.Имя;
	
	ИмяДляЗапроса = "";
	
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "Справочник";
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "Документ";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "ПланВидовХарактеристик";
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "ПланСчетов";
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "ПланВидовРасчета";
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "ПланОбмена";
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "БизнесПроцесс";
	ИначеЕсли Метаданные.Задачи.Содержит(МетаданныеОбъекта) Тогда
		ИмяДляЗапроса = "Задача";
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяДляЗапроса) Тогда
		Возврат "";
	Иначе
		Возврат ИмяДляЗапроса + "." + ИмяМетаданных;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранныеЗначения)
	
	Если ТипЗнч(ВыбранныеЗначения) = Тип("Структура") Тогда
		
		РезультатЗапроса = ПолучитьИзВременногоХранилища(ВыбранныеЗначения.ДанныеВыбора);
		
		Если ТипЗнч(РезультатЗапроса)=Тип("Массив") Тогда
			
			РезультатЗапроса = РезультатЗапроса[РезультатЗапроса.ВГраница()];
			
			Если РезультатЗапроса.Колонки.Найти("Ссылка") <> Неопределено Тогда
				ВыбранныеСсылки = РезультатЗапроса.Выгрузить();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВыбранныеСсылки = ВыбранныеЗначения;
		
	КонецЕсли;
	
	Для Каждого Значение Из ВыбранныеСсылки Цикл
		
		НоваяСтрока = Объект.ДополнительныеОбъектыДляВыгрузки.Добавить();
		НоваяСтрока.Объект = Значение.Ссылка;
		НоваяСтрока.ИмяОбъектаДляЗапроса = ИмяОбъектаПоТипуДляЗапроса(Значение.Ссылка);
		
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаНаКлиентеИлиНаСервереПриИзменении(Элемент)
	
	ПриИзмененииРежимаРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНаКлиентеИлиНаСервереПриИзменении(Элемент)
	
	ПриИзмененииРежимаРаботы();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВерсиюИРежимСовместимостиПлатформы()
	
	Информация = Новый СистемнаяИнформация;
	Если Не (Лев(Информация.ВерсияПриложения, 3) = "8.3"
		И (Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать
		Или (Метаданные.РежимСовместимости <> Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_1
		И Метаданные.РежимСовместимости <> Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_13
		И Метаданные.РежимСовместимости <> Метаданные.СвойстваОбъектов.РежимСовместимости["Версия8_2_16"]
		И Метаданные.РежимСовместимости <> Метаданные.СвойстваОбъектов.РежимСовместимости["Версия8_3_1"]
		И Метаданные.РежимСовместимости <> Метаданные.СвойстваОбъектов.РежимСовместимости["Версия8_3_2"]))) Тогда
		
		ВызватьИсключение Нстр("ru = 'Обработка предназначена для запуска на версии платформы
			|1С:Предприятие 8.3 с отключенным режимом совместимости или выше'");
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДеревоМетаданныхПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоМетаданных.ТекущиеДанные;
		
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Элементы.ДеревоМетаданныхОтбор.ТолькоПросмотр         = Не ТекущаяСтрока.ДоступенОтбор;
	Элементы.ДеревоМетаданныхСкопироватьОтбор.Доступность = ТекущаяСтрока.ДоступенОтбор;
	Элементы.ДеревоМетаданныхУдалитьОтбор.Доступность     = ТекущаяСтрока.ДоступенОтбор;
	
	Элементы.ДеревоМетаданныхПоказатьВыгружаемыеДанные.Доступность  = ТекущаяСтрока.ДоступенОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоМетаданных.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновщикНастроек = ИнициализироватьКомпоновщикНастроек(Элементы.ДеревоМетаданных.ТекущаяСтрока);
	ТекущаяСтрока.Отбор = КомпоновщикНастроек.Настройки.Отбор;
	
КонецПроцедуры

&НаСервере
Функция ИнициализироватьКомпоновщикНастроек(Знач ИндексСтроки = Неопределено, Знач СтрокаДереваМетаданных = Неопределено)
	
	Если СтрокаДереваМетаданных = Неопределено Тогда
		СтрокаДереваМетаданных = Объект.ДеревоМетаданных.НайтиПоИдентификатору(ИндексСтроки);
	КонецЕсли;
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ТекстЗапроса = ПолучитьТекстЗапросаПоСтроке(СтрокаДереваМетаданных);
	СхемаКомпоновкиДанных = ОбъектОбработка.СхемаКомпоновкиДанных(ТекстЗапроса);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	АдресВХ = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ЕстьДополнительныеОтборы  = СтрокаДереваМетаданных.Отбор.Элементы.Количество() <> 0; 
	
	Если ЕстьДополнительныеОтборы Тогда
		ОбъектОбработка.СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Отбор, СтрокаДереваМетаданных.Отбор);
	КонецЕсли;
	
	Возврат КомпоновщикНастроек;
		
КонецФункции

//+ Muraviev Sergey 2023.12.24
// Для регистров, подчиненных регистратору, можно предоставлять отбор только по регистратору 
&НаСервере
Функция ПолучитьТекстЗапросаПоСтроке(СтрокаДереваМетаданных) 
	
	Если ТипЗнч(СтрокаДереваМетаданных) = Тип("СтрокаДереваЗначений") Тогда
		ОбъектМетаданных  = СтрокаДереваМетаданных.Метаданные;
	Иначе	
		ОбъектМетаданных  = Метаданные[СтрокаДереваМетаданных.ПолучитьРодителя().ПолноеИмяМетаданных][СтрокаДереваМетаданных.ПолноеИмяМетаданных];
	КонецЕсли;
	ИмяМетаданных = ОбъектМетаданных.ПолноеИмя();
	
	Если Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) 
			ИЛИ (
				Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) 
				И Метаданные.РегистрыСведений[ОбъектМетаданных.Имя].РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ _.Регистратор ИЗ " + ИмяМетаданных + " КАК _ ";
	Иначе
		ОбъектОбработка = РеквизитФормыВЗначение("Объект");
		ТекстЗапроса = ОбъектОбработка.ПолучитьТекстЗапросаПоСтроке(СтрокаДереваМетаданных, Ложь);
	КонецЕсли;

	Возврат ТекстЗапроса;
	
КонецФункции


&НаСервере
Процедура УдалитьНедоступныеЭлементыОтбора(ДоступныеПоляОтбора, ИсточникЗначения) Экспорт
	
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	
	МассивЭлементовДляУдаления = Новый Массив;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
				
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			УдалитьНедоступныеЭлементыОтбора(ДоступныеПоляОтбора, ЭлементИсточник);
		Иначе
			Если ДоступныеПоляОтбора.НайтиПоле(ЭлементИсточник.ЛевоеЗначение) = Неопределено Тогда
				МассивЭлементовДляУдаления.Добавить(ЭлементИсточник);
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемоеПоле Из МассивЭлементовДляУдаления Цикл
		 ИсточникЭлементов.Удалить(УдаляемоеПоле);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьОтбор(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоМетаданных.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, Нстр("ru = 'Не выбрана строка отбора данных для копирования'"));
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("СкопироватьОтборЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(Обработчик, Нстр("ru = 'Очистить текущие значения отбора в строках?'"), РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьОтборЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОчищатьПриемник = РезультатВопроса = КодВозвратаДиалога.Да;
	СкопироватьОтборСервер(Элементы.ДеревоМетаданных.ТекущаяСтрока, ОчищатьПриемник);
		
КонецПроцедуры

&НаСервере
Процедура СкопироватьОтборСервер(ИндексСтроки, ОчищатьПриемник)
	
	СтрокаДереваМетаданных = Объект.ДеревоМетаданных.НайтиПоИдентификатору(ИндексСтроки);	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
	СкопироватьОтборДляДерева(Объект.ДеревоМетаданных.ПолучитьЭлементы(), СтрокаДереваМетаданных, ОчищатьПриемник, ОбработкаОбъект);
		
КонецПроцедуры

&НаСервере
Процедура СкопироватьОтборДляДерева(СтрокиДерева, СтрокаДереваМетаданных, ОчищатьПриемник, ОбработкаОбъект)
	
	Для Каждого СтрокаДереваВыгрузки Из СтрокиДерева Цикл
		
		Если СтрокаДереваВыгрузки.ДоступенОтбор 
			И СтрокаДереваВыгрузки.Выгружать = 1 
			И Не СтрокаДереваМетаданных = СтрокаДереваВыгрузки Тогда
			
			СтарыйОтбор = СтрокаДереваВыгрузки.Отбор;
						
			КомпоновщикНастроек = ИнициализироватьКомпоновщикНастроек(,СтрокаДереваВыгрузки);
						
			ОбработкаОбъект.СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Отбор, 
				СтрокаДереваМетаданных.Отбор, 
				ОчищатьПриемник);
				
			УдалитьНедоступныеЭлементыОтбора(
			    КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора,
				КомпоновщикНастроек.Настройки.Отбор
				);	
				
			СтрокаДереваВыгрузки.Отбор = КомпоновщикНастроек.Настройки.Отбор;
			
		КонецЕсли;	
		
		Если СтрокаДереваВыгрузки.ПолучитьЭлементы().Количество() > 0 Тогда
			 СкопироватьОтборДляДерева(СтрокаДереваВыгрузки.ПолучитьЭлементы(), СтрокаДереваМетаданных, ОчищатьПриемник, ОбработкаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтбор(Команда)
	
	УдалитьОтборДляДерева(Объект.ДеревоМетаданных.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтборДляДерева(СтрокиДерева)
	
	Для Каждого СтрокаДереваВыгрузки Из СтрокиДерева Цикл
		
		Если СтрокаДереваВыгрузки.ДоступенОтбор 
			И СтрокаДереваВыгрузки.Выгружать = 1 Тогда
						
			СтрокаДереваВыгрузки.Отбор.Элементы.Очистить();
			
		КонецЕсли;	
		
		Если СтрокаДереваВыгрузки.ПолучитьЭлементы().Количество() > 0 Тогда
			 УдалитьОтборДляДерева(СтрокаДереваВыгрузки.ПолучитьЭлементы());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыгружаемыеДанные(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоМетаданных.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабДокумент = ПоказатьВыгружаемыеДанныеСервер(Элементы.ДеревоМетаданных.ТекущаяСтрока);
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПоказатьВыгружаемыеДанныеСервер(ИндексСтроки)
	
	СтрокаДереваМетаданных = Объект.ДеревоМетаданных.НайтиПоИдентификатору(ИндексСтроки);
		
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработка.ДатаНачала = ПериодВыгрузки.ДатаНачала;
	ОбъектОбработка.ДатаОкончания = ПериодВыгрузки.ДатаОкончания;
	
	ТекстЗапроса = ОбъектОбработка.ПолучитьТекстЗапросаПоСтроке(СтрокаДереваМетаданных, Ложь);
	СхемаКомпоновкиДанных = ОбъектОбработка.СхемаКомпоновкиДанных(ТекстЗапроса);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор)));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ЕстьДополнительныеОтборы  = СтрокаДереваМетаданных.Отбор.Элементы.Количество() <> 0; 
	
	Если ЕстьДополнительныеОтборы Тогда
		ОбъектОбработка.СкопироватьЭлементы(КомпоновщикНастроек.Настройки.Отбор, СтрокаДереваМетаданных.Отбор);
	КонецЕсли;
	
	ОбъектОбработка.УстановитьНастройкуСтруктурыВыводаРезультата(КомпоновщикНастроек.Настройки, Истина);
		
	ОбъектОбработка.УстановитьЗначениеПараметраСКД(КомпоновщикНастроек, "ДатаНачала",        ОбъектОбработка.ДатаНачала);
	ОбъектОбработка.УстановитьЗначениеПараметраСКД(КомпоновщикНастроек, "ДатаОкончания",     ОбъектОбработка.ДатаОкончания);
	
	// Компоновка макета компоновки данных.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.Настройки, 
		ДанныеРасшифровки, 
		,
		Тип("ГенераторМакетаКомпоновкиДанных")
		);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ТабДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Асинх Процедура Адапт_ПометитьИзНавигационнойСсылки(Команда)
	
	НавСсылкаСтрока = Адапт_ПрочитатьТекстИзБуфера();
	
	Обещание = ВвестиСтрокуАсинх(НавСсылкаСтрока, "Введите навигационную ссылку",, Ложь);
	
	Результат = Ждать Обещание;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
    Значение = Адапт_ПолучитьСсылкуИзНавигационной(Результат);
	
	СтрокаИд = Адапт_НайтиСтрокуЗначения(Значение);
	
	Если СтрокаИд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.ДеревоМетаданных.НайтиПоИдентификатору(СтрокаИД); 
	
	Адапт_ДобавитьОтборПоСсылке(Строка.Отбор, Значение);
	
	Строка.Выгружать = Истина;
	
	Элементы.ДеревоМетаданных.ТекущаяСтрока = СтрокаИд;
	
КонецПроцедуры

&НаКлиенте
Процедура Адапт_ДобавитьОтборПоСсылке(Отбор, выбСсылка) 
	
	Найдено = Неопределено;
	ЕстьДругиеСсылки = Ложь;
	
	МассивЭлементовОтбораСсылка = Адапт_НайтиЭлементыОтбораСоСсылками(Отбор);
	
	Найдено = Адапт_НайтиЗначениеСвойстваВКоллекции(МассивЭлементовОтбораСсылка, "ПравоеЗначение", выбСсылка);
	ГруппаИли = Адапт_НайтиГруппуИли(Отбор);
	
	Если Найдено = Неопределено Тогда
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ПравоеЗначение = выбСсылка;
		ЭлементОтбора.Использование = Истина;
		МассивЭлементовОтбораСсылка.Добавить(ЭлементОтбора);
	Иначе
		ЭлементОтбора = Найдено;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если МассивЭлементовОтбораСсылка.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;

	
	
	Если ГруппаИли = Неопределено Тогда
		ГруппаИли = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИли.ИдентификаторПользовательскойНастройки = "Или";
		ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	КонецЕсли;
		
	Для каждого Эл Из МассивЭлементовОтбораСсылка Цикл
		Если Эл.Родитель = Неопределено Тогда
			НовЭлемент = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовЭлемент, Адапт_СкопироватьЭлементОтбора(Эл));
			//Отбор.Элементы.Удалить(Эл);
		КонецЕсли;
	КонецЦикла;
	
	МассивЭлементовОтбораСсылка = Адапт_НайтиЭлементыОтбораСоСсылками(Отбор);
	Для каждого Эл Из Адапт_НайтиЭлементыОтбораСоСсылками(Отбор) Цикл
		Если Эл.Родитель = Неопределено Тогда
			Отбор.Элементы.Удалить(Эл);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция Адапт_СкопироватьЭлементОтбора(Знач ЭлементОтбора) 
	
	Возврат ЭлементОтбора;
	
КонецФункции

&НаКлиенте
Функция Адапт_НайтиЭлементыОтбораСоСсылками(Отбор, МассивЭлементовОтбораСсылка = Неопределено) 
	
	ЛевоеЗначениеСсылка = Новый ПолеКомпоновкиДанных("Ссылка");
	Если МассивЭлементовОтбораСсылка = Неопределено Тогда
		МассивЭлементовОтбораСсылка = Новый Массив;
	КонецЕсли;
	
	Для каждого Эл Из Отбор.Элементы Цикл
		Если ТипЗнч(Эл) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Адапт_НайтиЭлементыОтбораСоСсылками(Эл, МассивЭлементовОтбораСсылка);
			Продолжить;
		КонецЕсли;
		Если Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно 
			И Эл.ЛевоеЗначение = ЛевоеЗначениеСсылка Тогда
			
			МассивЭлементовОтбораСсылка.Добавить(Эл);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивЭлементовОтбораСсылка;
	
КонецФункции

&НаКлиенте
Функция Адапт_НайтиГруппуИли(Отбор) 
	
	ГруппаИли = Неопределено;
	Для каждого Эл Из Отбор.Элементы Цикл
		Если ТипЗнч(Эл) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") И Эл.ИдентификаторПользовательскойНастройки = "Или" Тогда
			ГруппаИли = Эл;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ГруппаИли;
	
КонецФункции

&НаКлиенте
Функция Адапт_ПрочитатьТекстИзБуфера() 
	
    WScriptShell = Новый COMОбъект("WScript.Shell");

    ИмяВремФайла = ПолучитьИмяВременногоФайла();
	
    ТекстовыйДокумент = Новый ТекстовыйДокумент;
    ТекстовыйДокумент.Записать(ИмяВремФайла);
	
    СтрокаЗапуска = "powershell -c Get-Clipboard | Out-File """ + ИмяВремФайла + """";
    WScriptShell.Run(СтрокаЗапуска, 0, 1);
	
    ТекстовыйДокумент.Прочитать(ИмяВремФайла);
    Результат = ТекстовыйДокумент.ПолучитьТекст();

    Результат = Сред(Результат, 1, СтрДлина(Результат) - 1);
	
    НачатьУдалениеФайлов(, ИмяВремФайла);
	
    Возврат Результат;
	
КонецФункции

&НаСервере
Функция Адапт_ПолучитьСсылкуИзНавигационной(НС)
    
    ПерваяТочка = Найти(НС, "e1cib/data/");
    ВтораяТочка = Найти(НС, "?ref=");
    
    ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
	Попытка
		ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	    ТекстСообщения = "Невозможно обработать навигационную ссылку: " + ПредставлениеТипа + ".ПустаяСсылка";
		ВызватьИсключение(ТекстСообщения);
	КонецПопытки;
    
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
    выбСсылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
	Возврат выбСсылка;
	
КонецФункции

&НаСервере
Функция Адапт_НайтиСтрокуЗначения(выбЗначение)
	
	Попытка
		ПолноеИмяМетаданных = выбЗначение.Метаданные().ПолноеИмя();
	Исключение
	    ОШ = ОписаниеОшибки();
		Сообщить(ОШ);
		Возврат Неопределено;
		
	КонецПопытки;
	
	ЧастиИмени = СтрРазделить(ПолноеИмяМетаданных, ".", Ложь);
	ВидОбъекта = Адапт_ВидОбъектаВоМножественномЧисле(ЧастиИмени[0]);
	ИмяОбъекта = ЧастиИмени[1];
	
	Строка = Адапт_НайтиЗначениеСвойстваВКоллекции(
		Объект.ДеревоМетаданных.ПолучитьЭлементы(), 
		"ПолноеИмяМетаданных", 
		ВидОбъекта);
		
	Если Строка = Неопределено Тогда
		Сообщить("Не найден вид объекта в дереве: " + ВидОбъекта);
		Возврат Неопределено;
	КонецЕсли;
	
	Строка = Адапт_НайтиЗначениеСвойстваВКоллекции(
		Строка.ПолучитьЭлементы(), 
		"ПолноеИмяМетаданных", 
		ИмяОбъекта);
		
	Если Строка = Неопределено Тогда
		Сообщить("Не найден объект в дереве: " + ПолноеИмяМетаданных);
		Возврат Неопределено;
	КонецЕсли;

	Возврат Строка.ПолучитьИдентификатор();
	
КонецФункции

&НаСервереБезКонтекста
Функция Адапт_ВидОбъектаВоМножественномЧисле(ВидОбъекта) 
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("Константа",              "Константы");
	Соотв.Вставить("Справочник",             "Справочники");
	Соотв.Вставить("Документ",               "Документы");
	Соотв.Вставить("ПланВидовХарактеристик", "ПланыВидовХарактеристик");
	Соотв.Вставить("ПланСчетов",             "ПланыСчетов");
	Соотв.Вставить("ПланВидовРасчета",       "ПланыВидовРасчета");
	Соотв.Вставить("РегистрСведений",        "РегистрыСведений");
	Соотв.Вставить("РегистрНакопления",      "РегистрыНакопления");
	Соотв.Вставить("РегистрБухгалтерии",     "РегистрыБухгалтерии");
	Соотв.Вставить("РегистрРасчета",         "РегистрыРасчета");
	Соотв.Вставить("БизнесПроцесс",          "БизнесПроцессы");
	Соотв.Вставить("Задача",                 "Задачи");
	Соотв.Вставить("ПланОбмена",             "ПланыОбмена");
	
	Возврат Соотв[ВидОбъекта];
	
КонецФункции

&НаСервере
Процедура Адапт_УстановитьПредохранительЗагрузкиНаРабочейБазе() 
	
	ВсеПараметрыСеанса = ПараметрыСеанса;
	Если Адапт_ЕстьСвойство(ВсеПараметрыСеанса, "РаботаСВнешнимиРесурсамиЗаблокирована") 
		И ВсеПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = Ложь Тогда //Это рабочая база
		
		ЗагрузкаЗаблокированаВРабочейБазе = Истина;
		Элементы.ГруппаБлокировкаЗагрузки.Видимость = Истина;
		Элементы.ГруппаПредохранитель.Доступность = Ложь;
	Иначе
		ЗагрузкаЗаблокированаВРабочейБазе = Ложь;
		Элементы.ГруппаБлокировкаЗагрузки.Видимость = Ложь;
		Элементы.ГруппаПредохранитель.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция Адапт_ЕстьСвойство(Элемент, Свойство)
	
	Попытка
 		ЗначениеСвойства = Элемент[Свойство];
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция Адапт_НайтиЗначениеСвойстваВКоллекции(Знач КоллекцияЭлементов, ИмяСвойства, Значение) 
	
	ЭтоДерево = (ТипЗнч(КоллекцияЭлементов) = Тип("ДанныеФормыКоллекцияЭлементовДерева"));
	
	Для каждого Строка Из КоллекцияЭлементов Цикл
		Если Строка[ИмяСвойства] = Значение Тогда
			Возврат Строка;
		КонецЕсли;
		
		Если ЭтоДерево = Ложь Тогда
			Продолжить;	
		КонецЕсли;
		
		Подчиненные = Строка.ПолучитьЭлементы();
		Если Подчиненные.Количество() > 0 Тогда
			Найдено = Адапт_НайтиЗначениеСвойстваВКоллекции(Подчиненные, ИмяСвойства, Значение);
			Если Найдено <> Неопределено Тогда
				Возврат Найдено;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура Адапт_СнятьБлокировку(Команда)
	
	ЗагрузкаЗаблокированаВРабочейБазе = Ложь;
	Элементы.ДекорацияЗагрузкаЗаблокирована.Видимость = Ложь;
	Элементы.ГруппаПредохранитель.Доступность = Истина;
	Элементы.СнятьБлокировку.Доступность = Ложь;
	Элементы.СнятьБлокировку.Заголовок = "Блокировка снята";
	
КонецПроцедуры

&НаСервере
Функция Адапт_ОбщийМодуль(ИмяМодуля) 
	
	Попытка
		Возврат Вычислить(ИмяМодуля);
	Исключение
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура Адапт_ИнициализироватьНастройкиВыгрузкиЗагрузки() 
	
	// действует только при первом запуске обработки, потом эти значения будут заменены сохраненными настройками формы
	Объект.Адапт_ЗагружатьТолькоНовыеИИзмененные = Истина;
	Объект.Адапт_НеВыполнятьКонтрольУдаляемых = Ложь;
	Объект.Адапт_ОтключитьРегистрациюПлановОбмена = Истина;
	Объект.Адапт_ПропуститьЗаписьВерсииОбъекта = Истина;
	ИмяФайлаОбработки = РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	
	Если Адапт_ВозможнаЗагрузкаВыгрузкаВФоновомРежиме() Тогда
		ВыгружатьВФоновомРежиме = Истина;
		ЗагружатьВФоновомРежиме = Истина;
	Иначе
		ВыгружатьВФоновомРежиме = Ложь;
		ЗагружатьВФоновомРежиме = Ложь;
		Элементы.ВыгружатьВФоновомРежиме.Видимость = Ложь;
		Элементы.ЗагружатьВФоновомРежиме.Видимость = Ложь;
	КонецЕсли;
	
	Если Адапт_ОбщийМодуль("УдалениеПомеченныхОбъектовСлужебный") = Неопределено Тогда
		Элементы.НеВыполнятьКонтрольУдаляемых.Видимость = Ложь;
	КонецЕсли;
	
	Если Адапт_ОбщийМодуль("ВерсионированиеОбъектов") = Неопределено Тогда
		Элементы.ПропуститьЗаписьВерсииОбъекта.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//+ Muraviev Sergey 2023.12.24
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Исправление ошибки Неизвестный идентификатор формы
	Если КлючУникальности = Неопределено Тогда
		ИмяОбработки = СтрРазделить(ЭтотОбъект.ИмяФормы, ".")[1];
		
		КлючУникальности = ИмяОбработки + XMLСтрока(ТекущаяДата());
		
	КонецЕсли;
	
	Если Адапт_ВозможнаЗагрузкаВыгрузкаВФоновомРежиме() = Ложь Тогда
		ЗагружатьВФоновомРежиме = Ложь;
		Элементы.ЗагружатьВФоновомРежиме.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	
	ЧастиИмени = СтрРазделить(ЭтотОбъект.ИмяФормы, ".");
	ИмяОбработки = ЧастиИмени[0] + "." + ЧастиИмени[1];
	ОткрытьФорму(ИмяОбработки + ".Форма.ОПрограмме", , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


#КонецОбласти
