
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Версия = "2024.01";
	ДомашняяСтраница = "https://infostart.ru/1c/1964833/";
	Описание = ПолучитьОписание();
	ЗакрыватьЕслиНеВФокусе = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДомашняяСтраницаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(ДомашняяСтраница);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписание() 
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Описание");
	
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкноНеВФокусе() Экспорт 
	
	Если Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если Открыта() И ЗакрыватьЕслиНеВФокусе = Ложь Тогда
		ЗакрыватьЕслиНеВФокусе = Истина;
	КонецЕсли;
	
	Если ВводДоступен() = Ложь И ЗакрыватьЕслиНеВФокусе Тогда
		Окна = ПолучитьОкна();
		
		Закрыть();
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 0.3, Истина);
	
КонецПроцедуры